-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\irakw01\Wozniak PC porting Dropbox\Abigail Wozniak\Job tenure\GSS job tenure\read_gss_jobtenure.log
  log type:  text
 opened on:   9 Jan 2020, 14:25:44

. 
. qui do GSS.do

. 
. drop if age < 22 | age > 64
(14,871 observations deleted)

. *drop if age < 18 | age > 64
. drop if wrkstat > 4
(11,499 observations deleted)

. * exclude black oversamples
. drop if inlist(sample,4,5,7)==1
(381 observations deleted)

. 
. summ age wrkstat

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     38,063    40.43633    11.34206         22         64
     wrkstat |     38,063    1.349946    .7696204          1          4

. 
. tab1 year

-> tabulation of year  

   Gss year |
   for this |
 respondent |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 |        851        2.24        2.24
       1973 |        773        2.03        4.27
       1974 |        756        1.99        6.25
       1975 |        759        1.99        8.25
       1976 |        748        1.97       10.21
       1977 |        866        2.28       12.49
       1978 |        842        2.21       14.70
       1980 |        802        2.11       16.81
       1982 |        851        2.24       19.04
       1983 |        943        2.48       21.52
       1984 |        862        2.26       23.78
       1985 |        914        2.40       26.19
       1986 |        836        2.20       28.38
       1987 |        893        2.35       30.73
       1988 |        867        2.28       33.01
       1989 |        898        2.36       35.37
       1990 |        839        2.20       37.57
       1991 |        884        2.32       39.89
       1993 |        987        2.59       42.48
       1994 |      1,929        5.07       47.55
       1996 |      1,936        5.09       52.64
       1998 |      1,818        4.78       57.42
       2000 |      1,793        4.71       62.13
       2002 |      1,767        4.64       66.77
       2004 |      1,799        4.73       71.49
       2006 |      2,774        7.29       78.78
       2008 |      1,226        3.22       82.00
       2010 |      1,185        3.11       85.12
       2012 |      1,154        3.03       88.15
       2014 |      1,496        3.93       92.08
       2016 |      1,661        4.36       96.44
       2018 |      1,354        3.56      100.00
------------+-----------------------------------
      Total |     38,063      100.00

. 
. gen ageg=.
(38,063 missing values generated)

. replace ageg=1 if age < 25
(2,602 real changes made)

. replace ageg=2 if age>=25 & age < 35
(10,986 real changes made)

. replace ageg=3 if age>=35 & age < 45
(10,494 real changes made)

. replace ageg=4 if age>=45 & age < 55
(8,529 real changes made)

. replace ageg=5 if age >= 55
(5,452 real changes made)

. 
. label define ageglbl 1 "Less than 25" 2 "25 to 34" 3 "35 to 44" 4 "45 to 54" 5 "55 plus"

. label values ageg ageglbl

. 
. gen ageg4=.
(38,063 missing values generated)

. replace ageg4=1 if age < 25
(2,602 real changes made)

. replace ageg4=2 if age>=25 & age < 35
(10,986 real changes made)

. replace ageg4=3 if age>=35 & age < 55
(19,023 real changes made)

. replace ageg4=4 if age >= 55
(5,452 real changes made)

. 
. tab1 ageg ageg4

-> tabulation of ageg  

        ageg |      Freq.     Percent        Cum.
-------------+-----------------------------------
Less than 25 |      2,602        6.84        6.84
    25 to 34 |     10,986       28.86       35.70
    35 to 44 |     10,494       27.57       63.27
    45 to 54 |      8,529       22.41       85.68
     55 plus |      5,452       14.32      100.00
-------------+-----------------------------------
       Total |     38,063      100.00

-> tabulation of ageg4  

      ageg4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,602        6.84        6.84
          2 |     10,986       28.86       35.70
          3 |     19,023       49.98       85.68
          4 |      5,452       14.32      100.00
------------+-----------------------------------
      Total |     38,063      100.00

. 
. gen edg=.
(38,063 missing values generated)

. replace edg=1 if educ>=0 & educ<=12
(16,842 real changes made)

. replace edg=2 if educ > 12 & educ < 98
(21,154 real changes made)

. label define edglbl 1 "HS or less" 2 "Some college or more"

. label values edg edglbl

. 
. tab1 edg

-> tabulation of edg  

                 edg |      Freq.     Percent        Cum.
---------------------+-----------------------------------
          HS or less |     16,842       44.33       44.33
Some college or more |     21,154       55.67      100.00
---------------------+-----------------------------------
               Total |     37,996      100.00

. 
. gen female=(sex==2)

. 
. * For 2004 on, need to use a weight. Using wtsall. Prior to 2004 is self-weighting but appears reflected in wtsall.
. 
. 
. * Plot joblose and jobfind over time, also mobile16. These are the long series.
. 
. * dummy for likely or very likely to lose job or be laid off in next 12 months
. gen djoblose=.
(38,063 missing values generated)

. replace djoblose=1 if joblose==1 | joblose==2
(2,063 real changes made)

. replace djoblose=0 if joblose==3 | joblose==4
(17,806 real changes made)

. 
. * dummy for easy or somewhat easy to find equally good job - only one other cat, which is not easy
. gen djobfind=.
(38,063 missing values generated)

. replace djobfind=1 if jobfind==1 | jobfind==2
(11,695 real changes made)

. replace djobfind=0 if jobfind==3 
(8,099 real changes made)

. 
. gen djobfind_very=.
(38,063 missing values generated)

. replace djobfind_very=1 if jobfind==1 
(4,995 real changes made)

. replace djobfind_very=0 if jobfind==2 | jobfind==3 
(14,799 real changes made)

. 
. * dummy for living in different city or state vs age 16 
. gen dmobile=.
(38,063 missing values generated)

. replace dmobile=1 if mobile16==2 | mobile16==3
(22,194 real changes made)

. replace dmobile=0 if mobile16==1
(14,619 real changes made)

. 
. preserve

. collapse (mean) djoblose djobfind dmobile [pw=wtssall], by(year)

. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |         32    1991.906    13.74505       1972       2018
    djoblose |         24    .1028293     .024929   .0700703   .1604397
    djobfind |         24    .5886255    .0668169    .464486   .7061422
     dmobile |         32    .5885152    .0346744   .5051043   .6304348

. 
. sort year

. corr djobfind djoblose
(obs=24)

             | djobfind djoblose
-------------+------------------
    djobfind |   1.0000
    djoblose |  -0.7231   1.0000


. graph twoway connect djoblose year || connect djobfind year

. *graph twoway connect dmobile year
. 
. restore

. preserve

. collapse (mean) djoblose djobfind dmobile [pw=wtssall], by(year ageg4)

. 
. * Could do two-axis plot with unemp rate
. sort year ageg

. merge m:1 year using annual_UNRATE.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                            39
        from master                         0  (_merge==1)
        from using                         39  (_merge==2)

    matched                               128  (_merge==3)
    -----------------------------------------

. *tab1 year if _merge < 3
. drop if _merge < 3
(39 observations deleted)

. drop _merge

. 
. gr twoway line djoblose year if ageg4==1, lwidth(medthick) yaxis(1) || line djoblose year if ageg4==2, lwidth(medthick) yaxis(1) || line djoblose year if ageg4==3, lwidth(medthick) yaxis(1)
>  || line djoblose year if ageg4==4, lwidth(medthick) yaxis(1) ///
>   legend(label(1 "Less than 25") label(2 "25 to 34") label(3 "35 to 54") label(4 "55 plus")) ///
>   bgcolor(white) ytitle("Share likely/v. likely to lose job in next year") xtitle("Survey Year") ///
>   saving(djoblose_age, replace)
(note: file djoblose_age.gph not found)
(file djoblose_age.gph saved)

. *gr twoway connect djoblose year if ageg==1, yaxis(1) || connect djoblose year if ageg==2, yaxis(1) || connect djoblose year if ageg==3, yaxis(1) || connect djoblose year if ageg==4, yaxis(
> 1) || connect djoblose year if ageg==5, yaxis(1) || connect UNRATE year, yaxis(2) ///
>   legend(label(1 "Less than 25") label(2 "25 to 34") label(3 "35 to 44") label(4 "45 to 54") label(5 "55 plus")) ///
>   saving(djoblose_age, replace)
. 
. keep djoblose year ageg4 UNRATE

. save djoblose_age_graph.dta, replace
file djoblose_age_graph.dta saved

. 
. tsset ageg4 year
       panel variable:  ageg4 (strongly balanced)
        time variable:  year, 1972 to 2018, but with gaps
                delta:  1 unit

. reg djoblose UNRATE

      Source |       SS           df       MS      Number of obs   =        96
-------------+----------------------------------   F(1, 94)        =     38.36
       Model |  .055173418         1  .055173418   Prob > F        =    0.0000
    Residual |  .135196547        94  .001438261   R-squared       =    0.2898
-------------+----------------------------------   Adj R-squared   =    0.2823
       Total |  .190369965        95  .002003894   Root MSE        =    .03792

------------------------------------------------------------------------------
    djoblose |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      UNRATE |   .0148291   .0023942     6.19   0.000     .0100753    .0195829
       _cons |   .0099291   .0155596     0.64   0.525    -.0209648     .040823
------------------------------------------------------------------------------

. reg djoblose L1.UNRATE UNRATE F.UNRATE

      Source |       SS           df       MS      Number of obs   =        28
-------------+----------------------------------   F(3, 24)        =      5.44
       Model |  .019443343         3  .006481114   Prob > F        =    0.0054
    Residual |  .028607818        24  .001191992   R-squared       =    0.4046
-------------+----------------------------------   Adj R-squared   =    0.3302
       Total |   .04805116        27  .001779673   Root MSE        =    .03453

------------------------------------------------------------------------------
    djoblose |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      UNRATE |
         L1. |   .0297595   .0364153     0.82   0.422     -.045398     .104917
         --. |  -.0150369   .0445753    -0.34   0.739    -.1070357     .076962
         F1. |   .0098459    .023849     0.41   0.683     -.039376    .0590679
             |
       _cons |  -.0734528   .1027894    -0.71   0.482    -.2855997    .1386941
------------------------------------------------------------------------------

. *sort ageg4 year
. *by ageg4: reg djoblose UNRATE
. corr djoblose UNRATE
(obs=96)

             | djoblose   UNRATE
-------------+------------------
    djoblose |   1.0000
      UNRATE |   0.5384   1.0000


. 
. restore

. preserve

. collapse (mean) djoblose djobfind dmobile [pw=wtssall], by(year ageg)

. 
. gr twoway connect djobfind year if ageg==1 || connect djobfind year if ageg==2 || connect djobfind year if ageg==3 || connect djobfind year if ageg==4 || connect djobfind year if ageg==5, /
> //
>   legend(label(1 "Less than 25") label(2 "25 to 34") label(3 "35 to 44") label(4 "45 to 54") label(5 "55 plus")) ///
>   saving(djobfind_age, replace)
(file djobfind_age.gph saved)

. gr twoway connect dmobile year if ageg==1 || connect dmobile year if ageg==2 || connect dmobile year if ageg==3 || connect dmobile year if ageg==4 || connect dmobile year if ageg==5, ///
>   legend(label(1 "Less than 25") label(2 "25 to 34") label(3 "35 to 44") label(4 "45 to 54") label(5 "55 plus")) ///
>   saving(dmobile_age, replace)
(file dmobile_age.gph saved)

. * even within age groups, this measure of long run geo mobility does not show a downtrend
.   
. restore

. 
. * Replicating Raven's analysis in the Quality of Employment module for 200x and later
. 
. replace jobsecok=. if inlist(jobsecok,8,9,0)==1
(30,424 real changes made, 30,424 to missing)

. 
. gen yearsjobrec=yearsjob

. recode yearsjobrec (0.25=1) (0.75=2) (1/2=3) (3/5=4) (6/10=5) (11/19=6) (20/67=7) (-1=.) (98/99=.)
(yearsjobrec: 37683 changes made)

. tab1 yearsjobrec

-> tabulation of yearsjobrec  

yearsjobrec |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        684       10.28       10.28
          2 |        773       11.62       21.90
          3 |      1,027       15.43       37.33
          4 |      1,400       21.04       58.37
          5 |      1,118       16.80       75.17
          6 |        950       14.28       89.45
          7 |        702       10.55      100.00
------------+-----------------------------------
      Total |      6,654      100.00

. 
. label variable yearsjobrec "Years on current job"

. label define yearsjoblbl 1 "Less than 6 mos" 2 "6 to 11.9 mos" 3 "1 or 2 years" 4 "3 to 5 years" 5 "6 to 10 years" 6 "11 to 19 years" 7 "20+ years"

. label values yearsjobrec yearsjoblbl

. 
. gen yearsjobrec2=yearsjob

. recode yearsjobrec2 (0.25/0.75=1) (1/2=2) (3/5=3) (6/10=4) (11/19=5) (20/67=6) (-1=.) (98/99=.)
(yearsjobrec2: 36794 changes made)

. tab1 yearsjobrec2

-> tabulation of yearsjobrec2  

yearsjobrec |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,457       21.90       21.90
          2 |      1,027       15.43       37.33
          3 |      1,400       21.04       58.37
          4 |      1,118       16.80       75.17
          5 |        950       14.28       89.45
          6 |        702       10.55      100.00
------------+-----------------------------------
      Total |      6,654      100.00

. 
. label variable yearsjobrec2 "Years on current job"

. label define yearsjoblbl2 1 "Less than 1 year" 2 "1 or 2 years" 3 "3 to 5 years" 4 "6 to 10 years" 5 "11 to 19 years" 6 "20+ years"

. label values yearsjobrec2 yearsjoblbl2

. 
. * Union status of r or spouse - this is a balloted question, so goes to random 2/3 of GSS respondents. 
. * Did not find any info about adjusting weights for balloting.
. gen union=.
(38,063 missing values generated)

. replace union=1 if union_==1
(3,696 real changes made)

. replace union=0 if union_ >=2 & union_ <=9
(22,808 real changes made)

. 
. gen unionfam=.
(38,063 missing values generated)

. replace unionfam=1 if union_==1 | union_==2
(4,910 real changes made)

. replace unionfam=0 if union_ >=3 & union_ <=9
(21,594 real changes made)

. summ union unionfam

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       union |     26,504    .1394506    .3464227          0          1
    unionfam |     26,504    .1852551    .3885117          0          1

. 
. gen dtrynewjb=.
(38,063 missing values generated)

. replace dtrynewjb=1 if trynewjb==1 | trynewjb==2 
(3,667 real changes made)

. replace dtrynewjb=0 if trynewjb==3
(5,681 real changes made)

. 
. gen dtrynewjb_very=.
(38,063 missing values generated)

. replace dtrynewjb_very=1 if trynewjb==1 
(1,655 real changes made)

. replace dtrynewjb_very=0 if trynewjb==2 | trynewjb==3
(7,693 real changes made)

. 
. replace satjob1=. if inlist(satjob1,8,9,0)==1
(31,408 real changes made, 31,408 to missing)

. 
. gen dsatjob=.
(38,063 missing values generated)

. replace dsatjob=1 if satjob1==1 | satjob1==2
(5,957 real changes made)

. replace dsatjob=0 if satjob1==3 | satjob1==4
(698 real changes made)

. 
. gen djobsecok=.
(38,063 missing values generated)

. replace djobsecok=1 if jobsecok==1 | jobsecok==2
(6,616 real changes made)

. replace djobsecok=0 if jobsecok==3 | jobsecok==4
(1,023 real changes made)

. 
. *bys year: summ yearsjobrec jobsecok djobfind dtrynewjb satjob1
. 
. save gss_jobtenure.dta, replace
file gss_jobtenure.dta saved

. 
. * limit to years where all five q of emp variables available
. keep if inlist(year,2002,2006,2010,2014,2018)==1
(29,487 observations deleted)

. 
. tab1 year

-> tabulation of year  

   Gss year |
   for this |
 respondent |      Freq.     Percent        Cum.
------------+-----------------------------------
       2002 |      1,767       20.60       20.60
       2006 |      2,774       32.35       52.95
       2010 |      1,185       13.82       66.77
       2014 |      1,496       17.44       84.21
       2018 |      1,354       15.79      100.00
------------+-----------------------------------
      Total |      8,576      100.00

. tab1 yearsjobrec 

-> tabulation of yearsjobrec  

       Years on |
    current job |      Freq.     Percent        Cum.
----------------+-----------------------------------
Less than 6 mos |        684       10.28       10.28
  6 to 11.9 mos |        773       11.62       21.90
   1 or 2 years |      1,027       15.43       37.33
   3 to 5 years |      1,400       21.04       58.37
  6 to 10 years |      1,118       16.80       75.17
 11 to 19 years |        950       14.28       89.45
      20+ years |        702       10.55      100.00
----------------+-----------------------------------
          Total |      6,654      100.00

. 
. tabulate djobfind wrkstat

           |        Labor force status
  djobfind | Working f  Working p  Temp not  |     Total
-----------+---------------------------------+----------
         0 |     1,390        216         45 |     1,651 
         1 |     2,027        376         64 |     2,467 
-----------+---------------------------------+----------
     Total |     3,417        592        109 |     4,118 

. 
. * Table 5 means
. 
. mean djobsec djobfind dsatjob dtrynewjb [pw=wtssall]

Mean estimation                   Number of obs   =      3,818

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   djobsecok |   .8787938   .0062165      .8666058    .8909817
    djobfind |   .6086662    .008997      .5910269    .6263056
     dsatjob |   .8994317   .0056692      .8883167    .9105468
   dtrynewjb |   .4021307   .0090928      .3843035    .4199579
--------------------------------------------------------------

. *table yearsjobrec [pw=wtssall], contents(mean djobsec mean djobfind mean dsatjob mean dtrynewjb n djobsec) 
. table yearsjobrec2 [pw=wtssall], contents(mean djobsec mean djobfind mean dsatjob mean dtrynewjb n djobsec) 

---------------------------------------------------------------------------------------
Years on current |
job              | mean(djob~k)  mean(djob~d)  mean(dsat~b)  mean(dtry~b)  N(djobsecok)
-----------------+---------------------------------------------------------------------
Less than 1 year |     .8205454       .683233      .8450564      .5633125      1,487.22
    1 or 2 years |     .8661498      .7096899      .8859842      .4927892      1,045.93
    3 to 5 years |     .8576698      .6169883      .8907139      .4434957      1,405.24
   6 to 10 years |      .882085      .5830918      .9166732      .3400551      1,118.22
  11 to 19 years |     .8976444      .5281368      .9376397      .2454807       955.767
       20+ years |     .8968661      .4512777      .9353007      .1531751      714.2796
---------------------------------------------------------------------------------------

. mean djobsec djobfind dsatjob dtrynewjb if age>=50 & age <=64 & sex==1 [pw=wtssall]

Mean estimation                   Number of obs   =        566

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
   djobsecok |   .8768127    .016873      .8436712    .9099541
    djobfind |   .5507238   .0238359      .5039061    .5975416
     dsatjob |   .9207344    .013631      .8939607    .9475081
   dtrynewjb |   .2897021   .0223059      .2458894    .3335147
--------------------------------------------------------------

. 
. * Unweighted
. summ djobsec djobfind dsatjob dtrynewjb 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   djobsecok |      6,608    .8613801    .3455756          0          1
    djobfind |      4,118    .5990772    .4901449          0          1
     dsatjob |      6,655    .8951165    .3064263          0          1
   dtrynewjb |      6,637    .3994275    .4898176          0          1

. table yearsjobrec, contents(mean djobsec mean djobfind mean dsatjob mean dtrynewjb n djobsec) 

--------------------------------------------------------------------------------------
Years on        |
current job     | mean(djob~k)  mean(djob~d)  mean(dsat~b)  mean(dtry~b)  N(djobsecok)
----------------+---------------------------------------------------------------------
Less than 6 mos |     .8041543      .6793893      .8504399      .5689149           674
  6 to 11.9 mos |     .8261438      .6774194      .8404669      .5445026           765
   1 or 2 years |     .8603737      .6982456      .8849903      .4887365         1,017
   3 to 5 years |     .8533429      .6158537      .8818052      .4458781         1,391
  6 to 10 years |     .8863841      .5804511      .9219731      .3384201         1,109
 11 to 19 years |     .8865324      .5211009      .9389474       .249208           943
      20+ years |     .9020173       .441247      .9398281      .1522989           694
--------------------------------------------------------------------------------------

. summ djobsec djobfind dsatjob dtrynewjb if age>=50 & age <=64 & sex==1 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   djobsecok |        930    .8677419    .3389534          0          1
    djobfind |        619    .5315024    .4994102          0          1
     dsatjob |        942    .9171975    .2757299          0          1
   dtrynewjb |        942    .2728238    .4456476          0          1

. 
. /***
> 
> * weights on tabulate? need alt method. can do table contents(freq) but no row share
> tabulate yearsjobrec jobsecok, row
> table yearsjobrec [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate yearsjobrec satjob1, row
> 
> tabulate yearsjobrec jobsecok if year==2002 | year==2006, row
> table yearsjobrec [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very)
> tabulate yearsjobrec satjob1 if year==2002 | year==2006, row
> 
> tabulate yearsjobrec jobsecok if year==2010 | year==2014, row
> table yearsjobrec [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very)
> tabulate yearsjobrec satjob1 if year==2010 | year==2014, row
> 
> * By age
> tabulate ageg jobsecok, row
> table ageg [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate ageg satjob1, row
> 
> * By education group
> tabulate edg jobsecok, row
> table edg [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate edg satjob1, row
> 
> * By sex
> tabulate sex jobsecok, row
> table sex [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate sex satjob1, row
> 
> * By own union status
> tabulate union jobsecok, row
> table union [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate union satjob1, row
> 
> * By own or spouse (family) union status
> tabulate unionfam jobsecok, row
> table unionfam [pw=wtssall], contents(mean djobfind mean djobfind_very mean dtrynewjb mean dtrynewjb_very) 
> tabulate unionfam satjob1, row
> 
> ***/
. 
. 
. /*
> * Repeat limiting to those age 25 and up
> preserve
> drop if age < 25
> tabulate yearsjobrec jobsecok, row
> table yearsjobrec [pw=wtssall], contents(mean djobfind mean dtrynewjb) 
> tabulate yearsjobrec satjob1, row
> */
. 
. restore
nothing to restore
r(622);

end of do-file

r(622);

. graph use djoblose_age.gph

. log close
      name:  <unnamed>
       log:  C:\Users\irakw01\Wozniak PC porting Dropbox\Abigail Wozniak\Job tenure\GSS job tenure\read_gss_jobtenure.log
  log type:  text
 closed on:   9 Jan 2020, 14:26:00
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
