--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\IRAKW01\Wozniak PC porting Dropbox\Abigail Wozniak (abigailwozniak)\Abigail Woznia
> kâ€™s files\Home\Job tenure\NLS and NLSY data\NLSY97\make_tenure_whyleft_97.log
  log type:  text
 opened on:  22 Sep 2021, 14:05:52

. 
. /*** This is an expanded version of the data set from migration decline project. Makedata files for it
>  can be found there. ***/
. 
. use nlsy97_1997to2011.dta

. 
. *** Harmonize jobid coding across years
. summ job1id*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  job1id1997 |      8,984    2465.568    4227.461         -4       9707
  job1id1998 |      8,984    4809.006    4896.685         -5       9809
  job1id1999 |      8,984    92701.17    98257.26         -5     199908
  job1id2000 |      8,984    132065.5    94040.59         -5     200009
  job1id2001 |      8,984    141596.9    90550.27         -5     200107
-------------+---------------------------------------------------------
  job1id2002 |      8,984    148106.3    87460.05         -5     200209
  job1id2003 |      8,984    148431.8    87419.23         -5     200309
  job1id2004 |      8,984    146836.7    88431.64         -5     200407
  job1id2005 |      8,984    145483.6    89230.28         -5     200509
  job1id2006 |      8,984    152216.2     85570.2         -5     200607
-------------+---------------------------------------------------------
  job1id2007 |      8,984      149531    87234.25         -5     200708
  job1id2008 |      8,984    151051.5    86427.54         -5     200808
  job1id2009 |      8,984    146773.6    88853.89         -5     200907
  job1id2010 |      8,984    142040.1    91223.27         -5     201007
  job1id2011 |      8,984    139556.6    92378.74         -5     201106

. qui replace job1id1997=job1id1997 + 190000 if job1id1997 > 0

. qui replace job1id1998=job1id1998 + 190000 if job1id1998 > 0

. summ job1id* 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  job1id1997 |      8,984    50811.52    86987.12         -4     199707
  job1id1998 |      8,984    98180.55    99887.96         -5     199809
  job1id1999 |      8,984    92701.17    98257.26         -5     199908
  job1id2000 |      8,984    132065.5    94040.59         -5     200009
  job1id2001 |      8,984    141596.9    90550.27         -5     200107
-------------+---------------------------------------------------------
  job1id2002 |      8,984    148106.3    87460.05         -5     200209
  job1id2003 |      8,984    148431.8    87419.23         -5     200309
  job1id2004 |      8,984    146836.7    88431.64         -5     200407
  job1id2005 |      8,984    145483.6    89230.28         -5     200509
  job1id2006 |      8,984    152216.2     85570.2         -5     200607
-------------+---------------------------------------------------------
  job1id2007 |      8,984      149531    87234.25         -5     200708
  job1id2008 |      8,984    151051.5    86427.54         -5     200808
  job1id2009 |      8,984    146773.6    88853.89         -5     200907
  job1id2010 |      8,984    142040.1    91223.27         -5     201007
  job1id2011 |      8,984    139556.6    92378.74         -5     201106

. 
. foreach x of numlist 1997/2011 {
  2.   replace intmonth`x'=(intmonth`x'==-5)
  3. } 
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)
(8,984 real changes made)

. egen count = rowtotal(intmonth1997 intmonth1998 intmonth1999 intmonth2000 intmonth2001 intmonth2002 in
> tmonth2003 intmonth2004 intmonth2005 intmonth2006 intmonth2007 intmonth2008 intmonth2009 intmonth2010 
> intmonth2011)

. gen continuous=1

. replace continuous=0 if count > 0
(3,800 real changes made)

. summ continuous

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  continuous |      8,984    .5770258    .4940589          0          1

. 
. * Variable for months of tenure on main job at previous survey round - Plus dummy for employment at ma
> in job 1 in previous survey
. 
. gen prevtenuremon1_1997=.
(8,984 missing values generated)

. 
. foreach x of numlist 1998/2011 {
  2.    local y = `x' - 1
  3.    gen prevtenuremon1_`x'= .
  4.    replace  prevtenuremon1_`x'= tenuremon1_`y'  
  5.    *replace  prevtenuremon1_`x'= tenuremon1_`y' if empstatus_prevweek_`y' > 6 
.    
.    gen prevempd1_`x' = .
  6.    replace prevempd1_`x'=0 if curemp01_`y'==0 | curemp01_`y'==-4
  7.    replace prevempd1_`x'=1 if curemp01_`y'==1
  8.    
.    }
(8,984 missing values generated)
(2,219 real changes made)
(8,984 missing values generated)
(7,782 real changes made)
(1,202 real changes made)
(8,984 missing values generated)
(4,360 real changes made)
(8,984 missing values generated)
(5,921 real changes made)
(2,465 real changes made)
(8,984 missing values generated)
(5,345 real changes made)
(8,984 missing values generated)
(4,846 real changes made)
(3,361 real changes made)
(8,984 missing values generated)
(6,305 real changes made)
(8,984 missing values generated)
(3,737 real changes made)
(4,343 real changes made)
(8,984 missing values generated)
(6,463 real changes made)
(8,984 missing values generated)
(3,244 real changes made)
(4,638 real changes made)
(8,984 missing values generated)
(6,572 real changes made)
(8,984 missing values generated)
(2,850 real changes made)
(5,046 real changes made)
(8,984 missing values generated)
(6,462 real changes made)
(8,984 missing values generated)
(2,505 real changes made)
(5,249 real changes made)
(8,984 missing values generated)
(6,387 real changes made)
(8,984 missing values generated)
(2,087 real changes made)
(5,415 real changes made)
(8,984 missing values generated)
(6,320 real changes made)
(8,984 missing values generated)
(1,840 real changes made)
(5,498 real changes made)
(8,984 missing values generated)
(6,620 real changes made)
(8,984 missing values generated)
(1,656 real changes made)
(5,903 real changes made)
(8,984 missing values generated)
(6,492 real changes made)
(8,984 missing values generated)
(1,529 real changes made)
(5,889 real changes made)
(8,984 missing values generated)
(6,534 real changes made)
(8,984 missing values generated)
(1,721 real changes made)
(5,768 real changes made)
(8,984 missing values generated)
(6,347 real changes made)
(8,984 missing values generated)
(1,889 real changes made)
(5,670 real changes made)
(8,984 missing values generated)
(6,129 real changes made)
(8,984 missing values generated)
(1,966 real changes made)
(5,513 real changes made)

.    
. summ prevtenuremon1* prevempd1_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
prevten~1997 |          0
prevten~1998 |      2,219    7.808796    11.95956    .230787    127.856
prevten~1999 |      4,360    7.613641    10.81693    .230787   143.0879
prevten~2000 |      5,345    8.028537     11.2666    .230787   156.7044
prevten~2001 |      6,305    9.039785    11.15811    .230787   148.8576
-------------+---------------------------------------------------------
prevten~2002 |      6,463    11.07181    12.50299    .230787   141.2416
prevten~2003 |      6,572    13.24223    14.39471    .230787   152.5502
prevten~2004 |      6,462    15.26444    16.48848    .230787   164.3203
prevten~2005 |      6,387    17.47018     18.2181    .230787   175.3981
prevten~2006 |      6,320    19.29741    20.31237    .230787   186.4759
-------------+---------------------------------------------------------
prevten~2007 |      6,620     21.4126    22.23682    .230787   199.3999
prevten~2008 |      6,492    23.79342    24.32492    .230787   209.7854
prevten~2009 |      6,534    27.43977    26.51541    .230787   221.5555
prevten~2010 |      6,347    31.87998      29.247    .230787   232.6333
prevten~2011 |      6,129    36.15731    32.39428    .230787   245.7881
-------------+---------------------------------------------------------
prevemp~1998 |      8,984    .1337934    .3404492          0          1
prevemp~1999 |      8,386    .2939423     .455593          0          1
prevemp~2000 |      8,207    .4095285    .4917767          0          1
prevemp~2001 |      8,080       .5375    .4986226          0          1
prevemp~2002 |      7,882    .5884293    .4921494          0          1
-------------+---------------------------------------------------------
prevemp~2003 |      7,896    .6390578    .4803042          0          1
prevemp~2004 |      7,754    .6769409    .4676752          0          1
prevemp~2005 |      7,502    .7218075    .4481386          0          1
prevemp~2006 |      7,338    .7492505    .4334741          0          1
prevemp~2007 |      7,559    .7809234     .413648          0          1
-------------+---------------------------------------------------------
prevemp~2008 |      7,418    .7938798    .4045451          0          1
prevemp~2009 |      7,489    .7701963    .4207346          0          1
prevemp~2010 |      7,559    .7500992     .432984          0          1
prevemp~2011 |      7,479    .7371306    .4402215          0          1

. 
. * Variable for main job is new employer
. 
. gen mainisnew1997=.
(8,984 missing values generated)

. gen tmain1997=0 if job1id1997 < 0
(2,286 missing values generated)

. replace tmain1997=1 if job1id1997 > 0
(2,286 real changes made)

. gen tmain22_1997=0

. 
. tab1 age1997

-> tabulation of age1997  

    age1997 |      Freq.     Percent        Cum.
------------+-----------------------------------
         12 |      1,149       12.79       12.79
         13 |      1,768       19.68       32.47
         14 |      1,860       20.70       53.17
         15 |      1,872       20.84       74.01
         16 |      1,714       19.08       93.09
         17 |        621        6.91      100.00
------------+-----------------------------------
      Total |      8,984      100.00

. 
. forvalues x = 1998/2011 {
  2. 
.          local y = `x' - 1
  3. 
.    gen mainisnew`x'=.   
  4.    
.    * gen mainisnew_old`x'=. 
.    * replace mainisnew_old`x'=0 if job1id`x' > 0
.    * replace mainisnew_old`x'=1 if job1id`x'==`x'01
.    * "Old" coding is incorrect for many Rs. See Employment: An Introduction in NLSY97 documentation ap
> pedix.
.    
.    * Mainisnew means job 1 this year is new to that position. 
.    * Can be a new job to the survey year (then jobid has current year as first four digits) or a prev 
> job that wasn't main job.
.    
.    gen job1id_yr=int(job1id`x'/100)
  5.    replace mainisnew`x'=1 if job1id_yr==`x'
  6.    replace mainisnew`x'=1 if (job1id_yr~=. & job1id_yr~=`x' & job1id`x' ~= job1id`y')
  7.    replace mainisnew`x'=0 if job1id`x' == job1id`y'
  8.    drop job1id_yr
  9.    
.    gen tmain`x' = tmain`y' if continuous==1 
 10.    replace tmain`x' = mainisnew`x' + tmain`y' if continuous==1 & mainisnew`x'~=.
 11.    
.    gen tmain22_`x' = tmain22_`y' if continuous==1 
 12.    replace tmain22_`x' = (mainisnew`x' + tmain22_`y') if continuous==1 & mainisnew`x'~=. & ((age199
> 7 + `x' - 1997) > 22)
 13.    replace tmain22_`x'=1 if job1id`x' > 0 & continuous==1 & ((age1997 + `x' - 1997) == 22)
 14.       
.    }
(8,984 missing values generated)
(3,904 real changes made)
(835 real changes made)
(4,245 real changes made)
(3,800 missing values generated)
(2,480 real changes made)
(3,800 missing values generated)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(4,099 real changes made)
(2,305 real changes made)
(2,580 real changes made)
(3,800 missing values generated)
(3,691 real changes made)
(3,800 missing values generated)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(4,693 real changes made)
(1,016 real changes made)
(3,275 real changes made)
(3,800 missing values generated)
(3,313 real changes made)
(3,800 missing values generated)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(4,085 real changes made)
(1,321 real changes made)
(3,578 real changes made)
(3,800 missing values generated)
(3,118 real changes made)
(3,800 missing values generated)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(3,805 real changes made)
(1,264 real changes made)
(3,915 real changes made)
(3,800 missing values generated)
(2,975 real changes made)
(3,800 missing values generated)
(0 real changes made)
(290 real changes made)
(8,984 missing values generated)
(3,432 real changes made)
(1,302 real changes made)
(4,250 real changes made)
(3,800 missing values generated)
(2,776 real changes made)
(3,800 missing values generated)
(135 real changes made)
(812 real changes made)
(8,984 missing values generated)
(3,254 real changes made)
(1,360 real changes made)
(4,370 real changes made)
(3,800 missing values generated)
(2,712 real changes made)
(3,800 missing values generated)
(556 real changes made)
(937 real changes made)
(8,984 missing values generated)
(2,998 real changes made)
(1,333 real changes made)
(4,653 real changes made)
(3,800 missing values generated)
(2,514 real changes made)
(3,800 missing values generated)
(987 real changes made)
(1,019 real changes made)
(8,984 missing values generated)
(2,920 real changes made)
(1,141 real changes made)
(4,923 real changes made)
(3,800 missing values generated)
(2,316 real changes made)
(3,800 missing values generated)
(1,384 real changes made)
(1,007 real changes made)
(8,984 missing values generated)
(2,591 real changes made)
(1,226 real changes made)
(5,167 real changes made)
(3,800 missing values generated)
(2,180 real changes made)
(3,800 missing values generated)
(1,856 real changes made)
(655 real changes made)
(8,984 missing values generated)
(2,308 real changes made)
(1,123 real changes made)
(5,553 real changes made)
(3,800 missing values generated)
(1,933 real changes made)
(3,800 missing values generated)
(1,933 real changes made)
(0 real changes made)
(8,984 missing values generated)
(1,716 real changes made)
(1,217 real changes made)
(6,051 real changes made)
(3,800 missing values generated)
(1,591 real changes made)
(3,800 missing values generated)
(1,591 real changes made)
(0 real changes made)
(8,984 missing values generated)
(1,812 real changes made)
(1,213 real changes made)
(5,959 real changes made)
(3,800 missing values generated)
(1,664 real changes made)
(3,800 missing values generated)
(1,664 real changes made)
(0 real changes made)
(8,984 missing values generated)
(1,608 real changes made)
(1,162 real changes made)
(6,214 real changes made)
(3,800 missing values generated)
(1,554 real changes made)
(3,800 missing values generated)
(1,554 real changes made)
(0 real changes made)

. 
. summ mainisnew* tmain*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mainisn~1997 |          0
mainisn~1998 |      8,984    .5274933    .4992713          0          1
mainisn~1999 |      8,984    .7128228    .4524702          0          1
mainisn~2000 |      8,984     .635463    .4813269          0          1
mainisn~2001 |      8,984    .6017364    .4895675          0          1
-------------+---------------------------------------------------------
mainisn~2002 |      8,984    .5642253    .4958856          0          1
mainisn~2003 |      8,984    .5269368    .4993017          0          1
mainisn~2004 |      8,984    .5135797    .4998434          0          1
mainisn~2005 |      8,984    .4820793    .4997066          0          1
mainisn~2006 |      8,984    .4520258    .4977209          0          1
-------------+---------------------------------------------------------
mainisn~2007 |      8,984    .4248664    .4943502          0          1
mainisn~2008 |      8,984    .3819012    .4858796          0          1
mainisn~2009 |      8,984    .3264693    .4689473          0          1
mainisn~2010 |      8,984    .3367097     .472611          0          1
mainisn~2011 |      8,984    .3083259    .4618277          0          1
-------------+---------------------------------------------------------
   tmain1997 |      8,984    .2544524    .4355772          0          1
tmain22_1997 |      8,984           0           0          0          0
   tmain1998 |      5,184     .710841    .7500146          0          2
tmain22_1998 |      5,184           0           0          0          0
   tmain1999 |      5,184     1.42284    1.070281          0          3
-------------+---------------------------------------------------------
tmain22_1999 |      5,184           0           0          0          0
   tmain2000 |      5,184    2.061921    1.229197          0          4
tmain22_2000 |      5,184           0           0          0          0
   tmain2001 |      5,184    2.663387    1.355533          0          5
tmain22_2001 |      5,184           0           0          0          0
-------------+---------------------------------------------------------
   tmain2002 |      5,184    3.237269    1.471457          0          6
tmain22_2002 |      5,184    .0559414    .2298306          0          1
   tmain2003 |      5,184    3.772762    1.584723          0          7
tmain22_2003 |      5,184    .2386188    .4803346          0          2
   tmain2004 |      5,184     4.29591    1.703923          0          8
-------------+---------------------------------------------------------
tmain22_2004 |      5,184    .5266204    .7207311          0          3
   tmain2005 |      5,184    4.780864    1.841651          0          9
tmain22_2005 |      5,184    .9135802    .9080092          0          4
   tmain2006 |      5,184    5.227623    1.963363          0         10
tmain22_2006 |      5,184    1.374807    1.005364          0          5
-------------+---------------------------------------------------------
   tmain2007 |      5,184    5.648148    2.088539          0         11
tmain22_2007 |      5,184    1.859182     1.06758          0          6
   tmain2008 |      5,184    6.021026     2.22507          0         12
tmain22_2008 |      5,184     2.23206    1.215679          0          7
   tmain2009 |      5,184    6.327932    2.340185          0         13
-------------+---------------------------------------------------------
tmain22_2009 |      5,184    2.538966    1.353291          0          8
   tmain2010 |      5,184     6.64892    2.482936          0         14
tmain22_2010 |      5,184    2.859954    1.517302          0          9
   tmain2011 |      5,184    6.948688    2.609306          0         15
tmain22_2011 |      5,184    3.159722    1.664844          0         10

. *drop mainisnew_old*
. 
. 
. *** Recode reason for leaving into invol, vol, and missing - any reason with word quit in title or oth
> er is vol
. *** Reasons 1 through 5 are the same as 1 through 5 in latter half of NLSY79 codes.
. 
. gen whyleft01_1997=.
(8,984 missing values generated)

. 
. forvalues x = 1998/2011 {
  2. 
.    local y = `x' - 1
  3.    
.    gen whyleft01_`x'=.
  4.    replace whyleft01_`x'=YEMP58400_01_`x' if YEMP58400_01_`x' > 0
  5.    replace whyleft01_`x'=YEMP58400_02_`x' if job2id`x'==job1id`y' & YEMP58400_02_`x' > 0
  6.    replace whyleft01_`x'=YEMP58400_03_`x' if job3id`x'==job1id`y' & YEMP58400_03_`x' > 0
  7.    replace whyleft01_`x'=YEMP58400_04_`x' if job4id`x'==job1id`y' & YEMP58400_04_`x' > 0
  8.    replace whyleft01_`x'=YEMP58400_05_`x' if job5id`x'==job1id`y' & YEMP58400_05_`x' > 0
  9. }   
(8,984 missing values generated)
(575 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(694 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(905 real changes made)
(850 real changes made)
(485 real changes made)
(152 real changes made)
(50 real changes made)
(8,984 missing values generated)
(1,074 real changes made)
(1,079 real changes made)
(475 real changes made)
(170 real changes made)
(33 real changes made)
(8,984 missing values generated)
(1,683 real changes made)
(1,103 real changes made)
(494 real changes made)
(141 real changes made)
(35 real changes made)
(8,984 missing values generated)
(1,460 real changes made)
(1,152 real changes made)
(462 real changes made)
(121 real changes made)
(24 real changes made)
(8,984 missing values generated)
(1,184 real changes made)
(1,184 real changes made)
(472 real changes made)
(123 real changes made)
(25 real changes made)
(8,984 missing values generated)
(1,036 real changes made)
(1,209 real changes made)
(375 real changes made)
(102 real changes made)
(17 real changes made)
(8,984 missing values generated)
(921 real changes made)
(1,124 real changes made)
(378 real changes made)
(95 real changes made)
(13 real changes made)
(8,984 missing values generated)
(800 real changes made)
(1,168 real changes made)
(335 real changes made)
(86 real changes made)
(16 real changes made)
(8,984 missing values generated)
(959 real changes made)
(1,090 real changes made)
(276 real changes made)
(55 real changes made)
(14 real changes made)
(8,984 missing values generated)
(885 real changes made)
(791 real changes made)
(181 real changes made)
(27 real changes made)
(7 real changes made)
(8,984 missing values generated)
(811 real changes made)
(820 real changes made)
(198 real changes made)
(46 real changes made)
(9 real changes made)
(8,984 missing values generated)
(625 real changes made)
(685 real changes made)
(140 real changes made)
(28 real changes made)
(5 real changes made)

. 
. foreach x of numlist 1997/2011 {
  2.    gen invol`x'=.
  3.    *tab1 whyleft01_`x'
.    replace invol`x'=1 if whyleft01_`x'>=0 & whyleft01_`x'< 6
  4.    replace invol`x'=0 if whyleft01_`x' >= 6 & whyleft01_`x'<= 17
  5.    *replace invol`x'=0 if whyleft01_`x' >= 6 & whyleft01_`x'< 1000 
.    
. }
(8,984 missing values generated)
(0 real changes made)
(0 real changes made)
(8,984 missing values generated)
(142 real changes made)
(433 real changes made)
(8,984 missing values generated)
(166 real changes made)
(528 real changes made)
(8,984 missing values generated)
(439 real changes made)
(1,885 real changes made)
(8,984 missing values generated)
(587 real changes made)
(2,105 real changes made)
(8,984 missing values generated)
(832 real changes made)
(2,336 real changes made)
(8,984 missing values generated)
(807 real changes made)
(2,161 real changes made)
(8,984 missing values generated)
(713 real changes made)
(2,058 real changes made)
(8,984 missing values generated)
(630 real changes made)
(1,589 real changes made)
(8,984 missing values generated)
(521 real changes made)
(1,517 real changes made)
(8,984 missing values generated)
(521 real changes made)
(1,382 real changes made)
(8,984 missing values generated)
(697 real changes made)
(1,286 real changes made)
(8,984 missing values generated)
(761 real changes made)
(858 real changes made)
(8,984 missing values generated)
(658 real changes made)
(957 real changes made)
(8,984 missing values generated)
(521 real changes made)
(734 real changes made)

. 
. tab1 invol*

-> tabulation of invol1997  
no observations

-> tabulation of invol1998  

  invol1998 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        433       75.30       75.30
          1 |        142       24.70      100.00
------------+-----------------------------------
      Total |        575      100.00

-> tabulation of invol1999  

  invol1999 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        528       76.08       76.08
          1 |        166       23.92      100.00
------------+-----------------------------------
      Total |        694      100.00

-> tabulation of invol2000  

  invol2000 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,885       81.11       81.11
          1 |        439       18.89      100.00
------------+-----------------------------------
      Total |      2,324      100.00

-> tabulation of invol2001  

  invol2001 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,105       78.19       78.19
          1 |        587       21.81      100.00
------------+-----------------------------------
      Total |      2,692      100.00

-> tabulation of invol2002  

  invol2002 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,336       73.74       73.74
          1 |        832       26.26      100.00
------------+-----------------------------------
      Total |      3,168      100.00

-> tabulation of invol2003  

  invol2003 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,161       72.81       72.81
          1 |        807       27.19      100.00
------------+-----------------------------------
      Total |      2,968      100.00

-> tabulation of invol2004  

  invol2004 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,058       74.27       74.27
          1 |        713       25.73      100.00
------------+-----------------------------------
      Total |      2,771      100.00

-> tabulation of invol2005  

  invol2005 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,589       71.61       71.61
          1 |        630       28.39      100.00
------------+-----------------------------------
      Total |      2,219      100.00

-> tabulation of invol2006  

  invol2006 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,517       74.44       74.44
          1 |        521       25.56      100.00
------------+-----------------------------------
      Total |      2,038      100.00

-> tabulation of invol2007  

  invol2007 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,382       72.62       72.62
          1 |        521       27.38      100.00
------------+-----------------------------------
      Total |      1,903      100.00

-> tabulation of invol2008  

  invol2008 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,286       64.85       64.85
          1 |        697       35.15      100.00
------------+-----------------------------------
      Total |      1,983      100.00

-> tabulation of invol2009  

  invol2009 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        858       53.00       53.00
          1 |        761       47.00      100.00
------------+-----------------------------------
      Total |      1,619      100.00

-> tabulation of invol2010  

  invol2010 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        957       59.26       59.26
          1 |        658       40.74      100.00
------------+-----------------------------------
      Total |      1,615      100.00

-> tabulation of invol2011  

  invol2011 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        734       58.49       58.49
          1 |        521       41.51      100.00
------------+-----------------------------------
      Total |      1,255      100.00

. summ invol* tenuremon*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   invol1997 |          0
   invol1998 |        575    .2469565    .4316167          0          1
   invol1999 |        694    .2391931    .4268985          0          1
   invol2000 |      2,324    .1888985    .3915122          0          1
   invol2001 |      2,692    .2180535    .4130006          0          1
-------------+---------------------------------------------------------
   invol2002 |      3,168    .2626263    .4401305          0          1
   invol2003 |      2,968    .2719003    .4450137          0          1
   invol2004 |      2,771    .2573078    .4372293          0          1
   invol2005 |      2,219    .2839117    .4509961          0          1
   invol2006 |      2,038    .2556428     .436329          0          1
-------------+---------------------------------------------------------
   invol2007 |      1,903    .2737782    .4460137          0          1
   invol2008 |      1,983    .3514876    .4775553          0          1
   invol2009 |      1,619    .4700432     .499256          0          1
   invol2010 |      1,615    .4074303    .4915083          0          1
   invol2011 |      1,255    .4151394    .4929425          0          1
-------------+---------------------------------------------------------
tenurem~1997 |      2,219    7.808796    11.95956    .230787    127.856
tenurem~1998 |      4,360    7.613641    10.81693    .230787   143.0879
tenurem~1999 |      5,345    8.028537     11.2666    .230787   156.7044
tenurem~2000 |      6,305    9.039785    11.15811    .230787   148.8576
tenurem~2001 |      6,463    11.07181    12.50299    .230787   141.2416
-------------+---------------------------------------------------------
tenurem~2002 |      6,572    13.24223    14.39471    .230787   152.5502
tenurem~2003 |      6,462    15.26444    16.48848    .230787   164.3203
tenurem~2004 |      6,387    17.47018     18.2181    .230787   175.3981
tenurem~2005 |      6,320    19.29741    20.31237    .230787   186.4759
tenurem~2006 |      6,620     21.4126    22.23682    .230787   199.3999
-------------+---------------------------------------------------------
tenurem~2007 |      6,492    23.79342    24.32492    .230787   209.7854
tenurem~2008 |      6,534    27.43977    26.51541    .230787   221.5555
tenurem~2009 |      6,347    31.87998      29.247    .230787   232.6333
tenurem~2010 |      6,129    36.15731    32.39428    .230787   245.7881
tenurem~2011 |      6,051    38.83652     35.2887    .230787   256.8659

. summ mainisnew* whyleft01* 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mainisn~1997 |          0
mainisn~1998 |      8,984    .5274933    .4992713          0          1
mainisn~1999 |      8,984    .7128228    .4524702          0          1
mainisn~2000 |      8,984     .635463    .4813269          0          1
mainisn~2001 |      8,984    .6017364    .4895675          0          1
-------------+---------------------------------------------------------
mainisn~2002 |      8,984    .5642253    .4958856          0          1
mainisn~2003 |      8,984    .5269368    .4993017          0          1
mainisn~2004 |      8,984    .5135797    .4998434          0          1
mainisn~2005 |      8,984    .4820793    .4997066          0          1
mainisn~2006 |      8,984    .4520258    .4977209          0          1
-------------+---------------------------------------------------------
mainisn~2007 |      8,984    .4248664    .4943502          0          1
mainisn~2008 |      8,984    .3819012    .4858796          0          1
mainisn~2009 |      8,984    .3264693    .4689473          0          1
mainisn~2010 |      8,984    .3367097     .472611          0          1
mainisn~2011 |      8,984    .3083259    .4618277          0          1
-------------+---------------------------------------------------------
whyleft~1997 |          0
whyleft~1998 |        575    7.989565    3.146797          1         11
whyleft~1999 |        694    8.414986    3.798398          1         17
whyleft~2000 |      2,328    9.590636    41.16099          1        999
whyleft~2001 |      2,693    8.108058    19.37862          1        999
-------------+---------------------------------------------------------
whyleft~2002 |      3,173     9.46486    39.50402          1        999
whyleft~2003 |      2,979     11.4995    60.25116          1        999
whyleft~2004 |      2,780    11.03885    56.44326          1        999
whyleft~2005 |      2,566    11.77046    51.94106          1        999
whyleft~2006 |      2,375    15.12421    75.98284          1        999
-------------+---------------------------------------------------------
whyleft~2007 |      2,274    12.91029    58.90003          1        999
whyleft~2008 |      2,247    11.42635    55.50906          1        999
whyleft~2009 |      1,808    8.569137    33.49704          1        999
whyleft~2010 |      1,809     10.1089    46.91108          1        999
whyleft~2011 |      1,430    8.644755    26.86148          1        999

. 
. forvalues x = 1998/2011 {
  2.    table mainisnew`x' invol`x', contents(freq) missing
  3. }

----------------------
mainisnew | invol1998 
1998      |    0     1
----------+-----------
        0 |   79    30
        1 |  354   112
----------------------

----------------------
mainisnew | invol1999 
1999      |    0     1
----------+-----------
        1 |  528   166
----------------------

------------------------
mainisnew |  invol2000  
2000      |     0      1
----------+-------------
        0 |   252     81
        1 | 1,633    358
------------------------

------------------------
mainisnew |  invol2001  
2001      |     0      1
----------+-------------
        0 |   395    112
        1 | 1,710    475
------------------------

------------------------
mainisnew |  invol2002  
2002      |     0      1
----------+-------------
        0 |   394    165
        1 | 1,942    667
------------------------

------------------------
mainisnew |  invol2003  
2003      |     0      1
----------+-------------
        0 |   379    176
        1 | 1,782    631
------------------------

------------------------
mainisnew |  invol2004  
2004      |     0      1
----------+-------------
        0 |   327    130
        1 | 1,731    583
------------------------

------------------------
mainisnew |  invol2005  
2005      |     0      1
----------+-------------
        0 |   249    116
        1 | 1,340    514
------------------------

------------------------
mainisnew |  invol2006  
2006      |     0      1
----------+-------------
        0 |   223     95
        1 | 1,294    426
------------------------

------------------------
mainisnew |  invol2007  
2007      |     0      1
----------+-------------
        0 |   221    111
        1 | 1,161    410
------------------------

------------------------
mainisnew |  invol2008  
2008      |     0      1
----------+-------------
        0 |   232    184
        1 | 1,054    513
------------------------

----------------------
mainisnew | invol2009 
2009      |    0     1
----------+-----------
        0 |  181   294
        1 |  677   467
----------------------

----------------------
mainisnew | invol2010 
2010      |    0     1
----------+-----------
        0 |  205   228
        1 |  752   430
----------------------

----------------------
mainisnew | invol2011 
2011      |    0     1
----------+-----------
        0 |  164   183
        1 |  570   338
----------------------

. 
. 
. sort pubid

. save nlsy97_tenure_plus_whyleft.dta, replace
file nlsy97_tenure_plus_whyleft.dta saved

. 
. keep tenuremon1* prevtenuremon* edgrp4* black hisp female age1997 edgrp4* curemp01_* curemp02_* invol*
>  mainisnew* whyleft01_* enrollstat* job1se_* prevempd1_* tmain* continuous pubid custwt

. reshape long tenuremon1_ prevtenuremon1_ edgrp4_ curemp01_ curemp02_ invol mainisnew whyleft01_ enroll
> stat job1se_ prevempd1_ tmain tmain22_, i(pubid) j(year)
(note: j = 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011)
(note: job1se_1997 not found)
(note: prevempd1_1997 not found)
(note: job1se_1998 not found)
(note: job1se_1999 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     8984   ->  134760
Number of variables                 198   ->      21
j variable (15 values)                    ->   year
xij variables:
tenuremon1_1997 tenuremon1_1998 ... tenuremon1_2011->tenuremon1_
prevtenuremon1_1997 prevtenuremon1_1998 ... prevtenuremon1_2011->prevtenuremon1_
edgrp4_1997 edgrp4_1998 ... edgrp4_2011   ->   edgrp4_
curemp01_1997 curemp01_1998 ... curemp01_2011->curemp01_
curemp02_1997 curemp02_1998 ... curemp02_2011->curemp02_
      invol1997 invol1998 ... invol2011   ->   invol
mainisnew1997 mainisnew1998 ... mainisnew2011->mainisnew
whyleft01_1997 whyleft01_1998 ... whyleft01_2011->whyleft01_
enrollstat1997 enrollstat1998 ... enrollstat2011->enrollstat
job1se_1997 job1se_1998 ... job1se_2011   ->   job1se_
prevempd1_1997 prevempd1_1998 ... prevempd1_2011->prevempd1_
      tmain1997 tmain1998 ... tmain2011   ->   tmain
tmain22_1997 tmain22_1998 ... tmain22_2011->   tmain22_
-----------------------------------------------------------------------------

. 
. 
. drop if year > 2011 | year < 1997
(0 observations deleted)

. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       pubid |    134,760    4504.302    2603.001          1       9022
        year |    134,760        2004     4.32051       1997       2011
  enrollstat |    134,760     4.16631     4.57717         -5         11
     job1se_ |    107,808    -1.76089    2.212496         -5          1
   curemp01_ |    134,760   -.8564856    2.450986         -5          1
-------------+---------------------------------------------------------
   curemp02_ |    134,760   -2.840695    2.067218         -5          1
      custwt |    134,760    215699.6    93096.12      76071    1576182
       black |    134,760    .2599065    .4385847          0          1
        hisp |    134,760    .2115984    .4084431          0          1
      female |    134,760    .4880899      .49986          0          1
-------------+---------------------------------------------------------
     age1997 |    134,760    14.34472    1.477553         12         17
     edgrp4_ |    134,543    2.047264    1.046156          1          4
 tenuremon1_ |     88,606    20.03992    23.96377    .230787   256.8659
  continuous |    134,760    .5770258    .4940332          0          1
prevtenur~1_ |     82,555    18.66219    22.30017    .230787   245.7881
-------------+---------------------------------------------------------
  prevempd1_ |    109,533    .6021929    .4894474          0          1
   mainisnew |    125,776    .4853311    .4997868          0          1
       tmain |     81,560    3.826925    2.825241          0         15
    tmain22_ |     81,560     1.00168    1.436897          0         10
  whyleft01_ |     29,731    10.65793    49.26821          1        999
-------------+---------------------------------------------------------
       invol |     27,824    .2873419    .4525305          0          1

. 
. gen age = age1997 + (year - 1997)

. gen age2 = age^2 

. bys year: summ age

--------------------------------------------------------------------------------------------------------
-> year = 1997

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    14.34472     1.47763         12         17

--------------------------------------------------------------------------------------------------------
-> year = 1998

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    15.34472     1.47763         13         18

--------------------------------------------------------------------------------------------------------
-> year = 1999

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    16.34472     1.47763         14         19

--------------------------------------------------------------------------------------------------------
-> year = 2000

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    17.34472     1.47763         15         20

--------------------------------------------------------------------------------------------------------
-> year = 2001

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    18.34472     1.47763         16         21

--------------------------------------------------------------------------------------------------------
-> year = 2002

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    19.34472     1.47763         17         22

--------------------------------------------------------------------------------------------------------
-> year = 2003

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    20.34472     1.47763         18         23

--------------------------------------------------------------------------------------------------------
-> year = 2004

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    21.34472     1.47763         19         24

--------------------------------------------------------------------------------------------------------
-> year = 2005

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    22.34472     1.47763         20         25

--------------------------------------------------------------------------------------------------------
-> year = 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    23.34472     1.47763         21         26

--------------------------------------------------------------------------------------------------------
-> year = 2007

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    24.34472     1.47763         22         27

--------------------------------------------------------------------------------------------------------
-> year = 2008

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    25.34472     1.47763         23         28

--------------------------------------------------------------------------------------------------------
-> year = 2009

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    26.34472     1.47763         24         29

--------------------------------------------------------------------------------------------------------
-> year = 2010

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    27.34472     1.47763         25         30

--------------------------------------------------------------------------------------------------------
-> year = 2011

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,984    28.34472     1.47763         26         31


. 
. char edgrp4_[omit] 2

. xi, prefix(_Y) i.year
i.year            _Yyear_1997-2011    (naturally coded; _Yyear_1997 omitted)

. xi, prefix(_E) i.edgrp4_
i.edgrp4_         _Eedgrp4__1-4       (naturally coded; _Eedgrp4__2 omitted)

. 
. gen ptencat=.
(134,760 missing values generated)

. replace ptencat=1 if prevtenuremon1_ > 0 & prevtenuremon1_ < 12
(44,124 real changes made)

. replace ptencat=2 if prevtenuremon1_ >= 12 & prevtenuremon1_ < 36
(25,110 real changes made)

. replace ptencat=3 if prevtenuremon1_ >= 36 & prevtenuremon1_ < 60
(8,235 real changes made)

. replace ptencat=4 if prevtenuremon1_ >= 60 & prevtenuremon1_ < 120
(4,717 real changes made)

. replace ptencat=5 if prevtenuremon1_ >= 120 & prevtenuremon1_~=.
(369 real changes made)

. 
. gen tencat=.
(134,760 missing values generated)

. replace tencat=1 if tenuremon1_ > 0 & tenuremon1_ < 12
(45,858 real changes made)

. replace tencat=2 if tenuremon1_ >= 12 & tenuremon1_ < 36
(26,768 real changes made)

. replace tencat=3 if tenuremon1_ >= 36 & tenuremon1_ < 60
(9,432 real changes made)

. replace tencat=4 if tenuremon1_ >= 60 & tenuremon1_ < 120
(5,962 real changes made)

. replace tencat=5 if tenuremon1_ >= 120 & tenuremon1_~=.
(586 real changes made)

. 
. /**
> 
> * Previous coding breaking up less than one year of tenure.
> gen ptencat=.
> replace ptencat=1 if prevtenuremon1_ > 0 & prevtenuremon1_ < 3
> replace ptencat=2 if prevtenuremon1_ >= 3 & prevtenuremon1_ < 12
> replace ptencat=3 if prevtenuremon1_ >= 12 & prevtenuremon1_ < 36
> replace ptencat=4 if prevtenuremon1_ >= 36 & prevtenuremon1_ < 60
> replace ptencat=5 if prevtenuremon1_ >= 60 & prevtenuremon1_ < 120
> replace ptencat=6 if prevtenuremon1_ >= 120 & prevtenuremon1_~=.
> 
> gen tencat=.
> replace tencat=1 if tenuremon1_ > 0 & tenuremon1_ < 3
> replace tencat=2 if tenuremon1_ >= 3 & tenuremon1_ < 12
> replace tencat=3 if tenuremon1_ >= 12 & tenuremon1_ < 36
> replace tencat=4 if tenuremon1_ >= 36 & tenuremon1_ < 60
> replace tencat=5 if tenuremon1_ >= 60 & tenuremon1_ < 120
> replace tencat=6 if tenuremon1_ >= 120 & tenuremon1_~=.
> 
> label define ptencatlbl 1 "Less than 1Q" 2 "1Q to less than 1Y" 3 "1Y to less than 3Y" 4 "3Y to less t
> han 5Y" 5 "5Y to less than 10Y" 6 "10Y and up"
> 
> **/
. 
. label define ptencatlbl 1 "Less than 1Y" 2 "1Y to less than 3Y" 3 "3Y to less than 5Y" 4 "5Y to less t
> han 10Y" 5 "10Y and up"

. label values ptencat ptencatlbl

. label values tencat ptencatlbl

. 
. tab1 ptencat

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     44,124       53.45       53.45
 1Y to less than 3Y |     25,110       30.42       83.86
 3Y to less than 5Y |      8,235        9.98       93.84
5Y to less than 10Y |      4,717        5.71       99.55
         10Y and up |        369        0.45      100.00
--------------------+-----------------------------------
              Total |     82,555      100.00

. bys year: tab1 ptencat

--------------------------------------------------------------------------------------------------------
-> year = 1997

-> tabulation of ptencat  
no observations

--------------------------------------------------------------------------------------------------------
-> year = 1998

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,809       81.52       81.52
 1Y to less than 3Y |        339       15.28       96.80
 3Y to less than 5Y |         49        2.21       99.01
5Y to less than 10Y |         21        0.95       99.95
         10Y and up |          1        0.05      100.00
--------------------+-----------------------------------
              Total |      2,219      100.00

--------------------------------------------------------------------------------------------------------
-> year = 1999

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,499       80.25       80.25
 1Y to less than 3Y |        750       17.20       97.45
 3Y to less than 5Y |         84        1.93       99.38
5Y to less than 10Y |         24        0.55       99.93
         10Y and up |          3        0.07      100.00
--------------------+-----------------------------------
              Total |      4,360      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2000

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,222       78.99       78.99
 1Y to less than 3Y |        988       18.48       97.47
 3Y to less than 5Y |         92        1.72       99.20
5Y to less than 10Y |         41        0.77       99.96
         10Y and up |          2        0.04      100.00
--------------------+-----------------------------------
              Total |      5,345      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2001

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,679       74.21       74.21
 1Y to less than 3Y |      1,421       22.54       96.75
 3Y to less than 5Y |        163        2.59       99.33
5Y to less than 10Y |         37        0.59       99.92
         10Y and up |          5        0.08      100.00
--------------------+-----------------------------------
              Total |      6,305      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2002

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,327       66.95       66.95
 1Y to less than 3Y |      1,847       28.58       95.53
 3Y to less than 5Y |        243        3.76       99.29
5Y to less than 10Y |         41        0.63       99.92
         10Y and up |          5        0.08      100.00
--------------------+-----------------------------------
              Total |      6,463      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2003

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,992       60.74       60.74
 1Y to less than 3Y |      2,090       31.80       92.54
 3Y to less than 5Y |        407        6.19       98.74
5Y to less than 10Y |         76        1.16       99.89
         10Y and up |          7        0.11      100.00
--------------------+-----------------------------------
              Total |      6,572      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2004

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,621       56.04       56.04
 1Y to less than 3Y |      2,100       32.50       88.53
 3Y to less than 5Y |        607        9.39       97.93
5Y to less than 10Y |        127        1.97       99.89
         10Y and up |          7        0.11      100.00
--------------------+-----------------------------------
              Total |      6,462      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2005

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,296       51.60       51.60
 1Y to less than 3Y |      2,171       33.99       85.60
 3Y to less than 5Y |        688       10.77       96.37
5Y to less than 10Y |        223        3.49       99.86
         10Y and up |          9        0.14      100.00
--------------------+-----------------------------------
              Total |      6,387      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2006

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,079       48.72       48.72
 1Y to less than 3Y |      2,152       34.05       82.77
 3Y to less than 5Y |        729       11.53       94.30
5Y to less than 10Y |        346        5.47       99.78
         10Y and up |         14        0.22      100.00
--------------------+-----------------------------------
              Total |      6,320      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2007

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,997       45.27       45.27
 1Y to less than 3Y |      2,323       35.09       80.36
 3Y to less than 5Y |        813       12.28       92.64
5Y to less than 10Y |        467        7.05       99.70
         10Y and up |         20        0.30      100.00
--------------------+-----------------------------------
              Total |      6,620      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2008

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,700       41.59       41.59
 1Y to less than 3Y |      2,288       35.24       76.83
 3Y to less than 5Y |        893       13.76       90.59
5Y to less than 10Y |        584        9.00       99.58
         10Y and up |         27        0.42      100.00
--------------------+-----------------------------------
              Total |      6,492      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2009

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,274       34.80       34.80
 1Y to less than 3Y |      2,483       38.00       72.80
 3Y to less than 5Y |        995       15.23       88.03
5Y to less than 10Y |        742       11.36       99.39
         10Y and up |         40        0.61      100.00
--------------------+-----------------------------------
              Total |      6,534      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2010

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,902       29.97       29.97
 1Y to less than 3Y |      2,279       35.91       65.87
 3Y to less than 5Y |      1,163       18.32       84.20
5Y to less than 10Y |        918       14.46       98.66
         10Y and up |         85        1.34      100.00
--------------------+-----------------------------------
              Total |      6,347      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2011

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,727       28.18       28.18
 1Y to less than 3Y |      1,879       30.66       58.84
 3Y to less than 5Y |      1,309       21.36       80.19
5Y to less than 10Y |      1,070       17.46       97.65
         10Y and up |        144        2.35      100.00
--------------------+-----------------------------------
              Total |      6,129      100.00

. 
. * Among those with obs on invol, what is share invol across prev tenure categories?
. tabulate ptencat, summarize(invol)

            |          Summary of invol
    ptencat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Less than |   .28974457   .45365816      15,738
  1Y to les |   .25943595    .4383559       7,127
  3Y to les |    .2741433   .44622058       1,605
  5Y to les |    .2952381   .45651217         630
  10Y and u |   .32258065   .47519096          31
------------+------------------------------------
      Total |   .28033107   .44916989      25,131

. tabulate ptencat if age >=22, summarize(invol)

            |          Summary of invol
    ptencat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Less than |   .34651019   .47589479       6,476
  1Y to les |    .3090036   .46213813       4,165
  3Y to les |   .30542265   .46076996       1,254
  5Y to les |   .31907308   .46653341         561
  10Y and u |   .33333333   .48038446          27
------------+------------------------------------
      Total |   .32860691   .46972554      12,483

. 
. gen empd=.
(134,760 missing values generated)

. replace empd=1 if curemp01_==1
(71,543 real changes made)

. replace empd=0 if curemp01_==0 | curemp01_==-4
(45,413 real changes made)

. 
. gen empd2=.
(134,760 missing values generated)

. replace empd2=1 if curemp02_==1
(8,618 real changes made)

. replace empd2=0 if curemp02_==0 | curemp02_==-4
(108,335 real changes made)

. summ empd2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       empd2 |    116,953    .0736877    .2612631          0          1

. 
. * Drop multiple job holders
. drop if empd2==1 & empd==1
(8,523 observations deleted)

. 
. 
. bys year: tab1 age

--------------------------------------------------------------------------------------------------------
-> year = 1997

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         12 |      1,149       12.95       12.95
         13 |      1,768       19.92       32.87
         14 |      1,851       20.86       53.72
         15 |      1,849       20.83       74.56
         16 |      1,658       18.68       93.24
         17 |        600        6.76      100.00
------------+-----------------------------------
      Total |      8,875      100.00

--------------------------------------------------------------------------------------------------------
-> year = 1998

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         13 |      1,144       13.00       13.00
         14 |      1,760       20.00       32.99
         15 |      1,831       20.80       53.79
         16 |      1,821       20.69       74.48
         17 |      1,659       18.85       93.33
         18 |        587        6.67      100.00
------------+-----------------------------------
      Total |      8,802      100.00

--------------------------------------------------------------------------------------------------------
-> year = 1999

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         14 |      1,143       13.12       13.12
         15 |      1,747       20.05       33.17
         16 |      1,805       20.71       53.88
         17 |      1,793       20.58       74.45
         18 |      1,638       18.80       93.25
         19 |        588        6.75      100.00
------------+-----------------------------------
      Total |      8,714      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2000

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         15 |      1,132       13.36       13.36
         16 |      1,719       20.29       33.65
         17 |      1,752       20.68       54.33
         18 |      1,746       20.61       74.94
         19 |      1,559       18.40       93.34
         20 |        564        6.66      100.00
------------+-----------------------------------
      Total |      8,472      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2001

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         16 |      1,127       13.37       13.37
         17 |      1,686       20.00       33.38
         18 |      1,730       20.53       53.90
         19 |      1,746       20.72       74.62
         20 |      1,577       18.71       93.33
         21 |        562        6.67      100.00
------------+-----------------------------------
      Total |      8,428      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2002

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         17 |      1,076       12.90       12.90
         18 |      1,664       19.96       32.86
         19 |      1,727       20.71       53.57
         20 |      1,735       20.81       74.38
         21 |      1,573       18.87       93.25
         22 |        563        6.75      100.00
------------+-----------------------------------
      Total |      8,338      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2003

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |      1,079       13.01       13.01
         19 |      1,651       19.90       32.91
         20 |      1,715       20.67       53.58
         21 |      1,703       20.53       74.11
         22 |      1,581       19.06       93.17
         23 |        567        6.83      100.00
------------+-----------------------------------
      Total |      8,296      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2004

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         19 |      1,069       12.80       12.80
         20 |      1,661       19.88       32.68
         21 |      1,735       20.77       53.45
         22 |      1,720       20.59       74.04
         23 |      1,591       19.04       93.08
         24 |        578        6.92      100.00
------------+-----------------------------------
      Total |      8,354      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2005

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         20 |      1,055       12.65       12.65
         21 |      1,633       19.58       32.23
         22 |      1,745       20.93       53.16
         23 |      1,728       20.72       73.88
         24 |      1,596       19.14       93.02
         25 |        582        6.98      100.00
------------+-----------------------------------
      Total |      8,339      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2006

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         21 |      1,028       12.68       12.68
         22 |      1,589       19.60       32.28
         23 |      1,684       20.77       53.06
         24 |      1,681       20.74       73.80
         25 |      1,549       19.11       92.91
         26 |        575        7.09      100.00
------------+-----------------------------------
      Total |      8,106      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2007

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         22 |      1,035       12.63       12.63
         23 |      1,612       19.67       32.29
         24 |      1,692       20.64       52.93
         25 |      1,703       20.78       73.71
         26 |      1,577       19.24       92.95
         27 |        578        7.05      100.00
------------+-----------------------------------
      Total |      8,197      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2008

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         23 |      1,046       12.64       12.64
         24 |      1,627       19.66       32.31
         25 |      1,727       20.87       53.18
         26 |      1,717       20.75       73.93
         27 |      1,580       19.10       93.03
         28 |        577        6.97      100.00
------------+-----------------------------------
      Total |      8,274      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2009

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         24 |      1,059       12.74       12.74
         25 |      1,633       19.65       32.39
         26 |      1,726       20.77       53.16
         27 |      1,717       20.66       73.82
         28 |      1,592       19.16       92.97
         29 |        584        7.03      100.00
------------+-----------------------------------
      Total |      8,311      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2010

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         25 |      1,065       12.73       12.73
         26 |      1,657       19.80       32.52
         27 |      1,730       20.67       53.20
         28 |      1,731       20.68       73.88
         29 |      1,599       19.11       92.99
         30 |        587        7.01      100.00
------------+-----------------------------------
      Total |      8,369      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2011

-> tabulation of age  

        age |      Freq.     Percent        Cum.
------------+-----------------------------------
         26 |      1,069       12.78       12.78
         27 |      1,650       19.73       32.52
         28 |      1,723       20.61       53.12
         29 |      1,740       20.81       73.93
         30 |      1,594       19.06       92.99
         31 |        586        7.01      100.00
------------+-----------------------------------
      Total |      8,362      100.00

. 
. *** Age restriction. Age tops out at 31. Drop if currently enrolled. Drop if self employed. Drop if no
> t employed on main job at previous interview, when tenure measured.
. 
. drop if age < 22
(65,395 observations deleted)

. drop if ptencat==.
(18,515 observations deleted)

. drop if prevempd1_ ~= 1
(7,120 observations deleted)

. 
. 
. tab1 year ptencat

-> tabulation of year  

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2002 |        287        0.82        0.82
       2003 |      1,167        3.31        4.13
       2004 |      2,091        5.94       10.07
       2005 |      3,182        9.04       19.11
       2006 |      3,979       11.30       30.41
       2007 |      4,971       14.12       44.53
       2008 |      5,018       14.25       58.78
       2009 |      4,928       14.00       72.78
       2010 |      4,865       13.82       86.60
       2011 |      4,719       13.40      100.00
------------+-----------------------------------
      Total |     35,207      100.00

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     13,020       36.98       36.98
 1Y to less than 3Y |     12,674       36.00       72.98
 3Y to less than 5Y |      5,643       16.03       89.01
5Y to less than 10Y |      3,606       10.24       99.25
         10Y and up |        264        0.75      100.00
--------------------+-----------------------------------
              Total |     35,207      100.00

. bys year: tab1 invol

--------------------------------------------------------------------------------------------------------
-> year = 2002

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         94       75.81       75.81
          1 |         30       24.19      100.00
------------+-----------------------------------
      Total |        124      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2003

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        360       73.32       73.32
          1 |        131       26.68      100.00
------------+-----------------------------------
      Total |        491      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2004

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        697       76.34       76.34
          1 |        216       23.66      100.00
------------+-----------------------------------
      Total |        913      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2005

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        811       73.73       73.73
          1 |        289       26.27      100.00
------------+-----------------------------------
      Total |      1,100      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2006

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,046       77.54       77.54
          1 |        303       22.46      100.00
------------+-----------------------------------
      Total |      1,349      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2007

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,162       74.77       74.77
          1 |        392       25.23      100.00
------------+-----------------------------------
      Total |      1,554      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2008

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,077       67.78       67.78
          1 |        512       32.22      100.00
------------+-----------------------------------
      Total |      1,589      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2009

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        687       52.89       52.89
          1 |        612       47.11      100.00
------------+-----------------------------------
      Total |      1,299      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2010

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        788       60.48       60.48
          1 |        515       39.52      100.00
------------+-----------------------------------
      Total |      1,303      100.00

--------------------------------------------------------------------------------------------------------
-> year = 2011

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        630       61.40       61.40
          1 |        396       38.60      100.00
------------+-----------------------------------
      Total |      1,026      100.00

. 
. * Technically NLS wants you to sub in the edited version (EDT) of cv_enrollstat, but the diffs seem sm
> all.
. drop if inlist(enrollstat,8,9,10,11)
(4,799 observations deleted)

. tab1 enrollstat

-> tabulation of enrollstat  

                             enrollstat |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                     -5 |      1,981        6.51        6.51
                                     -3 |        123        0.40        6.92
Not enrolled, no high school degree, no |      2,838        9.33       16.25
                      Not enrolled, GED |      2,330        7.66       23.91
       Not enrolled, high school degree |      6,572       21.61       45.53
             Not enrolled, some college |      8,077       26.56       72.09
  Not enrolled, 2-year college graduate |      1,672        5.50       77.59
  Not enrolled, 4-year college graduate |      5,833       19.18       96.77
          Not enrolled, graduate degree |        982        3.23      100.00
----------------------------------------+-----------------------------------
                                  Total |     30,408      100.00

. 
. * This SE variable only available from 2000 on but should be okay given our age requirements.
. bys year: summ job1se_

--------------------------------------------------------------------------------------------------------
-> year = 2002

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |        226   -.8761062    1.811728         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2003

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |        933   -1.033226    1.943397         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2004

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      1,719     -.91274    1.888774         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2005

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      2,641   -.9719803    1.930411         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2006

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      3,326   -.7853277    1.753769         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2007

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      4,289   -.8088132    1.785829         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2008

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      4,408   -.5959619     1.59968         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2009

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      4,325   -.5089017    1.509368         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2010

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      4,299   -.4917423     1.52964         -5          1

--------------------------------------------------------------------------------------------------------
-> year = 2011

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     job1se_ |      4,242   -.4229137    1.441895         -5          1


. drop if job1se_==1
(1,641 observations deleted)

. 
. 
. *** Concern that change in job number coding plus computer assisted interviewing could lead to better 
> employer tracking.
. *** Coding, recording of tenure on main job each year should have changed less across survey years and
>  versions. So do some checks using only that.
. 
. * Probability that current tenure on main job is over a year, and currently employed, by previous tenu
> re category.
. 
. gen checkten1yrplus=0

. replace checkten1yrplus=1 if empd==1 & tencat>=3 & tencat~=.
(8,235 real changes made)

. 
. table ptencat [pw=custwt], contents(mean checkten1yrplus)

------------------------------------
            ptencat | mean(checkt~s)
--------------------+---------------
       Less than 1Y |       .0072572
 1Y to less than 3Y |        .242764
 3Y to less than 5Y |       .6898376
5Y to less than 10Y |        .758058
         10Y and up |       .8110587
------------------------------------

. 
. *tabulate ptencat tencat [pw=custwt], nofreq
. tabulate ptencat tencat, row column nofreq  

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                    |                         tencat
            ptencat | Less than  1Y to les  3Y to les  5Y to les  10Y and u |     Total
--------------------+-------------------------------------------------------+----------
       Less than 1Y |     47.72      51.47       0.64       0.16       0.00 |    100.00 
                    |     58.61      51.79       1.32       0.44       0.00 |     37.07 
--------------------+-------------------------------------------------------+----------
 1Y to less than 3Y |     24.47      48.01      27.32       0.18       0.01 |    100.00 
                    |     28.82      46.32      53.85       0.47       0.28 |     35.54 
--------------------+-------------------------------------------------------+----------
 3Y to less than 5Y |     16.24       2.86      50.14      30.76       0.00 |    100.00 
                    |      8.64       1.25      44.64      36.32       0.00 |     16.05 
--------------------+-------------------------------------------------------+----------
5Y to less than 10Y |     10.96       2.01       0.29      81.16       5.59 |    100.00 
                    |      3.82       0.57       0.17      62.77      43.45 |     10.52 
--------------------+-------------------------------------------------------+----------
         10Y and up |      4.13       2.75       0.46       0.00      92.66 |    100.00 
                    |      0.11       0.06       0.02       0.00      56.27 |      0.82 
--------------------+-------------------------------------------------------+----------
              Total |     30.18      36.84      18.03      13.60       1.35 |    100.00 
                    |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. 
. * Dummy for continued employment 
. 
. gen continuedemp=.
(28,767 missing values generated)

. replace continuedemp=1 if ptencat~=. & mainisnew==0
(18,609 real changes made)

. replace continuedemp=0 if ptencat~=. & mainisnew==1
(10,158 real changes made)

. 
. gen conempemp=.
(28,767 missing values generated)

. replace conempemp=0 if ptencat~=. 
(28,767 real changes made)

. replace conempemp=1 if ptencat~=. & mainisnew==0 & empd==1
(16,131 real changes made)

. 
. 
. * Universe of invol is everyone with a whyleft code. Check that some are not employed at current inter
> view  
. bys invol: summ empd

--------------------------------------------------------------------------------------------------------
-> invol = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      5,897    .7174835    .4502614          0          1

--------------------------------------------------------------------------------------------------------
-> invol = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      2,879    .5293505    .4992245          0          1

--------------------------------------------------------------------------------------------------------
-> invol = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     18,010    .9711827    .1672975          0          1


. 
. *** Mainisnew includes jobs new to main position, so can have (many) with mainisnew=1 but no invol cod
> e
. 
. * mainisnew=1 empd=1 and invol=. can happen if kept old main job as non-main employer
. * mainisnew=0 empd=1 and invol~=. can happen if left and returned to previous main employer
. * mainisnew=0 or =1 and empd=0 should have invol code for why left that employer
. 
. tab1 mainisnew

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,609       64.69       64.69
          1 |     10,158       35.31      100.00
------------+-----------------------------------
      Total |     28,767      100.00

. bys mainisnew: tab1 invol

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,107       51.49       51.49
          1 |      1,043       48.51      100.00
------------+-----------------------------------
      Total |      2,150      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,790       72.29       72.29
          1 |      1,836       27.71      100.00
------------+-----------------------------------
      Total |      6,626      100.00

. bys mainisnew: tab1 invol if empd==1

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol if empd==1 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1       50.00       50.00
          1 |          1       50.00      100.00
------------+-----------------------------------
      Total |          2      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol if empd==1 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,230       73.53       73.53
          1 |      1,523       26.47      100.00
------------+-----------------------------------
      Total |      5,753      100.00

. bys mainisnew: tab1 invol if empd==0

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol if empd==0 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,106       51.49       51.49
          1 |      1,042       48.51      100.00
------------+-----------------------------------
      Total |      2,148      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol if empd==0 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        560       64.15       64.15
          1 |        313       35.85      100.00
------------+-----------------------------------
      Total |        873      100.00

. 
. 
. * Dummies for shares of those previously employed who left vol, invol
. 
. gen sepvol=.
(28,767 missing values generated)

. replace sepvol=0 if ptencat~=.
(28,767 real changes made)

. replace sepvol=1 if ptencat~=. & invol==0
(5,897 real changes made)

. 
. gen sepinvol=.
(28,767 missing values generated)

. replace sepinvol=0 if ptencat~=.
(28,767 real changes made)

. replace sepinvol=1 if ptencat~=. & invol==1
(2,879 real changes made)

. 
. gen tempend=.
(28,767 missing values generated)

. replace tempend=0 if ptencat~=.
(28,767 real changes made)

. replace tempend=1 if tempend==0 & whyleft01_==3
(464 real changes made)

. 
. gen somecoll=.
(28,767 missing values generated)

. replace somecoll=0 if edgrp4_==1 | edgrp4_==2
(14,161 real changes made)

. replace somecoll=1 if edgrp4_==3 | edgrp4_==4
(14,571 real changes made)

. 
. 
. /* MAIN RESULTS TABLES, by previous tenure category */
. 
. tab1 ptencat

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     10,660       37.06       37.06
 1Y to less than 3Y |     10,215       35.51       72.57
 3Y to less than 5Y |      4,620       16.06       88.63
5Y to less than 10Y |      3,034       10.55       99.17
         10Y and up |        238        0.83      100.00
--------------------+-----------------------------------
              Total |     28,767      100.00

. bys ptencat: summ empd mainisnew invol

--------------------------------------------------------------------------------------------------------
-> ptencat = Less than 1Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      9,962    .8085726    .3934444          0          1
   mainisnew |     10,660    .4558161    .4980673          0          1
       invol |      4,484    .3429973    .4747635          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 1Y to less than 3Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      9,516    .8800967    .3248655          0          1
   mainisnew |     10,215    .3389134    .4733635          0          1
       invol |      2,962    .3143147    .4643207          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 3Y to less than 5Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      4,281    .9238496    .2652696          0          1
   mainisnew |      4,620    .2584416    .4378253          0          1
       invol |        898    .2939866    .4558398          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 5Y to less than 10Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      2,809    .9441082    .2297535          0          1
   mainisnew |      3,034    .1997363     .399868          0          1
       invol |        413    .3365617    .4731066          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 10Y and up

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |        218    .9587156    .1994051          0          1
   mainisnew |        238    .1554622    .3631084          0          1
       invol |         19    .3684211    .4955946          0          1


. table ptencat [pw=custwt], contents(mean empd mean mainisnew mean invol mean continuedemp mean conempe
> mp)

------------------------------------------------------------------------------------------
            ptencat |   mean(empd)  mean(main~w)   mean(invol)  mean(cont~p)  mean(cone~p)
--------------------+---------------------------------------------------------------------
       Less than 1Y |     .8219867      .4607311      .3252122      .5392689      .4318818
 1Y to less than 3Y |     .8888577      .3451463      .2977777      .6548537      .5799139
 3Y to less than 5Y |     .9272822      .2661549      .2742953      .7338451      .6845114
5Y to less than 10Y |     .9418784      .2016061      .3326802      .7983939      .7561944
         10Y and up |     .9496493       .166008       .391131       .833992      .7996547
------------------------------------------------------------------------------------------

. table ptencat [pw=custwt], contents(mean sepinvol mean sepvol mean tempend mean tmain)

------------------------------------------------------------------------------------
            ptencat | mean(sepinvol)    mean(sepvol)   mean(tempend)     mean(tmain)
--------------------+---------------------------------------------------------------
       Less than 1Y |       .1341137        .2782747         .028456        6.825319
 1Y to less than 3Y |       .0854378        .2014801        .0106644        6.072467
 3Y to less than 5Y |       .0542282        .1434719        .0040426        5.171159
5Y to less than 10Y |       .0464123        .0930979        .0038571        4.066599
         10Y and up |       .0357373        .0556319        .0177307        3.066777
------------------------------------------------------------------------------------

. 
. table ptencat [pw=custwt], contents(mean tempend mean sepinvol mean sepvol mean conempemp mean tmain)

------------------------------------------------------------------------------------------
            ptencat | mean(temp~d)  mean(sepi~l)  mean(sepvol)  mean(cone~p)   mean(tmain)
--------------------+---------------------------------------------------------------------
       Less than 1Y |      .028456      .1341137      .2782747      .4318818      6.825319
 1Y to less than 3Y |     .0106644      .0854378      .2014801      .5799139      6.072467
 3Y to less than 5Y |     .0040426      .0542282      .1434719      .6845114      5.171159
5Y to less than 10Y |     .0038571      .0464123      .0930979      .7561944      4.066599
         10Y and up |     .0177307      .0357373      .0556319      .7996547      3.066777
------------------------------------------------------------------------------------------

. table age [pw=custwt], contents(mean tmain)

-----------------------
      age | mean(tmain)
----------+------------
       22 |    4.817225
       23 |    5.236616
       24 |    5.650474
       25 |    5.960126
       26 |    6.230028
       27 |     6.51855
       28 |    6.703756
       29 |    6.760677
       30 |    6.899966
       31 |    6.947997
-----------------------

. 
. table ptencat [pw=custwt], contents(mean tempend mean sepinvol mean sepvol mean conempemp mean tmain22
> _)

------------------------------------------------------------------------------------------
            ptencat | mean(temp~d)  mean(sepi~l)  mean(sepvol)  mean(cone~p)  mean(tm~22_)
--------------------+---------------------------------------------------------------------
       Less than 1Y |      .028456      .1341137      .2782747      .4318818      2.615766
 1Y to less than 3Y |     .0106644      .0854378      .2014801      .5799139      2.240756
 3Y to less than 5Y |     .0040426      .0542282      .1434719      .6845114       1.79579
5Y to less than 10Y |     .0038571      .0464123      .0930979      .7561944      1.377099
         10Y and up |     .0177307      .0357373      .0556319      .7996547      1.155533
------------------------------------------------------------------------------------------

. table age [pw=custwt], contents(mean tmain22_)

--------------------------
      age | mean(tmain22_)
----------+---------------
       22 |       .9978516
       23 |       1.407988
       24 |       1.806154
       25 |       2.152654
       26 |       2.433186
       27 |         2.7495
       28 |       3.004268
       29 |        3.21983
       30 |       3.512015
       31 |       3.820289
--------------------------

. 
. preserve 

. 
. keep if continuous==1
(9,035 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain)

. list

     +------------------+
     | tmain   contin~s |
     |------------------|
  1. |     1    1.02817 |
  2. |     2   3.989363 |
  3. |     3   8.149418 |
  4. |     4   13.42356 |
  5. |     5   16.77081 |
     |------------------|
  6. |     6   17.68395 |
  7. |     7   15.26232 |
  8. |     8   10.74285 |
  9. |     9   6.741241 |
 10. |    10   3.448948 |
     |------------------|
 11. |    11   1.818302 |
 12. |    12   .6626676 |
 13. |    13   .2227216 |
 14. |    14   .0556776 |
     +------------------+

.  
. restore 

. preserve 

. 
. keep if continuous==1
(9,035 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        0   .0247237 |
  2. |        1   37.82642 |
  3. |        2   28.96388 |
  4. |        3   17.36046 |
  5. |        4   9.327765 |
     |---------------------|
  6. |        5   4.271467 |
  7. |        6   1.597299 |
  8. |        7     .52314 |
  9. |        8   .0735063 |
 10. |        9   .0313337 |
     +---------------------+

.  
. restore 

. preserve

. keep if continuous==1 & somecoll==0
(19,593 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        0   .0577821 |
  2. |        1   43.11215 |
  3. |        2   26.02425 |
  4. |        3   15.21255 |
  5. |        4   8.763293 |
     |---------------------|
  6. |        5   4.298978 |
  7. |        6   1.724166 |
  8. |        7   .6397463 |
  9. |        8   .1122885 |
 10. |        9   .0547915 |
     +---------------------+

.  
. restore 

. preserve

. keep if continuous==1 & somecoll==1
(18,229 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        1   33.90307 |
  2. |        2   31.16128 |
  3. |        3   18.97809 |
  4. |        4   9.750106 |
  5. |        5   4.225514 |
     |---------------------|
  6. |        6   1.486826 |
  7. |        7   .4367201 |
  8. |        8   .0445822 |
  9. |        9    .013815 |
     +---------------------+

.  
. restore 

. 
. 
. sort year

. univar year
                                        -------------- Quantiles --------------
Variable       n     Mean     S.D.      Min      .25      Mdn      .75      Max
-------------------------------------------------------------------------------
    year   28767  2007.78     2.29  2002.00  2006.00  2008.00  2010.00  2011.00
-------------------------------------------------------------------------------

. 
. ** Compare tmain, tmain22 among obs in continuously
. 
. table ptencat if continuous==1 [pw=custwt], contents(mean tmain mean tmain22_)

----------------------------------------------------
            ptencat |    mean(tmain)  mean(tmain22_)
--------------------+-------------------------------
       Less than 1Y |       6.825319        2.615766
 1Y to less than 3Y |       6.072467        2.240756
 3Y to less than 5Y |       5.171159         1.79579
5Y to less than 10Y |       4.066599        1.377099
         10Y and up |       3.066777        1.155533
----------------------------------------------------

. table age if continuous==1 [pw=custwt], contents(mean tmain mean tmain22_)

------------------------------------------
      age |    mean(tmain)  mean(tmain22_)
----------+-------------------------------
       22 |       4.817225        .9978516
       23 |       5.236616        1.407988
       24 |       5.650474        1.806154
       25 |       5.960126        2.152654
       26 |       6.230028        2.433186
       27 |        6.51855          2.7495
       28 |       6.703756        3.004268
       29 |       6.760677         3.21983
       30 |       6.899966        3.512015
       31 |       6.947997        3.820289
------------------------------------------

. corr tmain tmain22_ if continuous==1 
(obs=19,732)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.6698   1.0000


. bys year: corr tmain tmain22_ if continuous==1 

--------------------------------------------------------------------------------------------------------
-> year = 2002
(obs=133)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |        .        .


--------------------------------------------------------------------------------------------------------
-> year = 2003
(obs=567)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.1870   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2004
(obs=1,046)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.2841   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2005
(obs=1,658)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.4433   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2006
(obs=2,206)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.4964   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2007
(obs=2,789)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.5445   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2008
(obs=2,895)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.6121   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2009
(obs=2,849)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.6679   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2010
(obs=2,792)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.7190   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 2011
(obs=2,797)

             |    tmain tmain22_
-------------+------------------
       tmain |   1.0000
    tmain22_ |   0.7506   1.0000



. 
. ** Drop recession years
. 
. preserve

. drop if inlist(year, 2000, 2001, 2008, 2009)
(8,253 observations deleted)

. 
. table ptencat [pw=custwt], contents(mean empd mean mainisnew mean invol mean continuedemp mean conempe
> mp)

------------------------------------------------------------------------------------------
            ptencat |   mean(empd)  mean(main~w)   mean(invol)  mean(cont~p)  mean(cone~p)
--------------------+---------------------------------------------------------------------
       Less than 1Y |     .8281172      .4801824      .3019412      .5198176      .4206425
 1Y to less than 3Y |     .8917776       .371557      .2710978      .6284431      .5568967
 3Y to less than 5Y |     .9311522      .2681782      .2306108      .7318218      .6837288
5Y to less than 10Y |     .9445391      .2154015      .2925248      .7845985      .7457319
         10Y and up |     .9533663      .1543879      .4491373      .8456121      .8109137
------------------------------------------------------------------------------------------

. table ptencat [pw=custwt], contents(mean sepinvol mean sepvol mean tempend)

--------------------------------------------------------------------
            ptencat | mean(sepinvol)    mean(sepvol)   mean(tempend)
--------------------+-----------------------------------------------
       Less than 1Y |       .1256679        .2905321        .0295484
 1Y to less than 3Y |       .0800531        .2152391        .0118548
 3Y to less than 5Y |       .0466773        .1557298        .0032484
5Y to less than 10Y |       .0411524        .0995276        .0042438
         10Y and up |       .0364328        .0446845        .0141268
--------------------------------------------------------------------

. restore

. 
. * Adjust for changing age composition by year
. 
. corr invol sepinvol age
(obs=8,776)

             |    invol sepinvol      age
-------------+---------------------------
       invol |   1.0000
    sepinvol |   1.0000   1.0000
         age |   0.1217   0.1217   1.0000


. 
. xi, pre(_A) i.age 
i.age             _Aage_22-31         (naturally coded; _Aage_22 omitted)

. keep year custwt _A* empd mainisnew invol continuedemp sepinvol sepvol tempend

. 
. foreach x in empd mainisnew invol continuedemp sepinvol sepvol tempend {
  2.         reg `x' _A*
  3.         predict `x'_adj, residuals
  4. }

      Source |       SS           df       MS      Number of obs   =    26,786
-------------+----------------------------------   F(9, 26776)     =      6.62
       Model |  6.81670777         9  .757411974   Prob > F        =    0.0000
    Residual |  3065.34188    26,776  .114480949   R-squared       =    0.0022
-------------+----------------------------------   Adj R-squared   =    0.0019
       Total |  3072.15859    26,785  .114696979   Root MSE        =    .33835

------------------------------------------------------------------------------
        empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |    .011827   .0083912     1.41   0.159    -.0046202    .0282741
    _Aage_24 |   .0251117   .0082866     3.03   0.002     .0088695    .0413539
    _Aage_25 |   .0283709   .0082446     3.44   0.001     .0122111    .0445307
    _Aage_26 |   .0305374   .0081918     3.73   0.000      .014481    .0465939
    _Aage_27 |   .0337769    .008437     4.00   0.000     .0172399    .0503139
    _Aage_28 |   .0425253   .0090398     4.70   0.000     .0248068    .0602439
    _Aage_29 |   .0466714   .0101088     4.62   0.000     .0268576    .0664852
    _Aage_30 |   .0746659   .0123365     6.05   0.000     .0504858     .098846
    _Aage_31 |   .0221125   .0210212     1.05   0.293    -.0190901    .0633151
       _cons |   .8400783   .0061125   137.44   0.000     .8280974    .8520592
------------------------------------------------------------------------------
(1,981 missing values generated)

      Source |       SS           df       MS      Number of obs   =    28,767
-------------+----------------------------------   F(9, 28757)     =    104.30
       Model |  207.714361         9  23.0793734   Prob > F        =    0.0000
    Residual |  6363.36438    28,757  .221280536   R-squared       =    0.0316
-------------+----------------------------------   Adj R-squared   =    0.0313
       Total |  6571.07874    28,766  .228432133   Root MSE        =     .4704

------------------------------------------------------------------------------
   mainisnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0470699     .01113    -4.23   0.000    -.0688852   -.0252546
    _Aage_24 |  -.0891619   .0109939    -8.11   0.000    -.1107105   -.0676134
    _Aage_25 |  -.1408734   .0109768   -12.83   0.000    -.1623885   -.1193584
    _Aage_26 |  -.1750786   .0109267   -16.02   0.000    -.1964955   -.1536617
    _Aage_27 |  -.2138574   .0112736   -18.97   0.000    -.2359542   -.1917606
    _Aage_28 |  -.2465267    .012091   -20.39   0.000    -.2702257   -.2228277
    _Aage_29 |  -.2474817   .0135125   -18.32   0.000    -.2739668   -.2209965
    _Aage_30 |  -.2646585   .0165994   -15.94   0.000    -.2971941   -.2321229
    _Aage_31 |  -.2665086   .0284209    -9.38   0.000     -.322215   -.2108022
       _cons |   .4946965   .0080745    61.27   0.000     .4788701    .5105229
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =     8,776
-------------+----------------------------------   F(9, 8766)      =     16.63
       Model |  32.4796808         9  3.60885342   Prob > F        =    0.0000
    Residual |  1902.05348     8,766  .216980775   R-squared       =    0.0168
-------------+----------------------------------   Adj R-squared   =    0.0158
       Total |  1934.53316     8,775  .220459619   Root MSE        =    .46581

------------------------------------------------------------------------------
       invol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0138095   .0174833    -0.79   0.430     -.048081    .0204619
    _Aage_24 |   .0214304   .0177535     1.21   0.227    -.0133706    .0562313
    _Aage_25 |   .0708754   .0182572     3.88   0.000     .0350871    .1066638
    _Aage_26 |   .1204861   .0184128     6.54   0.000     .0843926    .1565796
    _Aage_27 |   .1181091   .0194149     6.08   0.000     .0800514    .1561669
    _Aage_28 |   .1391304   .0223626     6.22   0.000     .0952945    .1829664
    _Aage_29 |   .1629108    .025691     6.34   0.000     .1125505    .2132711
    _Aage_30 |   .1448166   .0344799     4.20   0.000     .0772278    .2124054
    _Aage_31 |   .1204301   .0604183     1.99   0.046     .0019961    .2388642
       _cons |   .2666667   .0122752    21.72   0.000     .2426043     .290729
------------------------------------------------------------------------------
(19,991 missing values generated)

      Source |       SS           df       MS      Number of obs   =    28,767
-------------+----------------------------------   F(9, 28757)     =    104.30
       Model |  207.714361         9  23.0793734   Prob > F        =    0.0000
    Residual |  6363.36438    28,757  .221280536   R-squared       =    0.0316
-------------+----------------------------------   Adj R-squared   =    0.0313
       Total |  6571.07874    28,766  .228432133   Root MSE        =     .4704

------------------------------------------------------------------------------
continuedemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |   .0470699     .01113     4.23   0.000     .0252546    .0688852
    _Aage_24 |   .0891619   .0109939     8.11   0.000     .0676134    .1107105
    _Aage_25 |   .1408734   .0109768    12.83   0.000     .1193584    .1623885
    _Aage_26 |   .1750786   .0109267    16.02   0.000     .1536617    .1964955
    _Aage_27 |   .2138574   .0112736    18.97   0.000     .1917606    .2359542
    _Aage_28 |   .2465267    .012091    20.39   0.000     .2228277    .2702257
    _Aage_29 |   .2474817   .0135125    18.32   0.000     .2209965    .2739668
    _Aage_30 |   .2646585   .0165994    15.94   0.000     .2321229    .2971941
    _Aage_31 |   .2665086   .0284209     9.38   0.000     .2108022     .322215
       _cons |   .5053035   .0080745    62.58   0.000     .4894771    .5211299
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    28,767
-------------+----------------------------------   F(9, 28757)     =      2.26
       Model |  1.83355882         9  .203728757   Prob > F        =    0.0158
    Residual |  2589.03626    28,757  .090031514   R-squared       =    0.0007
-------------+----------------------------------   Adj R-squared   =    0.0004
       Total |  2590.86982    28,766  .090067087   Root MSE        =    .30005

------------------------------------------------------------------------------
    sepinvol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0192665   .0070994    -2.71   0.007    -.0331817   -.0053514
    _Aage_24 |  -.0175434   .0070126    -2.50   0.012    -.0312883   -.0037984
    _Aage_25 |  -.0129409   .0070017    -1.85   0.065    -.0266645    .0007827
    _Aage_26 |  -.0039074   .0069697    -0.56   0.575    -.0175684    .0097535
    _Aage_27 |  -.0099241    .007191    -1.38   0.168    -.0240187    .0041706
    _Aage_28 |  -.0209007   .0077124    -2.71   0.007    -.0360174   -.0057841
    _Aage_29 |  -.0160586   .0086191    -1.86   0.062    -.0329524    .0008352
    _Aage_30 |  -.0313918   .0105881    -2.96   0.003     -.052145   -.0106386
    _Aage_31 |  -.0326039   .0181286    -1.80   0.072    -.0681368     .002929
       _cons |   .1131408   .0051504    21.97   0.000     .1030458    .1232359
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    28,767
-------------+----------------------------------   F(9, 28757)     =     74.12
       Model |  106.283531         9  11.8092813   Prob > F        =    0.0000
    Residual |  4581.87964    28,757  .159330933   R-squared       =    0.0227
-------------+----------------------------------   Adj R-squared   =    0.0224
       Total |  4688.16317    28,766  .162975846   Root MSE        =    .39916

------------------------------------------------------------------------------
      sepvol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0337573   .0094444    -3.57   0.000    -.0522687   -.0152459
    _Aage_24 |  -.0749109   .0093289    -8.03   0.000    -.0931959   -.0566258
    _Aage_25 |  -.1144856   .0093144   -12.29   0.000    -.1327422    -.096229
    _Aage_26 |  -.1382252   .0092719   -14.91   0.000    -.1563986   -.1200519
    _Aage_27 |  -.1461023   .0095662   -15.27   0.000    -.1648526   -.1273521
    _Aage_28 |  -.1760714   .0102599   -17.16   0.000    -.1961813   -.1559616
    _Aage_29 |  -.1822248   .0114661   -15.89   0.000    -.2046988   -.1597508
    _Aage_30 |  -.1942171   .0140855   -13.79   0.000    -.2218253    -.166609
    _Aage_31 |  -.1836205   .0241166    -7.61   0.000    -.2308903   -.1363508
       _cons |   .3111373   .0068516    45.41   0.000     .2977078    .3245668
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    28,767
-------------+----------------------------------   F(9, 28757)     =      4.25
       Model |  .606722885         9  .067413654   Prob > F        =    0.0000
    Residual |  455.909146    28,757  .015853849   R-squared       =    0.0013
-------------+----------------------------------   Adj R-squared   =    0.0010
       Total |  456.515869    28,766  .015869981   Root MSE        =    .12591

------------------------------------------------------------------------------
     tempend |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0015904   .0029791    -0.53   0.593    -.0074296    .0042489
    _Aage_24 |  -.0090229   .0029427    -3.07   0.002    -.0147907    -.003255
    _Aage_25 |  -.0083734   .0029381    -2.85   0.004    -.0141323   -.0026145
    _Aage_26 |  -.0062316   .0029247    -2.13   0.033    -.0119642    -.000499
    _Aage_27 |  -.0132363   .0030176    -4.39   0.000    -.0191509   -.0073217
    _Aage_28 |  -.0121526   .0032364    -3.76   0.000    -.0184961   -.0058092
    _Aage_29 |  -.0121946   .0036169    -3.37   0.001    -.0192838   -.0051053
    _Aage_30 |  -.0134094   .0044431    -3.02   0.003    -.0221181   -.0047006
    _Aage_31 |  -.0137985   .0076074    -1.81   0.070    -.0287093    .0011123
       _cons |   .0238656   .0021613    11.04   0.000     .0196294    .0281019
------------------------------------------------------------------------------

. 
. sort year

. 
. table year [pw=custwt], contents(mean empd_adj mean mainisnew_adj mean invol_adj)

----------------------------------------------------------
     year | mean(empd_adj)  mean(mainis~j)  mean(invol_~j)
----------+-----------------------------------------------
     2002 |       .0022614       -.0219644       -.0279183
     2003 |      -.0106482       -.0089271        .0136094
     2004 |        .011894        .0195537       -.0560565
     2005 |       .0244905         .016543       -.0235435
     2006 |        .016668        .0164609         -.06311
     2007 |        .025101        .0379381       -.0522528
     2008 |      -.0057866        .0125134       -.0210434
     2009 |      -.0029295       -.0457657        .1017742
     2010 |       .0021594        .0110514        -.003444
     2011 |        .015095       -.0124792       -.0350732
----------------------------------------------------------

. table year [pw=custwt], contents(mean sepinvol_adj mean sepvol_adj mean tempend_adj)

----------------------------------------------------------
     year | mean(sepinv~j)  mean(sepvol~j)  mean(tempen~j)
----------+-----------------------------------------------
     2002 |      -.0098683        .0181481       -.0068068
     2003 |       .0062508       -.0036362       -.0081909
     2004 |      -.0138074        .0518382       -.0016468
     2005 |      -.0152415       -.0126642          .00356
     2006 |      -.0231094        .0185878       -.0026618
     2007 |      -.0230813        .0014448        .0015094
     2008 |      -.0010914        .0167901       -.0015927
     2009 |       .0212354       -.0352177       -.0006679
     2010 |       .0008087        .0031208         .000052
     2011 |      -.0123567        .0010718       -.0015256
----------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\IRAKW01\Wozniak PC porting Dropbox\Abigail Wozniak (abigailwozniak)\Abigail Woznia
> kâ€™s files\Home\Job tenure\NLS and NLSY data\NLSY97\make_tenure_whyleft_97.log
  log type:  text
 closed on:  22 Sep 2021, 14:05:59
--------------------------------------------------------------------------------------------------------
