--------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\IRAKW01\Wozniak PC porting Dropbox\Abigail Wozniak (abigailwozniak)\Abigail Woznia
> kâ€™s files\Home\Job tenure\NLS and NLSY data\NLSY79\make_tenure_whyleft.log
  log type:  text
 opened on:  22 Sep 2021, 13:59:01

. 
. * This is updated data set from migration decline project. Makedata files now in Data Construction fol
> der.
. 
. use nlsy79_1979to1994.dta

. 
. 
. *** Analysis for job tenure project
. 
. foreach x of numlist 80/94 {
  2.   replace hgcrev`x'=. if hgcrev`x' < 0
  3. }       
(546 real changes made, 546 to missing)
(501 real changes made, 501 to missing)
(603 real changes made, 603 to missing)
(509 real changes made, 509 to missing)
(639 real changes made, 639 to missing)
(1,817 real changes made, 1,817 to missing)
(2,069 real changes made, 2,069 to missing)
(2,240 real changes made, 2,240 to missing)
(2,262 real changes made, 2,262 to missing)
(2,111 real changes made, 2,111 to missing)
(2,287 real changes made, 2,287 to missing)
(3,683 real changes made, 3,683 to missing)
(3,677 real changes made, 3,677 to missing)
(3,676 real changes made, 3,676 to missing)
(3,800 real changes made, 3,800 to missing)

. 
. foreach x of numlist 79/94 {
  2.   replace minterview`x'=(minterview`x'==-5)
  3. } 
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)
(12,686 real changes made)

. egen count = rowtotal(minterview79 minterview80 minterview81 minterview81 minterview82 minterview83 mi
> nterview84 minterview85 minterview86 minterview87 minterview88 minterview89 minterview90 minterview91 
> minterview92 minterview93 minterview94)

. gen continuous=1

. replace continuous=0 if count > 0
(5,533 real changes made)

. summ continuous

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  continuous |     12,686    .5638499     .495926          0          1

. 
. * Variable for months of tenure on main job (job 1) at previous survey round. And dummy for employment
>  at job 1 in previous round.
. 
. gen prevtenuremon1_79=.
(12,686 missing values generated)

. 
. foreach x of numlist 80/94 {
  2.    local y = `x' - 1
  3.    gen prevtenuremon1_`x'= . 
  4.    replace prevtenuremon1_`x'=tenuremon1_`y' 
  5.    *replace prevtenuremon1_`x'=tenuremon1_`y' if (esr_key`y'==1 | esr_key`y'==2)
.    
.    gen prevempd1_`x' = .
  6.    replace prevempd1_`x'=0 if QES2301_`y'==0 | QES2301_`y'==-4
  7.    replace prevempd1_`x'=1 if QES2301_`y'==1
  8.    
.    }
(12,686 missing values generated)
(5,119 real changes made)
(12,686 missing values generated)
(7,703 real changes made)
(4,982 real changes made)
(12,686 missing values generated)
(8,475 real changes made)
(12,686 missing values generated)
(6,449 real changes made)
(5,689 real changes made)
(12,686 missing values generated)
(9,130 real changes made)
(12,686 missing values generated)
(5,836 real changes made)
(6,357 real changes made)
(12,686 missing values generated)
(9,397 real changes made)
(12,686 missing values generated)
(5,456 real changes made)
(6,664 real changes made)
(12,686 missing values generated)
(9,447 real changes made)
(12,686 missing values generated)
(5,283 real changes made)
(6,938 real changes made)
(12,686 missing values generated)
(9,561 real changes made)
(12,686 missing values generated)
(4,518 real changes made)
(7,548 real changes made)
(12,686 missing values generated)
(9,013 real changes made)
(12,686 missing values generated)
(3,569 real changes made)
(7,325 real changes made)
(12,686 missing values generated)
(8,920 real changes made)
(12,686 missing values generated)
(3,148 real changes made)
(7,507 real changes made)
(12,686 missing values generated)
(8,893 real changes made)
(12,686 missing values generated)
(2,774 real changes made)
(7,708 real changes made)
(12,686 missing values generated)
(9,010 real changes made)
(12,686 missing values generated)
(2,577 real changes made)
(7,882 real changes made)
(12,686 missing values generated)
(8,989 real changes made)
(12,686 missing values generated)
(2,614 real changes made)
(7,991 real changes made)
(12,686 missing values generated)
(8,871 real changes made)
(12,686 missing values generated)
(2,427 real changes made)
(8,008 real changes made)
(12,686 missing values generated)
(7,554 real changes made)
(12,686 missing values generated)
(2,244 real changes made)
(6,774 real changes made)
(12,686 missing values generated)
(7,558 real changes made)
(12,686 missing values generated)
(2,213 real changes made)
(6,801 real changes made)
(12,686 missing values generated)
(7,471 real changes made)
(12,686 missing values generated)
(2,186 real changes made)
(6,825 real changes made)

.    
. summ prevtenuremon1* prevempd1*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
prevtenur~79 |          0
prevtenur~80 |      5,119    8.589838     7.71795    .230787    110.547
prevtenur~81 |      8,475     8.93629    9.013835    .230787   121.6247
prevtenur~82 |      9,130    11.53467    11.64618    .230787   133.8564
prevtenur~83 |      9,397    13.74073    14.11418    .230787    146.319
-------------+---------------------------------------------------------
prevtenur~84 |      9,447    16.85808    16.99421    .230787   158.3199
prevtenur~85 |      9,561    19.05119    19.92111    .230787   171.0132
prevtenur~86 |      9,013    21.64891    23.12271    .230787   182.3217
prevtenur~87 |      8,920     24.4598    26.07412    .230787   149.3192
prevtenur~88 |      8,893    28.11353    29.17702    .230787   161.5509
-------------+---------------------------------------------------------
prevtenur~89 |      9,010    30.85274    32.57833    .230787   180.2446
prevtenur~90 |      8,989    34.17886    35.49745    .230787   189.0145
prevtenur~91 |      8,871    37.65959    38.76542    .230787    201.477
prevtenur~92 |      7,554    41.97534    41.53228    .230787   212.7856
prevtenur~93 |      7,558    46.07318    44.95803    .230787   225.2481
-------------+---------------------------------------------------------
prevtenur~94 |      7,471    50.27771    47.90149    .230787   236.0951
prevempd1_80 |     12,685    .3927473    .4883807          0          1
prevempd1_81 |     12,138    .4686934    .4990395          0          1
prevempd1_82 |     12,193    .5213647    .4995638          0          1
prevempd1_83 |     12,120     .549835    .4975308          0          1
-------------+---------------------------------------------------------
prevempd1_84 |     12,221    .5677113    .4954142          0          1
prevempd1_85 |     12,066    .6255594    .4839982          0          1
prevempd1_86 |     10,894    .6723885    .4693639          0          1
prevempd1_87 |     10,655    .7045519    .4562654          0          1
prevempd1_88 |     10,482    .7353558    .4411646          0          1
-------------+---------------------------------------------------------
prevempd1_89 |     10,459    .7536093    .4309293          0          1
prevempd1_90 |     10,605    .7535125     .430986          0          1
prevempd1_91 |     10,435    .7674173    .4224986          0          1
prevempd1_92 |      9,018    .7511643    .4323624          0          1
prevempd1_93 |      9,014     .754493    .4304113          0          1
-------------+---------------------------------------------------------
prevempd1_94 |      9,011    .7574076    .4286744          0          1

. 
. 
. * Dummy for main job (job 1) is new this survey round. This is defined by accession to a new employer.
>  
. * Reason for leaving previous job 1 employer is defined by a separation from that employer. So affecte
> d groups do not overlap perfectly.
. * Also, not all Rs with a new main job are employed at that job at the time of interview. Can restrict
>  to employed later.
. 
. gen mainisnew79=.
(12,686 missing values generated)

. gen tmain79=0 if QES2301_79 < 0 & continuous==1
(8,696 missing values generated)

. replace tmain79=1 if QES2301_79 >= 0 & continuous==1
(3,163 real changes made)

. 
. summ age79

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       age79 |     12,686    17.89816    2.305593         14         22

. gen tmain22_79=0 if continuous==1
(5,533 missing values generated)

. replace tmain22_79=1 if QES2301_79 >=0 & age79 >=22 & continuous==1
(109 real changes made)

. 
. forvalues x = 80/94 {
  2. 
.    *tab1 emp1previd`x'
. 
.    gen mainisnew`x'=.    
  3.    replace mainisnew`x'=0 if emp1previd`x' > 0 
  4.    replace mainisnew`x'=1 if emp1previd`x'==-4 
  5.    
.    * Above coding combines those newly employed with those who have an employer change, could try cond
> itioning on prev employment -- 
.    * but cutting by tenure on prev job categories does this already, and 1997 def also not conditional
>  on prev emp.
.      
.    }
(12,686 missing values generated)
(2,548 real changes made)
(9,593 real changes made)
(12,686 missing values generated)
(3,315 real changes made)
(8,880 real changes made)
(12,686 missing values generated)
(3,761 real changes made)
(8,362 real changes made)
(12,686 missing values generated)
(4,474 real changes made)
(7,747 real changes made)
(12,686 missing values generated)
(4,441 real changes made)
(7,628 real changes made)
(12,686 missing values generated)
(4,484 real changes made)
(6,410 real changes made)
(12,686 missing values generated)
(4,623 real changes made)
(6,032 real changes made)
(12,686 missing values generated)
(4,827 real changes made)
(5,658 real changes made)
(12,686 missing values generated)
(4,834 real changes made)
(5,630 real changes made)
(12,686 missing values generated)
(5,703 real changes made)
(4,902 real changes made)
(12,686 missing values generated)
(5,706 real changes made)
(4,726 real changes made)
(12,686 missing values generated)
(5,478 real changes made)
(3,540 real changes made)
(12,686 missing values generated)
(5,329 real changes made)
(3,687 real changes made)
(12,686 missing values generated)
(5,709 real changes made)
(0 real changes made)
(12,686 missing values generated)
(5,442 real changes made)
(3,449 real changes made)

.    
. * 1993 seems to have coding error in which -4 for emp1previd was coded as 0. Changing.
. 
. replace mainisnew93=1 if emp1previd93==0 & (esr_key93==1 | esr_key93==2)
(1,578 real changes made)

. 
. forvalues x = 80/94 {
  2. 
.    replace jobsnum`x'=. if jobsnum`x' < 0
  3. 
.    local y = `x' - 1
  4.    gen tmain`x' = tmain`y' if continuous==1 
  5.    replace tmain`x' = mainisnew`x' + tmain`y' if continuous==1 & mainisnew`x'~=.
  6. 
. 
.    gen tmain22_`x' = tmain22_`y' if continuous==1 
  7.    replace tmain22_`x' = (mainisnew`x' + tmain22_`y') if continuous==1 & mainisnew`x'~=. & ((age79 
> + `x' - 79) > 22)
  8.    replace tmain22_`x'=1 if QES2301_`x' >= 0 & continuous==1 & ((age79 + `x' - 79) == 22)
  9.    
. }
(545 real changes made, 545 to missing)
(5,533 missing values generated)
(5,517 real changes made)
(5,533 missing values generated)
(94 real changes made)
(659 real changes made)
(491 real changes made, 491 to missing)
(5,533 missing values generated)
(5,041 real changes made)
(5,533 missing values generated)
(520 real changes made)
(621 real changes made)
(563 real changes made, 563 to missing)
(5,533 missing values generated)
(4,814 real changes made)
(5,533 missing values generated)
(883 real changes made)
(689 real changes made)
(465 real changes made, 465 to missing)
(5,533 missing values generated)
(4,352 real changes made)
(5,533 missing values generated)
(1,267 real changes made)
(775 real changes made)
(619 real changes made, 619 to missing)
(5,533 missing values generated)
(4,393 real changes made)
(5,533 missing values generated)
(1,878 real changes made)
(837 real changes made)
(1,794 real changes made, 1,794 to missing)
(5,533 missing values generated)
(4,101 real changes made)
(5,533 missing values generated)
(2,327 real changes made)
(846 real changes made)
(2,033 real changes made, 2,033 to missing)
(5,533 missing values generated)
(3,951 real changes made)
(5,533 missing values generated)
(2,868 real changes made)
(858 real changes made)
(2,203 real changes made, 2,203 to missing)
(5,533 missing values generated)
(3,743 real changes made)
(5,533 missing values generated)
(3,315 real changes made)
(548 real changes made)
(2,225 real changes made, 2,225 to missing)
(5,533 missing values generated)
(3,692 real changes made)
(5,533 missing values generated)
(3,692 real changes made)
(0 real changes made)
(2,085 real changes made, 2,085 to missing)
(5,533 missing values generated)
(3,097 real changes made)
(5,533 missing values generated)
(3,097 real changes made)
(0 real changes made)
(2,259 real changes made, 2,259 to missing)
(5,533 missing values generated)
(3,090 real changes made)
(5,533 missing values generated)
(3,090 real changes made)
(0 real changes made)
(3,675 real changes made, 3,675 to missing)
(5,533 missing values generated)
(2,636 real changes made)
(5,533 missing values generated)
(2,636 real changes made)
(0 real changes made)
(3,677 real changes made, 3,677 to missing)
(5,533 missing values generated)
(2,760 real changes made)
(5,533 missing values generated)
(2,760 real changes made)
(0 real changes made)
(3,682 real changes made, 3,682 to missing)
(5,533 missing values generated)
(1,171 real changes made)
(5,533 missing values generated)
(1,171 real changes made)
(0 real changes made)
(3,804 real changes made, 3,804 to missing)
(5,533 missing values generated)
(2,635 real changes made)
(5,533 missing values generated)
(2,635 real changes made)
(0 real changes made)

. 
. summ mainisnew* tmain*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
 mainisnew79 |          0
 mainisnew80 |     12,141    .7901326    .4072306          0          1
 mainisnew81 |     12,195    .7281673    .4449224          0          1
 mainisnew82 |     12,123    .6897633    .4626095          0          1
 mainisnew83 |     12,221    .6339088    .4817545          0          1
-------------+---------------------------------------------------------
 mainisnew84 |     12,069    .6320325    .4822724          0          1
 mainisnew85 |     10,894    .5883973    .4921465          0          1
 mainisnew86 |     10,655    .5661192    .4956322          0          1
 mainisnew87 |     10,485     .539628    .4984509          0          1
 mainisnew88 |     10,464    .5380352    .4985751          0          1
-------------+---------------------------------------------------------
 mainisnew89 |     10,605    .4622348    .4985953          0          1
 mainisnew90 |     10,432    .4530291    .4978127          0          1
 mainisnew91 |      9,018    .3925482    .4883447          0          1
 mainisnew92 |      9,016    .4089397    .4916654          0          1
 mainisnew93 |      7,287      .21655    .4119216          0          1
-------------+---------------------------------------------------------
 mainisnew94 |      8,891    .3879204    .4873037          0          1
     tmain79 |      7,153    .4421921    .4966817          0          1
  tmain22_79 |      7,153    .0152384    .1225082          0          1
     tmain80 |      7,153    1.213477    .4215631          0          2
  tmain22_80 |      7,153    .1205089     .341508          0          2
-------------+---------------------------------------------------------
     tmain81 |      7,153    1.918216    .5949024          0          3
  tmain22_81 |      7,153    .2800224    .5729886          0          3
     tmain82 |      7,153     2.59122    .8209989          0          4
  tmain22_82 |      7,153    .4997903    .8161754          0          4
     tmain83 |      7,153    3.199637    1.066243          0          5
-------------+---------------------------------------------------------
  tmain22_83 |      7,153    .7852649    1.045268          0          5
     tmain84 |      7,153    3.813784    1.315773          1          6
  tmain22_84 |      7,153    1.164826    1.274572          0          6
     tmain85 |      7,153     4.38711    1.570006          1          7
  tmain22_85 |      7,153    1.608416    1.465972          0          7
-------------+---------------------------------------------------------
     tmain86 |      7,153    4.939466    1.821785          1          8
  tmain22_86 |      7,153    2.129316    1.602631          0          8
     tmain87 |      7,153    5.462743    2.059189          1          9
  tmain22_87 |      7,153    2.669369    1.704755          0          9
     tmain88 |      7,153     5.97889    2.296341          1         10
-------------+---------------------------------------------------------
  tmain22_88 |      7,153    3.185517    1.858863          0         10
     tmain89 |      7,153    6.411855    2.526666          1         11
  tmain22_89 |      7,153    3.618482    2.042263          0         11
     tmain90 |      7,153    6.843842    2.767525          1         12
  tmain22_90 |      7,153    4.050468    2.248315          0         12
-------------+---------------------------------------------------------
     tmain91 |      7,153    7.212358    3.005039          1         13
  tmain22_91 |      7,153    4.418985    2.466138          0         13
     tmain92 |      7,153    7.598211    3.254992          1         14
  tmain22_92 |      7,153    4.804837    2.696929          0         14
     tmain93 |      7,153    7.761918     3.32268          1         15
-------------+---------------------------------------------------------
  tmain22_93 |      7,153    4.968545    2.760579          0         14
     tmain94 |      7,153    8.130295    3.550581          1         16
  tmain22_94 |      7,153    5.336922     2.98022          0         15

. summ jobsnum*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   jobsnum79 |     12,686    1.084818    1.122906          0          9
   jobsnum80 |     12,141    1.805041    1.601573          0         12
   jobsnum81 |     12,195    2.479049    1.985254          0         15
   jobsnum82 |     12,123    3.136187    2.328318          0         20
   jobsnum83 |     12,221    3.694706    2.625444          0         22
-------------+---------------------------------------------------------
   jobsnum84 |     12,067    4.288224    2.926266          0         25
   jobsnum85 |     10,892    5.028094    3.229669          0         26
   jobsnum86 |     10,653    5.628743    3.555719          0         32
   jobsnum87 |     10,483    6.176858    3.830557          0         34
   jobsnum88 |     10,461    6.805946    4.158983          0         36
-------------+---------------------------------------------------------
   jobsnum89 |     10,601    7.190925    4.356989          0         42
   jobsnum90 |     10,427    7.643618    4.598806          0         43
   jobsnum91 |      9,011    7.825103    4.697183          0         39
   jobsnum92 |      9,009    8.162948    4.879871          0         41
   jobsnum93 |      9,004    8.436362    5.057621          0         42
-------------+---------------------------------------------------------
   jobsnum94 |      8,882    8.798807    5.270431          0         44

. summ age79

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       age79 |     12,686    17.89816    2.305593         14         22

. 
. 
. * Defining self employed, and other non-standard emp, as well as possible. SE is 1 if a new job and cl
> ass of worker is SE. SE is also 1 if job 1 not new but was job 1 last int and was SE then.
. * Otherwise, missing them. Example, someone who was SE on job 2 last in, that moves up to job 1. 
. 
. gen selfemp79=.
(12,686 missing values generated)

. replace selfemp79=1 if emp1class_79==3 | emp1class_79==4 
(229 real changes made)

. 
. forvalues x = 80/93 {
  2. 
.    gen selfemp`x'=.   
  3.    local y = `x' - 1
  4.    replace selfemp`x'=1 if mainisnew`x'==1 & (emp1class_`x'==3 | emp1class_`x'==4) 
  5.    replace selfemp`x'=1 if mainisnew`x'==0 & selfemp`y'==1 & emp1previd`x'==1
  6.    
.    }
(12,686 missing values generated)
(56 real changes made)
(108 real changes made)
(12,686 missing values generated)
(37 real changes made)
(70 real changes made)
(12,686 missing values generated)
(30 real changes made)
(58 real changes made)
(12,686 missing values generated)
(25 real changes made)
(44 real changes made)
(12,686 missing values generated)
(24 real changes made)
(36 real changes made)
(12,686 missing values generated)
(11 real changes made)
(29 real changes made)
(12,686 missing values generated)
(8 real changes made)
(25 real changes made)
(12,686 missing values generated)
(9 real changes made)
(25 real changes made)
(12,686 missing values generated)
(6 real changes made)
(23 real changes made)
(12,686 missing values generated)
(3 real changes made)
(21 real changes made)
(12,686 missing values generated)
(3 real changes made)
(14 real changes made)
(12,686 missing values generated)
(4 real changes made)
(12 real changes made)
(12,686 missing values generated)
(3 real changes made)
(11 real changes made)
(12,686 missing values generated)
(0 real changes made)
(12 real changes made)

.    
. gen selfemp94=.
(12,686 missing values generated)

. replace selfemp94=1 if mainisnew94==1 & (emp1class_94==4 | emp1class_94==5) 
(1 real change made)

. replace selfemp94=1 if mainisnew94==0 & selfemp93==1 & emp1previd94==1
(11 real changes made)

. 
. summ selfemp*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   selfemp79 |        229           1           0          1          1
   selfemp80 |        164           1           0          1          1
   selfemp81 |        107           1           0          1          1
   selfemp82 |         88           1           0          1          1
   selfemp83 |         69           1           0          1          1
-------------+---------------------------------------------------------
   selfemp84 |         60           1           0          1          1
   selfemp85 |         40           1           0          1          1
   selfemp86 |         33           1           0          1          1
   selfemp87 |         34           1           0          1          1
   selfemp88 |         29           1           0          1          1
-------------+---------------------------------------------------------
   selfemp89 |         24           1           0          1          1
   selfemp90 |         17           1           0          1          1
   selfemp91 |         16           1           0          1          1
   selfemp92 |         14           1           0          1          1
   selfemp93 |         12           1           0          1          1
-------------+---------------------------------------------------------
   selfemp94 |         12           1           0          1          1

. 
. 
. * Indicator for voluntary, involuntary separation from last job 1 employer. 
. 
. gen whyleft01_79=.
(12,686 missing values generated)

. 
. forvalues x = 80/94 {
  2. 
.    gen whyleft01_`x'=.
  3.    replace whyleft01_`x'=QES23A01_`x' if QES23A01_`x' > 0
  4.    replace whyleft01_`x'=QES23A02_`x' if emp2previd`x'==1 & QES23A02_`x' > 0
  5.    replace whyleft01_`x'=QES23A03_`x' if emp3previd`x'==1 & QES23A03_`x' > 0
  6.    replace whyleft01_`x'=QES23A04_`x' if emp4previd`x'==1 & QES23A04_`x' > 0
  7.    replace whyleft01_`x'=QES23A05_`x' if emp5previd`x'==1 & QES23A05_`x' > 0
  8. }   
(12,686 missing values generated)
(2,934 real changes made)
(1,156 real changes made)
(504 real changes made)
(166 real changes made)
(48 real changes made)
(12,686 missing values generated)
(2,874 real changes made)
(1,336 real changes made)
(509 real changes made)
(156 real changes made)
(53 real changes made)
(12,686 missing values generated)
(2,811 real changes made)
(1,355 real changes made)
(574 real changes made)
(172 real changes made)
(37 real changes made)
(12,686 missing values generated)
(2,613 real changes made)
(1,256 real changes made)
(491 real changes made)
(136 real changes made)
(48 real changes made)
(12,686 missing values generated)
(2,129 real changes made)
(1,409 real changes made)
(558 real changes made)
(155 real changes made)
(39 real changes made)
(12,686 missing values generated)
(1,783 real changes made)
(1,437 real changes made)
(494 real changes made)
(159 real changes made)
(44 real changes made)
(12,686 missing values generated)
(1,514 real changes made)
(1,534 real changes made)
(546 real changes made)
(159 real changes made)
(47 real changes made)
(12,686 missing values generated)
(1,256 real changes made)
(1,592 real changes made)
(552 real changes made)
(136 real changes made)
(51 real changes made)
(12,686 missing values generated)
(1,234 real changes made)
(1,513 real changes made)
(655 real changes made)
(199 real changes made)
(52 real changes made)
(12,686 missing values generated)
(1,100 real changes made)
(1,365 real changes made)
(462 real changes made)
(110 real changes made)
(23 real changes made)
(12,686 missing values generated)
(1,013 real changes made)
(1,357 real changes made)
(439 real changes made)
(97 real changes made)
(28 real changes made)
(12,686 missing values generated)
(902 real changes made)
(1,005 real changes made)
(266 real changes made)
(57 real changes made)
(16 real changes made)
(12,686 missing values generated)
(872 real changes made)
(944 real changes made)
(241 real changes made)
(55 real changes made)
(13 real changes made)
(12,686 missing values generated)
(762 real changes made)
(865 real changes made)
(260 real changes made)
(78 real changes made)
(10 real changes made)
(12,686 missing values generated)
(761 real changes made)
(909 real changes made)
(306 real changes made)
(98 real changes made)
(23 real changes made)

.    
. *** Recode reason for leaving into invol, vol, and missing - any reason with word quit in title is vol
> , others invol
. 
. foreach x of numlist 79/83 {
  2.    gen invol`x'=.
  3.    replace invol`x'=1 if whyleft01_`x'>=0 & whyleft01_`x'< 4
  4.    replace invol`x'=0 if whyleft01_`x'>= 4 & whyleft01_`x' < 99
  5.    }
(12,686 missing values generated)
(0 real changes made)
(0 real changes made)
(12,686 missing values generated)
(1,554 real changes made)
(2,960 real changes made)
(12,686 missing values generated)
(1,708 real changes made)
(2,931 real changes made)
(12,686 missing values generated)
(1,758 real changes made)
(2,906 real changes made)
(12,686 missing values generated)
(1,779 real changes made)
(2,496 real changes made)

. 
. foreach x of numlist 84/94 {
  2.    gen invol`x'=.
  3.    replace invol`x'=1 if whyleft01_`x'>=0 & whyleft01_`x'< 6
  4.    replace invol`x'=0 if whyleft01_`x'>= 6 & whyleft01_`x' < 99
  5.    }
(12,686 missing values generated)
(1,501 real changes made)
(2,555 real changes made)
(12,686 missing values generated)
(1,230 real changes made)
(2,475 real changes made)
(12,686 missing values generated)
(1,149 real changes made)
(2,465 real changes made)
(12,686 missing values generated)
(994 real changes made)
(2,412 real changes made)
(12,686 missing values generated)
(931 real changes made)
(2,558 real changes made)
(12,686 missing values generated)
(867 real changes made)
(2,068 real changes made)
(12,686 missing values generated)
(803 real changes made)
(1,982 real changes made)
(12,686 missing values generated)
(726 real changes made)
(1,389 real changes made)
(12,686 missing values generated)
(710 real changes made)
(1,315 real changes made)
(12,686 missing values generated)
(643 real changes made)
(1,252 real changes made)
(12,686 missing values generated)
(639 real changes made)
(1,356 real changes made)

. 
. tab1 invol*

-> tabulation of invol79  
no observations

-> tabulation of invol80  

    invol80 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,960       65.57       65.57
          1 |      1,554       34.43      100.00
------------+-----------------------------------
      Total |      4,514      100.00

-> tabulation of invol81  

    invol81 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,931       63.18       63.18
          1 |      1,708       36.82      100.00
------------+-----------------------------------
      Total |      4,639      100.00

-> tabulation of invol82  

    invol82 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,906       62.31       62.31
          1 |      1,758       37.69      100.00
------------+-----------------------------------
      Total |      4,664      100.00

-> tabulation of invol83  

    invol83 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,496       58.39       58.39
          1 |      1,779       41.61      100.00
------------+-----------------------------------
      Total |      4,275      100.00

-> tabulation of invol84  

    invol84 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,555       62.99       62.99
          1 |      1,501       37.01      100.00
------------+-----------------------------------
      Total |      4,056      100.00

-> tabulation of invol85  

    invol85 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,475       66.80       66.80
          1 |      1,230       33.20      100.00
------------+-----------------------------------
      Total |      3,705      100.00

-> tabulation of invol86  

    invol86 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,465       68.21       68.21
          1 |      1,149       31.79      100.00
------------+-----------------------------------
      Total |      3,614      100.00

-> tabulation of invol87  

    invol87 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,412       70.82       70.82
          1 |        994       29.18      100.00
------------+-----------------------------------
      Total |      3,406      100.00

-> tabulation of invol88  

    invol88 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,558       73.32       73.32
          1 |        931       26.68      100.00
------------+-----------------------------------
      Total |      3,489      100.00

-> tabulation of invol89  

    invol89 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,068       70.46       70.46
          1 |        867       29.54      100.00
------------+-----------------------------------
      Total |      2,935      100.00

-> tabulation of invol90  

    invol90 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,982       71.17       71.17
          1 |        803       28.83      100.00
------------+-----------------------------------
      Total |      2,785      100.00

-> tabulation of invol91  

    invol91 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,389       65.67       65.67
          1 |        726       34.33      100.00
------------+-----------------------------------
      Total |      2,115      100.00

-> tabulation of invol92  

    invol92 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,315       64.94       64.94
          1 |        710       35.06      100.00
------------+-----------------------------------
      Total |      2,025      100.00

-> tabulation of invol93  

    invol93 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,252       66.07       66.07
          1 |        643       33.93      100.00
------------+-----------------------------------
      Total |      1,895      100.00

-> tabulation of invol94  

    invol94 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,356       67.97       67.97
          1 |        639       32.03      100.00
------------+-----------------------------------
      Total |      1,995      100.00

. summ invol* tenuremon*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     invol79 |          0
     invol80 |      4,514    .3442623    .4751797          0          1
     invol81 |      4,639    .3681828    .4823633          0          1
     invol82 |      4,664    .3769297     .484669          0          1
     invol83 |      4,275    .4161404    .4929751          0          1
-------------+---------------------------------------------------------
     invol84 |      4,056     .370069    .4828824          0          1
     invol85 |      3,705    .3319838    .4709888          0          1
     invol86 |      3,614    .3179303    .4657367          0          1
     invol87 |      3,406    .2918379    .4546749          0          1
     invol88 |      3,489    .2668386    .4423707          0          1
-------------+---------------------------------------------------------
     invol89 |      2,935    .2954003    .4563003          0          1
     invol90 |      2,785    .2883303    .4530669          0          1
     invol91 |      2,115    .3432624    .4749105          0          1
     invol92 |      2,025    .3506173    .4772812          0          1
     invol93 |      1,895     .339314    .4736015          0          1
-------------+---------------------------------------------------------
     invol94 |      1,995    .3203008    .4667091          0          1
tenuremon~79 |      5,119    8.589838     7.71795    .230787    110.547
tenuremon~80 |      8,475     8.93629    9.013835    .230787   121.6247
tenuremon~81 |      9,130    11.53467    11.64618    .230787   133.8564
tenuremon~82 |      9,397    13.74073    14.11418    .230787    146.319
-------------+---------------------------------------------------------
tenuremon~83 |      9,447    16.85808    16.99421    .230787   158.3199
tenuremon~84 |      9,561    19.05119    19.92111    .230787   171.0132
tenuremon~85 |      9,013    21.64891    23.12271    .230787   182.3217
tenuremon~86 |      8,920     24.4598    26.07412    .230787   149.3192
tenuremon~87 |      8,893    28.11353    29.17702    .230787   161.5509
-------------+---------------------------------------------------------
tenuremon~88 |      9,010    30.85274    32.57833    .230787   180.2446
tenuremon~89 |      8,989    34.17886    35.49745    .230787   189.0145
tenuremon~90 |      8,871    37.65959    38.76542    .230787    201.477
tenuremon~91 |      7,554    41.97534    41.53228    .230787   212.7856
tenuremon~92 |      7,558    46.07318    44.95803    .230787   225.2481
-------------+---------------------------------------------------------
tenuremon~93 |      7,471    50.27771    47.90149    .230787   236.0951
tenuremon~94 |      7,469    53.44132    51.45268    .230787   241.4032

. 
. forvalues x = 79/94 {
  2.    tabulate mainisnew`x' invol`x'
  3. }
no observations

mainisnew8 |        invol80
         0 |         0          1 |     Total
-----------+----------------------+----------
         0 |       466        205 |       671 
         1 |     2,494      1,349 |     3,843 
-----------+----------------------+----------
     Total |     2,960      1,554 |     4,514 

mainisnew8 |        invol81
         1 |         0          1 |     Total
-----------+----------------------+----------
         0 |       559        276 |       835 
         1 |     2,372      1,432 |     3,804 
-----------+----------------------+----------
     Total |     2,931      1,708 |     4,639 

mainisnew8 |        invol82
         2 |         0          1 |     Total
-----------+----------------------+----------
         0 |       539        322 |       861 
         1 |     2,367      1,436 |     3,803 
-----------+----------------------+----------
     Total |     2,906      1,758 |     4,664 

mainisnew8 |        invol83
         3 |         0          1 |     Total
-----------+----------------------+----------
         0 |       530        394 |       924 
         1 |     1,966      1,385 |     3,351 
-----------+----------------------+----------
     Total |     2,496      1,779 |     4,275 

mainisnew8 |        invol84
         4 |         0          1 |     Total
-----------+----------------------+----------
         0 |       431        242 |       673 
         1 |     2,124      1,259 |     3,383 
-----------+----------------------+----------
     Total |     2,555      1,501 |     4,056 

mainisnew8 |        invol85
         5 |         0          1 |     Total
-----------+----------------------+----------
         0 |       394        232 |       626 
         1 |     2,081        998 |     3,079 
-----------+----------------------+----------
     Total |     2,475      1,230 |     3,705 

mainisnew8 |        invol86
         6 |         0          1 |     Total
-----------+----------------------+----------
         0 |       396        229 |       625 
         1 |     2,069        920 |     2,989 
-----------+----------------------+----------
     Total |     2,465      1,149 |     3,614 

mainisnew8 |        invol87
         7 |         0          1 |     Total
-----------+----------------------+----------
         0 |       390        193 |       583 
         1 |     2,022        801 |     2,823 
-----------+----------------------+----------
     Total |     2,412        994 |     3,406 

mainisnew8 |        invol88
         8 |         0          1 |     Total
-----------+----------------------+----------
         0 |       379        153 |       532 
         1 |     2,179        778 |     2,957 
-----------+----------------------+----------
     Total |     2,558        931 |     3,489 

mainisnew8 |        invol89
         9 |         0          1 |     Total
-----------+----------------------+----------
         0 |       399        193 |       592 
         1 |     1,669        674 |     2,343 
-----------+----------------------+----------
     Total |     2,068        867 |     2,935 

mainisnew9 |        invol90
         0 |         0          1 |     Total
-----------+----------------------+----------
         0 |       331        174 |       505 
         1 |     1,650        629 |     2,279 
-----------+----------------------+----------
     Total |     1,981        803 |     2,784 

mainisnew9 |        invol91
         1 |         0          1 |     Total
-----------+----------------------+----------
         0 |       306        249 |       555 
         1 |     1,083        477 |     1,560 
-----------+----------------------+----------
     Total |     1,389        726 |     2,115 

mainisnew9 |        invol92
         2 |         0          1 |     Total
-----------+----------------------+----------
         0 |       284        203 |       487 
         1 |     1,031        507 |     1,538 
-----------+----------------------+----------
     Total |     1,315        710 |     2,025 

mainisnew9 |        invol93
         3 |         0          1 |     Total
-----------+----------------------+----------
         0 |       345        247 |       592 
         1 |       746        278 |     1,024 
-----------+----------------------+----------
     Total |     1,091        525 |     1,616 

mainisnew9 |        invol94
         4 |         0          1 |     Total
-----------+----------------------+----------
         0 |       331        197 |       528 
         1 |     1,025        442 |     1,467 
-----------+----------------------+----------
     Total |     1,356        639 |     1,995 

. 
. sort caseid

. save nlsy79_tenure_plus_whyleft.dta, replace
file nlsy79_tenure_plus_whyleft.dta saved

. 
. * Note: QES2301_ is "are you currently employed at job 1", QES23A01_ is "if not, why did you leave" - 
> recoded into whyleft01_ above.   
. 
. keep tenuremon1* prevtenuremon1* hgcrev* QES2301_* QES2302_* esr_key* black hisp female age79 edgrp4* 
> wkswk_pcy* job1iscps* invol* mainisnew* whyleft01_* emp1previd* caseid custwt inschool_* selfemp* prev
> empd1* tmain* jobsnum* continuous

. reshape long tenuremon1_ prevtenuremon1_ hgcrev QES2301_ QES2302_ esr_key edgrp4_ wkswk_pcy job1iscps 
> invol mainisnew whyleft01_ emp1previd inschool_ selfemp prevempd1_ tmain tmain22_ jobsnum, i(caseid) j
> (year)
(note: j = 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94)
(note: job1iscps79 not found)
(note: emp1previd79 not found)
(note: prevempd1_79 not found)
(note: job1iscps94 not found)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    12686   ->  202976
Number of variables                 320   ->      40
j variable (16 values)                    ->   year
xij variables:
tenuremon1_79 tenuremon1_80 ... tenuremon1_94->tenuremon1_
prevtenuremon1_79 prevtenuremon1_80 ... prevtenuremon1_94->prevtenuremon1_
         hgcrev79 hgcrev80 ... hgcrev94   ->   hgcrev
   QES2301_79 QES2301_80 ... QES2301_94   ->   QES2301_
   QES2302_79 QES2302_80 ... QES2302_94   ->   QES2302_
      esr_key79 esr_key80 ... esr_key94   ->   esr_key
      edgrp4_79 edgrp4_80 ... edgrp4_94   ->   edgrp4_
wkswk_pcy79 wkswk_pcy80 ... wkswk_pcy94   ->   wkswk_pcy
job1iscps79 job1iscps80 ... job1iscps94   ->   job1iscps
            invol79 invol80 ... invol94   ->   invol
mainisnew79 mainisnew80 ... mainisnew94   ->   mainisnew
whyleft01_79 whyleft01_80 ... whyleft01_94->   whyleft01_
emp1previd79 emp1previd80 ... emp1previd94->   emp1previd
inschool_79 inschool_80 ... inschool_94   ->   inschool_
      selfemp79 selfemp80 ... selfemp94   ->   selfemp
prevempd1_79 prevempd1_80 ... prevempd1_94->   prevempd1_
            tmain79 tmain80 ... tmain94   ->   tmain
   tmain22_79 tmain22_80 ... tmain22_94   ->   tmain22_
      jobsnum79 jobsnum80 ... jobsnum94   ->   jobsnum
-----------------------------------------------------------------------------

. 
. 
. summ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      caseid |    202,976      6343.5    3662.142          1      12686
        year |    202,976        86.5    4.609784         79         94
       age79 |    202,976    17.89816    2.305508         14         22
emp1previ~80 |    202,976   -3.844632    1.118716         -5          7
emp1previ~81 |    202,976   -3.833833    1.078862         -5          8
-------------+---------------------------------------------------------
emp1previ~82 |    202,976   -3.843922    1.063751         -5          9
emp1previ~83 |    202,976    -3.83533    1.060189         -5          6
emp1previ~84 |    202,976    -3.86292    1.026478         -5          7
emp1previ~85 |    202,976   -4.001498    .9616249         -5          5
emp1previ~86 |    202,976   -4.030112     .945652         -5          6
-------------+---------------------------------------------------------
emp1previ~87 |    202,976   -4.059672    .9104591         -5          6
emp1previ~88 |    202,976      -4.086    .8286613         -5          5
emp1previ~89 |    202,976   -4.065505    .8572479         -5          5
emp1previ~90 |    202,976   -4.098376    .7861958         -5          4
emp1previ~91 |    202,976    -4.22781    .7665184         -5          5
-------------+---------------------------------------------------------
emp1previ~92 |    202,976   -4.207079    .8411163         -5          5
   inschool_ |    202,976   -2.964419    2.150178         -5          1
  emp1previd |    190,290   -2.223039    2.581033         -5          8
    QES2301_ |    202,976   -.9027028    2.508182         -5          1
    QES2302_ |    202,976   -2.985392    1.997258         -5          1
-------------+---------------------------------------------------------
     esr_key |    202,976    1.306859    3.269844         -5          8
   wkswk_pcy |    202,976    26.56436    23.97487         -5        124
     jobsnum |    172,856    5.239049    4.350568          0         44
      hgcrev |    172,556    12.25166    2.338165         -3         20
      custwt |    202,976    264539.7    214412.7       6893    1058864
-------------+---------------------------------------------------------
 tenuremon1_ |    134,877    27.56763     33.7927    .230787   241.4032
       black |    202,976    .2501971    .4331275          0          1
        hisp |    202,976    .1578118    .3645653          0          1
      female |    202,976    .4952704    .4999789          0          1
     edgrp4_ |    202,951    2.187045    .9318502          1          4
-------------+---------------------------------------------------------
  continuous |    202,976    .5638499    .4959077          0          1
prevtenur~1_ |    127,408    26.05084    31.81459    .230787   236.0951
  prevempd1_ |    163,996    .6402534    .4799275          0          1
   mainisnew |    158,496     .554096    .4970666          0          1
       tmain |    114,448    4.869076    3.237725          0         16
-------------+---------------------------------------------------------
    tmain22_ |    114,448    2.478532    2.594495          0         15
     selfemp |        948           1           0          1          1
  whyleft01_ |     50,112    5.036219    2.443059          1          9
       invol |     50,112    .3390805    .4734019          0          1
   job1iscps |    177,604   -.6677609    2.499353         -5          1

. 
. gen age = age79 + (year - 79)

. gen age2 = age^2 

. 
. char edgrp4_[omit] 2

. xi, prefix(_Y) i.year
i.year            _Yyear_79-94        (naturally coded; _Yyear_79 omitted)

. xi, prefix(_E) i.edgrp4_
i.edgrp4_         _Eedgrp4__1-4       (naturally coded; _Eedgrp4__2 omitted)

. 
. *gen lnrhw=ln(rcpshrp)
. 
. 
. *** Create estimating samples - drop if in armed forces, currently enrolled in regular school, or curr
> ently self-employed in job1
. *** Retaining those where job 1 is not CPS job. This was used in BPEA analysis as an indicator for whe
> ther job 1 was main job. Didn't want to code someone as job switcher just because main job switched or
> der in job numbers.
. *** Per emails with Steve McClaskie at CHRR, seems like most job 1s are main employer, current or past
> , in those years, so eliminating the job1iscps restriction.
. *** Consistent with this, emp1previd above is greater than 1 for less than 1% of obs per year. So eith
> er employer 1 is new or was job 1 in previous survey round.  
. 
. *drop if job1iscps~=1
. drop if esr_key==8
(7,837 observations deleted)

. drop if inschool_==1
(32,401 observations deleted)

. drop if selfemp==1
(584 observations deleted)

. 
. * bys year: tab1 whyleft01*
. * bys job1iscps: tab1 esr_key whyleft01_
. * bys year: tab1 job1iscps
. * bys year: tab1 whyleft01_ if job1iscps==1
. 
. gen ptencat=.
(162,154 missing values generated)

. replace ptencat=1 if prevtenuremon1_ > 0 & prevtenuremon1_ < 12
(47,867 real changes made)

. replace ptencat=2 if prevtenuremon1_ >= 12 & prevtenuremon1_ < 36
(31,880 real changes made)

. replace ptencat=3 if prevtenuremon1_ >= 36 & prevtenuremon1_ < 60
(13,597 real changes made)

. replace ptencat=4 if prevtenuremon1_ >= 60 & prevtenuremon1_ < 120
(12,441 real changes made)

. replace ptencat=5 if prevtenuremon1_ >= 120 & prevtenuremon1_~=.
(3,112 real changes made)

. 
. gen tencat=.
(162,154 missing values generated)

. replace tencat=1 if tenuremon1_ > 0 & tenuremon1_ < 12
(46,603 real changes made)

. replace tencat=2 if tenuremon1_ >= 12 & tenuremon1_ < 36
(32,134 real changes made)

. replace tencat=3 if tenuremon1_ >= 36 & tenuremon1_ < 60
(14,334 real changes made)

. replace tencat=4 if tenuremon1_ >= 60 & tenuremon1_ < 120
(14,019 real changes made)

. replace tencat=5 if tenuremon1_ >= 120 & tenuremon1_~=.
(4,005 real changes made)

. 
. /**
> 
> * Previous coding breaking up less than one year of tenure.
> gen ptencat=.
> replace ptencat=1 if prevtenuremon1_ > 0 & prevtenuremon1_ < 3
> replace ptencat=2 if prevtenuremon1_ >= 3 & prevtenuremon1_ < 12
> replace ptencat=3 if prevtenuremon1_ >= 12 & prevtenuremon1_ < 36
> replace ptencat=4 if prevtenuremon1_ >= 36 & prevtenuremon1_ < 60
> replace ptencat=5 if prevtenuremon1_ >= 60 & prevtenuremon1_ < 120
> replace ptencat=6 if prevtenuremon1_ >= 120 & prevtenuremon1_~=.
> 
> gen tencat=.
> replace tencat=1 if tenuremon1_ > 0 & tenuremon1_ < 3
> replace tencat=2 if tenuremon1_ >= 3 & tenuremon1_ < 12
> replace tencat=3 if tenuremon1_ >= 12 & tenuremon1_ < 36
> replace tencat=4 if tenuremon1_ >= 36 & tenuremon1_ < 60
> replace tencat=5 if tenuremon1_ >= 60 & tenuremon1_ < 120
> replace tencat=6 if tenuremon1_ >= 120 & tenuremon1_~=.
> 
> label define ptencatlbl 1 "Less than 1Q" 2 "1Q to less than 1Y" 3 "1Y to less than 3Y" 4 "3Y to less t
> han 5Y" 5 "5Y to less than 10Y" 6 "10Y and up"
> 
> **/
. 
. label define ptencatlbl 1 "Less than 1Y" 2 "1Y to less than 3Y" 3 "3Y to less than 5Y" 4 "5Y to less t
> han 10Y" 5 "10Y and up"

. label values ptencat ptencatlbl

. label values tencat ptencatlbl 

. 
. * Small numbers of obs in 10+ years cat
. tab1 ptencat

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     47,867       43.96       43.96
 1Y to less than 3Y |     31,880       29.28       73.23
 3Y to less than 5Y |     13,597       12.49       85.72
5Y to less than 10Y |     12,441       11.42       97.14
         10Y and up |      3,112        2.86      100.00
--------------------+-----------------------------------
              Total |    108,897      100.00

. bys year: tab1 ptencat

--------------------------------------------------------------------------------------------------------
-> year = 79

-> tabulation of ptencat  
no observations

--------------------------------------------------------------------------------------------------------
-> year = 80

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,039       67.85       67.85
 1Y to less than 3Y |        931       30.98       98.84
 3Y to less than 5Y |         31        1.03       99.87
5Y to less than 10Y |          4        0.13      100.00
--------------------+-----------------------------------
              Total |      3,005      100.00

--------------------------------------------------------------------------------------------------------
-> year = 81

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,690       70.65       70.65
 1Y to less than 3Y |      1,486       28.45       99.10
 3Y to less than 5Y |         37        0.71       99.81
5Y to less than 10Y |         10        0.19      100.00
--------------------+-----------------------------------
              Total |      5,223      100.00

--------------------------------------------------------------------------------------------------------
-> year = 82

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,894       62.31       62.31
 1Y to less than 3Y |      1,918       30.69       93.01
 3Y to less than 5Y |        419        6.71       99.71
5Y to less than 10Y |         18        0.29      100.00
--------------------+-----------------------------------
              Total |      6,249      100.00

--------------------------------------------------------------------------------------------------------
-> year = 83

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,153       58.53       58.53
 1Y to less than 3Y |      2,201       31.02       89.54
 3Y to less than 5Y |        718       10.12       99.66
5Y to less than 10Y |         24        0.34      100.00
--------------------+-----------------------------------
              Total |      7,096      100.00

--------------------------------------------------------------------------------------------------------
-> year = 84

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,915       51.74       51.74
 1Y to less than 3Y |      2,442       32.27       84.01
 3Y to less than 5Y |        931       12.30       96.31
5Y to less than 10Y |        279        3.69      100.00
--------------------+-----------------------------------
              Total |      7,567      100.00

--------------------------------------------------------------------------------------------------------
-> year = 85

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,229       51.42       51.42
 1Y to less than 3Y |      2,398       29.16       80.58
 3Y to less than 5Y |      1,081       13.14       93.73
5Y to less than 10Y |        514        6.25       99.98
         10Y and up |          2        0.02      100.00
--------------------+-----------------------------------
              Total |      8,224      100.00

--------------------------------------------------------------------------------------------------------
-> year = 86

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,874       48.98       48.98
 1Y to less than 3Y |      2,213       27.98       76.95
 3Y to less than 5Y |      1,037       13.11       90.06
5Y to less than 10Y |        778        9.84       99.90
         10Y and up |          8        0.10      100.00
--------------------+-----------------------------------
              Total |      7,910      100.00

--------------------------------------------------------------------------------------------------------
-> year = 87

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,713       45.23       45.23
 1Y to less than 3Y |      2,453       29.88       75.10
 3Y to less than 5Y |      1,020       12.42       87.53
5Y to less than 10Y |      1,012       12.33       99.85
         10Y and up |         12        0.15      100.00
--------------------+-----------------------------------
              Total |      8,210      100.00

--------------------------------------------------------------------------------------------------------
-> year = 88

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,269       39.15       39.15
 1Y to less than 3Y |      2,699       32.33       71.48
 3Y to less than 5Y |      1,086       13.01       84.49
5Y to less than 10Y |      1,277       15.30       99.78
         10Y and up |         18        0.22      100.00
--------------------+-----------------------------------
              Total |      8,349      100.00

--------------------------------------------------------------------------------------------------------
-> year = 89

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,254       38.11       38.11
 1Y to less than 3Y |      2,576       30.17       68.27
 3Y to less than 5Y |      1,223       14.32       82.60
5Y to less than 10Y |      1,286       15.06       97.66
         10Y and up |        200        2.34      100.00
--------------------+-----------------------------------
              Total |      8,539      100.00

--------------------------------------------------------------------------------------------------------
-> year = 90

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,057       35.87       35.87
 1Y to less than 3Y |      2,494       29.27       65.14
 3Y to less than 5Y |      1,279       15.01       80.15
5Y to less than 10Y |      1,352       15.86       96.01
         10Y and up |        340        3.99      100.00
--------------------+-----------------------------------
              Total |      8,522      100.00

--------------------------------------------------------------------------------------------------------
-> year = 91

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,818       33.11       33.11
 1Y to less than 3Y |      2,432       28.57       61.68
 3Y to less than 5Y |      1,299       15.26       76.95
5Y to less than 10Y |      1,456       17.11       94.05
         10Y and up |        506        5.95      100.00
--------------------+-----------------------------------
              Total |      8,511      100.00

--------------------------------------------------------------------------------------------------------
-> year = 92

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,089       29.15       29.15
 1Y to less than 3Y |      2,027       28.28       57.43
 3Y to less than 5Y |      1,177       16.42       73.85
5Y to less than 10Y |      1,318       18.39       92.24
         10Y and up |        556        7.76      100.00
--------------------+-----------------------------------
              Total |      7,167      100.00

--------------------------------------------------------------------------------------------------------
-> year = 93

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,978       27.65       27.65
 1Y to less than 3Y |      1,890       26.42       54.07
 3Y to less than 5Y |      1,126       15.74       69.81
5Y to less than 10Y |      1,479       20.67       90.48
         10Y and up |        681        9.52      100.00
--------------------+-----------------------------------
              Total |      7,154      100.00

--------------------------------------------------------------------------------------------------------
-> year = 94

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,895       26.43       26.43
 1Y to less than 3Y |      1,720       23.99       50.41
 3Y to less than 5Y |      1,133       15.80       66.21
5Y to less than 10Y |      1,634       22.79       89.00
         10Y and up |        789       11.00      100.00
--------------------+-----------------------------------
              Total |      7,171      100.00

. 
. * Among those with obs on invol, what is share invol across prev tenure categories?
. tabulate ptencat, summarize(invol)

            |          Summary of invol
    ptencat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Less than |    .3454185   .47551575      21,183
  1Y to les |      .29523   .45617031       9,413
  3Y to les |   .28804982   .45294258       2,569
  5Y to les |   .27567568   .44700515       1,480
  10Y and u |   .30845771   .46300984         201
------------+------------------------------------
      Total |   .32445618   .46817802      34,846

. tabulate ptencat if age >=22, summarize(invol)

            |          Summary of invol
    ptencat |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Less than |   .33563204   .47222588      15,806
  1Y to les |   .29131759   .45439835       7,878
  3Y to les |   .28946289   .45360609       2,439
  5Y to les |   .27562797   .44698191       1,473
  10Y and u |   .30845771   .46300984         201
------------+------------------------------------
      Total |   .31564557   .46478083      27,797

. 
. gen empd=.
(162,154 missing values generated)

. replace empd=1 if QES2301_==1
(95,245 real changes made)

. replace empd=0 if QES2301_==0 | QES2301_==-4
(36,825 real changes made)

. summ empd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |    132,070    .7211706    .4484251          0          1

. 
. gen empd2=.
(162,154 missing values generated)

. replace empd2=1 if QES2302_==1
(7,456 real changes made)

. replace empd2=0 if QES2302_==0 | QES2302_==-4
(124,598 real changes made)

. summ empd2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       empd2 |    132,054    .0564618    .2308121          0          1

. 
. * Drop multiple job holders
. drop if empd2==1 & empd==1
(7,386 observations deleted)

. 
. 
. bys year: tab1 ptencat whyleft01_

--------------------------------------------------------------------------------------------------------
-> year = 79

-> tabulation of ptencat  
no observations

-> tabulation of whyleft01_  
no observations

--------------------------------------------------------------------------------------------------------
-> year = 80

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,971       67.92       67.92
 1Y to less than 3Y |        898       30.94       98.86
 3Y to less than 5Y |         29        1.00       99.86
5Y to less than 10Y |          4        0.14      100.00
--------------------+-----------------------------------
              Total |      2,902      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        402       18.99       18.99
          2 |        137        6.47       25.46
          3 |        132        6.24       31.70
          4 |        145        6.85       38.55
          5 |      1,153       54.46       93.01
          6 |        148        6.99      100.00
------------+-----------------------------------
      Total |      2,117      100.00

--------------------------------------------------------------------------------------------------------
-> year = 81

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,582       70.83       70.83
 1Y to less than 3Y |      1,428       28.24       99.07
 3Y to less than 5Y |         37        0.73       99.80
5Y to less than 10Y |         10        0.20      100.00
--------------------+-----------------------------------
              Total |      5,057      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        559       22.03       22.03
          2 |        194        7.64       29.67
          3 |        169        6.66       36.33
          4 |        189        7.45       43.77
          5 |      1,427       56.23      100.00
------------+-----------------------------------
      Total |      2,538      100.00

--------------------------------------------------------------------------------------------------------
-> year = 82

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,764       62.72       62.72
 1Y to less than 3Y |      1,829       30.48       93.20
 3Y to less than 5Y |        391        6.52       99.72
5Y to less than 10Y |         17        0.28      100.00
--------------------+-----------------------------------
              Total |      6,001      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        738       25.29       25.29
          2 |        199        6.82       32.11
          3 |        174        5.96       38.07
          4 |        193        6.61       44.69
          5 |      1,614       55.31      100.00
------------+-----------------------------------
      Total |      2,918      100.00

--------------------------------------------------------------------------------------------------------
-> year = 83

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,966       58.77       58.77
 1Y to less than 3Y |      2,085       30.90       89.67
 3Y to less than 5Y |        673        9.97       99.64
5Y to less than 10Y |         24        0.36      100.00
--------------------+-----------------------------------
              Total |      6,748      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        930       31.18       31.18
          2 |        229        7.68       38.85
          3 |        165        5.53       44.38
          4 |        200        6.70       51.09
          5 |      1,459       48.91      100.00
------------+-----------------------------------
      Total |      2,983      100.00

--------------------------------------------------------------------------------------------------------
-> year = 84

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,742       52.18       52.18
 1Y to less than 3Y |      2,299       32.06       84.23
 3Y to less than 5Y |        870       12.13       96.36
5Y to less than 10Y |        261        3.64      100.00
--------------------+-----------------------------------
              Total |      7,172      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        426       14.01       14.01
          2 |         75        2.47       16.48
          3 |        313       10.30       26.78
          4 |        192        6.32       33.09
          5 |        115        3.78       36.88
          6 |        201        6.61       43.49
          7 |      1,718       56.51      100.00
------------+-----------------------------------
      Total |      3,040      100.00

--------------------------------------------------------------------------------------------------------
-> year = 85

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      4,026       51.81       51.81
 1Y to less than 3Y |      2,247       28.92       80.72
 3Y to less than 5Y |      1,016       13.07       93.80
5Y to less than 10Y |        480        6.18       99.97
         10Y and up |          2        0.03      100.00
--------------------+-----------------------------------
              Total |      7,771      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        398       13.41       13.41
          2 |         81        2.73       16.14
          3 |        290        9.77       25.92
          4 |        151        5.09       31.01
          5 |         75        2.53       33.54
          6 |        190        6.40       39.94
          7 |      1,782       60.06      100.00
------------+-----------------------------------
      Total |      2,967      100.00

--------------------------------------------------------------------------------------------------------
-> year = 86

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,668       49.45       49.45
 1Y to less than 3Y |      2,046       27.58       77.03
 3Y to less than 5Y |        961       12.95       89.98
5Y to less than 10Y |        735        9.91       99.89
         10Y and up |          8        0.11      100.00
--------------------+-----------------------------------
              Total |      7,418      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        391       13.06       13.06
          2 |         88        2.94       15.99
          3 |        246        8.21       24.21
          4 |        193        6.44       30.65
          5 |         59        1.97       32.62
          6 |        201        6.71       39.33
          7 |      1,817       60.67      100.00
------------+-----------------------------------
      Total |      2,995      100.00

--------------------------------------------------------------------------------------------------------
-> year = 87

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,514       45.63       45.63
 1Y to less than 3Y |      2,277       29.57       75.20
 3Y to less than 5Y |        944       12.26       87.46
5Y to less than 10Y |        954       12.39       99.84
         10Y and up |         12        0.16      100.00
--------------------+-----------------------------------
              Total |      7,701      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        340       11.44       11.44
          2 |        100        3.37       14.81
          3 |        218        7.34       22.15
          4 |        169        5.69       27.84
          5 |         44        1.48       29.32
          6 |        249        8.38       37.70
          7 |      1,851       62.30      100.00
------------+-----------------------------------
      Total |      2,971      100.00

--------------------------------------------------------------------------------------------------------
-> year = 88

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,052       39.52       39.52
 1Y to less than 3Y |      2,483       32.15       71.68
 3Y to less than 5Y |        986       12.77       84.45
5Y to less than 10Y |      1,183       15.32       99.77
         10Y and up |         18        0.23      100.00
--------------------+-----------------------------------
              Total |      7,722      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        284        9.23        9.23
          2 |         79        2.57       11.79
          3 |        234        7.60       19.40
          4 |        182        5.91       25.31
          5 |         60        1.95       27.26
          6 |        256        8.32       35.58
          7 |      1,983       64.42      100.00
------------+-----------------------------------
      Total |      3,078      100.00

--------------------------------------------------------------------------------------------------------
-> year = 89

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      3,024       38.23       38.23
 1Y to less than 3Y |      2,386       30.16       68.39
 3Y to less than 5Y |      1,123       14.20       82.58
5Y to less than 10Y |      1,192       15.07       97.65
         10Y and up |        186        2.35      100.00
--------------------+-----------------------------------
              Total |      7,911      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        276       10.43       10.43
          2 |         80        3.02       13.45
          3 |        221        8.35       21.80
          4 |        166        6.27       28.07
          5 |         34        1.28       29.35
          6 |        209        7.90       37.25
          7 |      1,661       62.75      100.00
------------+-----------------------------------
      Total |      2,647      100.00

--------------------------------------------------------------------------------------------------------
-> year = 90

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,859       36.32       36.32
 1Y to less than 3Y |      2,287       29.05       65.37
 3Y to less than 5Y |      1,164       14.79       80.16
5Y to less than 10Y |      1,243       15.79       95.95
         10Y and up |        319        4.05      100.00
--------------------+-----------------------------------
              Total |      7,872      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        264       10.55       10.55
          2 |         93        3.72       14.26
          3 |        192        7.67       21.93
          4 |        150        5.99       27.93
          5 |         30        1.20       29.13
          6 |        174        6.95       36.08
          7 |        213        8.51       44.59
          8 |        689       27.53       72.11
          9 |        698       27.89      100.00
------------+-----------------------------------
      Total |      2,503      100.00

--------------------------------------------------------------------------------------------------------
-> year = 91

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,674       33.63       33.63
 1Y to less than 3Y |      2,240       28.17       61.80
 3Y to less than 5Y |      1,204       15.14       76.94
5Y to less than 10Y |      1,359       17.09       94.03
         10Y and up |        475        5.97      100.00
--------------------+-----------------------------------
              Total |      7,952      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        334       17.47       17.47
          2 |         56        2.93       20.40
          3 |        127        6.64       27.04
          4 |        126        6.59       33.63
          5 |         27        1.41       35.04
          6 |        113        5.91       40.95
          7 |        154        8.05       49.01
          8 |        449       23.48       72.49
          9 |        526       27.51      100.00
------------+-----------------------------------
      Total |      1,912      100.00

--------------------------------------------------------------------------------------------------------
-> year = 92

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,923       29.10       29.10
 1Y to less than 3Y |      1,887       28.55       57.65
 3Y to less than 5Y |      1,074       16.25       73.90
5Y to less than 10Y |      1,223       18.51       92.40
         10Y and up |        502        7.60      100.00
--------------------+-----------------------------------
              Total |      6,609      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        305       16.80       16.80
          2 |         59        3.25       20.04
          3 |        137        7.54       27.59
          4 |        105        5.78       33.37
          5 |         30        1.65       35.02
          6 |        124        6.83       41.85
          7 |        125        6.88       48.73
          8 |        424       23.35       72.08
          9 |        507       27.92      100.00
------------+-----------------------------------
      Total |      1,816      100.00

--------------------------------------------------------------------------------------------------------
-> year = 93

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,827       27.78       27.78
 1Y to less than 3Y |      1,733       26.35       54.14
 3Y to less than 5Y |      1,051       15.98       70.12
5Y to less than 10Y |      1,350       20.53       90.65
         10Y and up |        615        9.35      100.00
--------------------+-----------------------------------
              Total |      6,576      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        233       13.68       13.68
          2 |         70        4.11       17.79
          3 |        135        7.93       25.72
          4 |        120        7.05       32.77
          5 |         32        1.88       34.64
          6 |        109        6.40       41.05
          7 |        114        6.69       47.74
          8 |        393       23.08       70.82
          9 |        497       29.18      100.00
------------+-----------------------------------
      Total |      1,703      100.00

--------------------------------------------------------------------------------------------------------
-> year = 94

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,734       26.61       26.61
 1Y to less than 3Y |      1,549       23.77       50.38
 3Y to less than 5Y |      1,036       15.90       66.27
5Y to less than 10Y |      1,478       22.68       88.95
         10Y and up |        720       11.05      100.00
--------------------+-----------------------------------
              Total |      6,517      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        233       12.97       12.97
          2 |         64        3.56       16.54
          3 |        140        7.80       24.33
          4 |        108        6.01       30.35
          5 |         33        1.84       32.18
          6 |         89        4.96       37.14
          7 |        109        6.07       43.21
          8 |        373       20.77       63.98
          9 |        647       36.02      100.00
------------+-----------------------------------
      Total |      1,796      100.00

. 
. *** Age and ptencat restrictions. Age tops out at 31 in 1997, so match that. Drop those not employed a
> t previous interview.
. 
. drop if age < 22 | age > 31
(50,101 observations deleted)

. drop if ptencat==.
(30,482 observations deleted)

. drop if prevempd1_ ~= 1
(12,048 observations deleted)

. 
. 
. tab1 year ptencat

-> tabulation of year  

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
         80 |        753        1.21        1.21
         81 |      1,536        2.47        3.68
         82 |      2,389        3.84        7.53
         83 |      3,230        5.20       12.73
         84 |      4,051        6.52       19.25
         85 |      5,226        8.41       27.66
         86 |      5,585        8.99       36.64
         87 |      6,414       10.32       46.97
         88 |      6,624       10.66       57.63
         89 |      6,627       10.67       68.29
         90 |      5,921        9.53       77.82
         91 |      5,171        8.32       86.14
         92 |      3,654        5.88       92.02
         93 |      2,863        4.61       96.63
         94 |      2,093        3.37      100.00
------------+-----------------------------------
      Total |     62,137      100.00

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     23,364       37.60       37.60
 1Y to less than 3Y |     20,021       32.22       69.82
 3Y to less than 5Y |      9,412       15.15       84.97
5Y to less than 10Y |      8,285       13.33       98.30
         10Y and up |      1,055        1.70      100.00
--------------------+-----------------------------------
              Total |     62,137      100.00

. bys year: tab1 ptencat whyleft01_

--------------------------------------------------------------------------------------------------------
-> year = 80

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |        433       57.50       57.50
 1Y to less than 3Y |        303       40.24       97.74
 3Y to less than 5Y |         16        2.12       99.87
5Y to less than 10Y |          1        0.13      100.00
--------------------+-----------------------------------
              Total |        753      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         59       17.30       17.30
          2 |         13        3.81       21.11
          3 |         17        4.99       26.10
          4 |         23        6.74       32.84
          5 |        200       58.65       91.50
          6 |         29        8.50      100.00
------------+-----------------------------------
      Total |        341      100.00

--------------------------------------------------------------------------------------------------------
-> year = 81

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |        851       55.40       55.40
 1Y to less than 3Y |        654       42.58       97.98
 3Y to less than 5Y |         26        1.69       99.67
5Y to less than 10Y |          5        0.33      100.00
--------------------+-----------------------------------
              Total |      1,536      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        152       21.81       21.81
          2 |         40        5.74       27.55
          3 |         35        5.02       32.57
          4 |         54        7.75       40.32
          5 |        416       59.68      100.00
------------+-----------------------------------
      Total |        697      100.00

--------------------------------------------------------------------------------------------------------
-> year = 82

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,157       48.43       48.43
 1Y to less than 3Y |        921       38.55       86.98
 3Y to less than 5Y |        300       12.56       99.54
5Y to less than 10Y |         11        0.46      100.00
--------------------+-----------------------------------
              Total |      2,389      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        198       20.10       20.10
          2 |         52        5.28       25.38
          3 |         44        4.47       29.85
          4 |         73        7.41       37.26
          5 |        618       62.74      100.00
------------+-----------------------------------
      Total |        985      100.00

--------------------------------------------------------------------------------------------------------
-> year = 83

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,481       45.85       45.85
 1Y to less than 3Y |      1,197       37.06       82.91
 3Y to less than 5Y |        530       16.41       99.32
5Y to less than 10Y |         22        0.68      100.00
--------------------+-----------------------------------
              Total |      3,230      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        350       28.48       28.48
          2 |         92        7.49       35.96
          3 |         42        3.42       39.38
          4 |         90        7.32       46.70
          5 |        655       53.30      100.00
------------+-----------------------------------
      Total |      1,229      100.00

--------------------------------------------------------------------------------------------------------
-> year = 84

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,617       39.92       39.92
 1Y to less than 3Y |      1,505       37.15       77.07
 3Y to less than 5Y |        682       16.84       93.90
5Y to less than 10Y |        247        6.10      100.00
--------------------+-----------------------------------
              Total |      4,051      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        180       11.88       11.88
          2 |         42        2.77       14.65
          3 |        100        6.60       21.25
          4 |         99        6.53       27.79
          5 |         41        2.71       30.50
          6 |        104        6.86       37.36
          7 |        949       62.64      100.00
------------+-----------------------------------
      Total |      1,515      100.00

--------------------------------------------------------------------------------------------------------
-> year = 85

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,217       42.42       42.42
 1Y to less than 3Y |      1,671       31.97       74.40
 3Y to less than 5Y |        880       16.84       91.24
5Y to less than 10Y |        456        8.73       99.96
         10Y and up |          2        0.04      100.00
--------------------+-----------------------------------
              Total |      5,226      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        189       10.74       10.74
          2 |         56        3.18       13.93
          3 |        122        6.94       20.86
          4 |         83        4.72       25.58
          5 |         38        2.16       27.74
          6 |        109        6.20       33.94
          7 |      1,162       66.06      100.00
------------+-----------------------------------
      Total |      1,759      100.00

--------------------------------------------------------------------------------------------------------
-> year = 86

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,349       42.06       42.06
 1Y to less than 3Y |      1,673       29.96       72.01
 3Y to less than 5Y |        859       15.38       87.39
5Y to less than 10Y |        697       12.48       99.87
         10Y and up |          7        0.13      100.00
--------------------+-----------------------------------
              Total |      5,585      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        251       11.41       11.41
          2 |         66        3.00       14.42
          3 |        125        5.68       20.10
          4 |        138        6.28       26.38
          5 |         42        1.91       28.29
          6 |        143        6.50       34.79
          7 |      1,434       65.21      100.00
------------+-----------------------------------
      Total |      2,199      100.00

--------------------------------------------------------------------------------------------------------
-> year = 87

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,613       40.74       40.74
 1Y to less than 3Y |      2,012       31.37       72.11
 3Y to less than 5Y |        872       13.60       85.70
5Y to less than 10Y |        905       14.11       99.81
         10Y and up |         12        0.19      100.00
--------------------+-----------------------------------
              Total |      6,414      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        264       10.60       10.60
          2 |         92        3.69       14.29
          3 |        132        5.30       19.59
          4 |        137        5.50       25.09
          5 |         37        1.49       26.58
          6 |        204        8.19       34.77
          7 |      1,625       65.23      100.00
------------+-----------------------------------
      Total |      2,491      100.00

--------------------------------------------------------------------------------------------------------
-> year = 88

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,351       35.49       35.49
 1Y to less than 3Y |      2,210       33.36       68.86
 3Y to less than 5Y |        919       13.87       82.73
5Y to less than 10Y |      1,126       17.00       99.73
         10Y and up |         18        0.27      100.00
--------------------+-----------------------------------
              Total |      6,624      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        223        8.84        8.84
          2 |         70        2.77       11.61
          3 |        140        5.55       17.16
          4 |        145        5.74       22.90
          5 |         48        1.90       24.80
          6 |        200        7.92       32.73
          7 |      1,698       67.27      100.00
------------+-----------------------------------
      Total |      2,524      100.00

--------------------------------------------------------------------------------------------------------
-> year = 89

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,261       34.12       34.12
 1Y to less than 3Y |      2,076       31.33       65.44
 3Y to less than 5Y |      1,030       15.54       80.99
5Y to less than 10Y |      1,094       16.51       97.50
         10Y and up |        166        2.50      100.00
--------------------+-----------------------------------
              Total |      6,627      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        214       10.12       10.12
          2 |         70        3.31       13.43
          3 |        144        6.81       20.25
          4 |        124        5.87       26.11
          5 |         21        0.99       27.11
          6 |        156        7.38       34.48
          7 |      1,385       65.52      100.00
------------+-----------------------------------
      Total |      2,114      100.00

--------------------------------------------------------------------------------------------------------
-> year = 90

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      2,001       33.79       33.79
 1Y to less than 3Y |      1,770       29.89       63.69
 3Y to less than 5Y |        955       16.13       79.82
5Y to less than 10Y |        982       16.59       96.40
         10Y and up |        213        3.60      100.00
--------------------+-----------------------------------
              Total |      5,921      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        183        9.81        9.81
          2 |         73        3.91       13.73
          3 |        100        5.36       19.09
          4 |        108        5.79       24.88
          5 |         21        1.13       26.01
          6 |        116        6.22       32.23
          7 |        171        9.17       41.39
          8 |        591       31.69       73.08
          9 |        502       26.92      100.00
------------+-----------------------------------
      Total |      1,865      100.00

--------------------------------------------------------------------------------------------------------
-> year = 91

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,656       32.02       32.02
 1Y to less than 3Y |      1,534       29.67       61.69
 3Y to less than 5Y |        849       16.42       78.11
5Y to less than 10Y |        915       17.69       95.80
         10Y and up |        217        4.20      100.00
--------------------+-----------------------------------
              Total |      5,171      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        227       18.15       18.15
          2 |         37        2.96       21.10
          3 |         58        4.64       25.74
          4 |         82        6.55       32.29
          5 |         13        1.04       33.33
          6 |         80        6.39       39.73
          7 |        112        8.95       48.68
          8 |        323       25.82       74.50
          9 |        319       25.50      100.00
------------+-----------------------------------
      Total |      1,251      100.00

--------------------------------------------------------------------------------------------------------
-> year = 92

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |      1,009       27.61       27.61
 1Y to less than 3Y |      1,140       31.20       58.81
 3Y to less than 5Y |        626       17.13       75.94
5Y to less than 10Y |        706       19.32       95.27
         10Y and up |        173        4.73      100.00
--------------------+-----------------------------------
              Total |      3,654      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        163       16.48       16.48
          2 |         28        2.83       19.31
          3 |         55        5.56       24.87
          4 |         45        4.55       29.42
          5 |         17        1.72       31.14
          6 |         65        6.57       37.71
          7 |         75        7.58       45.30
          8 |        278       28.11       73.41
          9 |        263       26.59      100.00
------------+-----------------------------------
      Total |        989      100.00

--------------------------------------------------------------------------------------------------------
-> year = 93

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |        781       27.28       27.28
 1Y to less than 3Y |        811       28.33       55.61
 3Y to less than 5Y |        512       17.88       73.49
5Y to less than 10Y |        610       21.31       94.80
         10Y and up |        149        5.20      100.00
--------------------+-----------------------------------
              Total |      2,863      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        112       14.89       14.89
          2 |         24        3.19       18.09
          3 |         39        5.19       23.27
          4 |         51        6.78       30.05
          5 |         12        1.60       31.65
          6 |         43        5.72       37.37
          7 |         57        7.58       44.95
          8 |        206       27.39       72.34
          9 |        208       27.66      100.00
------------+-----------------------------------
      Total |        752      100.00

--------------------------------------------------------------------------------------------------------
-> year = 94

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |        587       28.05       28.05
 1Y to less than 3Y |        544       25.99       54.04
 3Y to less than 5Y |        356       17.01       71.05
5Y to less than 10Y |        508       24.27       95.32
         10Y and up |         98        4.68      100.00
--------------------+-----------------------------------
              Total |      2,093      100.00

-> tabulation of whyleft01_  

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         77       12.48       12.48
          2 |         23        3.73       16.21
          3 |         32        5.19       21.39
          4 |         31        5.02       26.42
          5 |          9        1.46       27.88
          6 |         25        4.05       31.93
          7 |         45        7.29       39.22
          8 |        148       23.99       63.21
          9 |        227       36.79      100.00
------------+-----------------------------------
      Total |        617      100.00

. bys year: tab1 invol mainisnew

--------------------------------------------------------------------------------------------------------
-> year = 80

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        252       73.90       73.90
          1 |         89       26.10      100.00
------------+-----------------------------------
      Total |        341      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        420       58.58       58.58
          1 |        297       41.42      100.00
------------+-----------------------------------
      Total |        717      100.00

--------------------------------------------------------------------------------------------------------
-> year = 81

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        470       67.43       67.43
          1 |        227       32.57      100.00
------------+-----------------------------------
      Total |        697      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        915       61.37       61.37
          1 |        576       38.63      100.00
------------+-----------------------------------
      Total |      1,491      100.00

--------------------------------------------------------------------------------------------------------
-> year = 82

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        691       70.15       70.15
          1 |        294       29.85      100.00
------------+-----------------------------------
      Total |        985      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,522       65.60       65.60
          1 |        798       34.40      100.00
------------+-----------------------------------
      Total |      2,320      100.00

--------------------------------------------------------------------------------------------------------
-> year = 83

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        745       60.62       60.62
          1 |        484       39.38      100.00
------------+-----------------------------------
      Total |      1,229      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,269       71.76       71.76
          1 |        893       28.24      100.00
------------+-----------------------------------
      Total |      3,162      100.00

--------------------------------------------------------------------------------------------------------
-> year = 84

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,053       69.50       69.50
          1 |        462       30.50      100.00
------------+-----------------------------------
      Total |      1,515      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,678       68.39       68.39
          1 |      1,238       31.61      100.00
------------+-----------------------------------
      Total |      3,916      100.00

--------------------------------------------------------------------------------------------------------
-> year = 85

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,271       72.26       72.26
          1 |        488       27.74      100.00
------------+-----------------------------------
      Total |      1,759      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,084       68.20       68.20
          1 |      1,438       31.80      100.00
------------+-----------------------------------
      Total |      4,522      100.00

--------------------------------------------------------------------------------------------------------
-> year = 86

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,577       71.71       71.71
          1 |        622       28.29      100.00
------------+-----------------------------------
      Total |      2,199      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,505       65.70       65.70
          1 |      1,830       34.30      100.00
------------+-----------------------------------
      Total |      5,335      100.00

--------------------------------------------------------------------------------------------------------
-> year = 87

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,829       73.42       73.42
          1 |        662       26.58      100.00
------------+-----------------------------------
      Total |      2,491      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,030       65.77       65.77
          1 |      2,097       34.23      100.00
------------+-----------------------------------
      Total |      6,127      100.00

--------------------------------------------------------------------------------------------------------
-> year = 88

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,898       75.20       75.20
          1 |        626       24.80      100.00
------------+-----------------------------------
      Total |      2,524      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,076       64.10       64.10
          1 |      2,283       35.90      100.00
------------+-----------------------------------
      Total |      6,359      100.00

--------------------------------------------------------------------------------------------------------
-> year = 89

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,541       72.89       72.89
          1 |        573       27.11      100.00
------------+-----------------------------------
      Total |      2,114      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,717       73.13       73.13
          1 |      1,733       26.87      100.00
------------+-----------------------------------
      Total |      6,450      100.00

--------------------------------------------------------------------------------------------------------
-> year = 90

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,380       73.99       73.99
          1 |        485       26.01      100.00
------------+-----------------------------------
      Total |      1,865      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,081       71.63       71.63
          1 |      1,616       28.37      100.00
------------+-----------------------------------
      Total |      5,697      100.00

--------------------------------------------------------------------------------------------------------
-> year = 91

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        834       66.67       66.67
          1 |        417       33.33      100.00
------------+-----------------------------------
      Total |      1,251      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,424       78.71       78.71
          1 |        926       21.29      100.00
------------+-----------------------------------
      Total |      4,350      100.00

--------------------------------------------------------------------------------------------------------
-> year = 92

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        681       68.86       68.86
          1 |        308       31.14      100.00
------------+-----------------------------------
      Total |        989      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,794       78.57       78.57
          1 |        762       21.43      100.00
------------+-----------------------------------
      Total |      3,556      100.00

--------------------------------------------------------------------------------------------------------
-> year = 93

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        514       68.35       68.35
          1 |        238       31.65      100.00
------------+-----------------------------------
      Total |        752      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,278       83.02       83.02
          1 |        466       16.98      100.00
------------+-----------------------------------
      Total |      2,744      100.00

--------------------------------------------------------------------------------------------------------
-> year = 94

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        445       72.12       72.12
          1 |        172       27.88      100.00
------------+-----------------------------------
      Total |        617      100.00

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,556       76.42       76.42
          1 |        480       23.58      100.00
------------+-----------------------------------
      Total |      2,036      100.00

. 
. *** Concern that change in job number coding plus computer assisted interviewing could lead to better 
> employer tracking.
. *** Coding, recording of tenure on main job each year should have changed less across survey years and
>  versions. So do some checks using only that.
. 
. * Probability that current tenure on main job is over a year, and currently employed, by previous tenu
> re category.
. 
. gen checkten1yrplus=0

. replace checkten1yrplus=1 if empd==1 & tencat>=3 & tencat~=.
(20,436 real changes made)

. 
. table ptencat [pw=custwt], contents(mean checkten1yrplus)

------------------------------------
            ptencat | mean(checkt~s)
--------------------+---------------
       Less than 1Y |       .0095817
 1Y to less than 3Y |       .2920844
 3Y to less than 5Y |       .7601615
5Y to less than 10Y |       .8282197
         10Y and up |       .9145072
------------------------------------

. 
. *tabulate ptencat tencat [pw=custwt], nofreq
. tabulate ptencat tencat, row column nofreq  

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                    |                         tencat
            ptencat | Less than  1Y to les  3Y to les  5Y to les  10Y and u |     Total
--------------------+-------------------------------------------------------+----------
       Less than 1Y |     48.17      50.79       0.62       0.38       0.05 |    100.00 
                    |     61.31      56.06       1.32       0.84       0.61 |     37.30 
--------------------+-------------------------------------------------------+----------
 1Y to less than 3Y |     23.97      44.84      31.12       0.06       0.01 |    100.00 
                    |     26.34      42.73      57.54       0.12       0.12 |     32.21 
--------------------+-------------------------------------------------------+----------
 3Y to less than 5Y |     14.94       1.52      46.75      36.77       0.01 |    100.00 
                    |      7.80       0.69      41.07      33.70       0.06 |     15.30 
--------------------+-------------------------------------------------------+----------
5Y to less than 10Y |      9.33       1.27       0.08      80.81       8.52 |    100.00 
                    |      4.30       0.51       0.06      65.32      41.08 |     13.49 
--------------------+-------------------------------------------------------+----------
         10Y and up |      4.23       0.20       0.10       0.10      95.37 |    100.00 
                    |      0.25       0.01       0.01       0.01      58.12 |      1.70 
--------------------+-------------------------------------------------------+----------
              Total |     29.30      33.80      17.42      16.69       2.80 |    100.00 
                    |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. 
. * Dummy for continued employment 
. 
. gen continuedemp=.
(62,137 missing values generated)

. replace continuedemp=1 if ptencat~=. & mainisnew==0
(41,349 real changes made)

. replace continuedemp=0 if ptencat~=. & mainisnew==1
(17,433 real changes made)

. 
. gen conempemp=.
(62,137 missing values generated)

. replace conempemp=0 if ptencat~=. 
(62,137 real changes made)

. replace conempemp=1 if ptencat~=. & mainisnew==0 & empd==1
(36,916 real changes made)

. 
. 
. * Universe of invol is everyone with a whyleft code for current or previous job 1. Check that some are
>  not employed at current interview.
. bys invol: summ empd

--------------------------------------------------------------------------------------------------------
-> invol = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     15,179    .7264642    .4457881          0          1

--------------------------------------------------------------------------------------------------------
-> invol = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      6,147      .59102    .4916856          0          1

--------------------------------------------------------------------------------------------------------
-> invol = .

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     37,498    .9921596    .0881995          0          1


. 
. 
. *** Mainisnew includes jobs new to main position, so can have (many) with mainisnew=1 but no invol cod
> e
. 
. * mainisnew=1 empd=1 and invol=. can happen if kept old main job as non-main employer
. * mainisnew=0 empd=1 and invol~=. can happen if left and returned to previous main employer
. * mainisnew=0 or =1 and empd=0 should have invol code for why left that employer
. 
. tab1 mainisnew

-> tabulation of mainisnew  

  mainisnew |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     41,349       70.34       70.34
          1 |     17,433       29.66      100.00
------------+-----------------------------------
      Total |     58,782      100.00

. bys mainisnew: tab1 invol

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,957       61.41       61.41
          1 |      1,858       38.59      100.00
------------+-----------------------------------
      Total |      4,815      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,199       74.06       74.06
          1 |      4,272       25.94      100.00
------------+-----------------------------------
      Total |     16,471      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = .

-> tabulation of invol  

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         25       59.52       59.52
          1 |         17       40.48      100.00
------------+-----------------------------------
      Total |         42      100.00

. bys mainisnew: tab1 invol if empd==1

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol if empd==1 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        283       70.22       70.22
          1 |        120       29.78      100.00
------------+-----------------------------------
      Total |        403      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol if empd==1 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,738       75.36       75.36
          1 |      3,510       24.64      100.00
------------+-----------------------------------
      Total |     14,248      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = .

-> tabulation of invol if empd==1 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          6       66.67       66.67
          1 |          3       33.33      100.00
------------+-----------------------------------
      Total |          9      100.00

. bys mainisnew: tab1 invol if empd==0

--------------------------------------------------------------------------------------------------------
-> mainisnew = 0

-> tabulation of invol if empd==0 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,672       60.59       60.59
          1 |      1,738       39.41      100.00
------------+-----------------------------------
      Total |      4,410      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = 1

-> tabulation of invol if empd==0 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,461       65.72       65.72
          1 |        762       34.28      100.00
------------+-----------------------------------
      Total |      2,223      100.00

--------------------------------------------------------------------------------------------------------
-> mainisnew = .

-> tabulation of invol if empd==0 

      invol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         19       57.58       57.58
          1 |         14       42.42      100.00
------------+-----------------------------------
      Total |         33      100.00

. tab1 whyleft01_ if mainisnew==0 & empd==1

-> tabulation of whyleft01_ if mainisnew==0 & empd==1 

 whyleft01_ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         50       12.41       12.41
          2 |          8        1.99       14.39
          3 |         37        9.18       23.57
          4 |         16        3.97       27.54
          5 |         36        8.93       36.48
          6 |         18        4.47       40.94
          7 |        143       35.48       76.43
          8 |         38        9.43       85.86
          9 |         57       14.14      100.00
------------+-----------------------------------
      Total |        403      100.00

. 
. ** Some Rs are curr empd at main employer, main is not new, but have valid reason for sep code. Could 
> be left and returned to orig main emp.
. ** whyleft01_ codes consistent with this: 1 = layoff, 3 = temp job ended (most years), 5 and 7 = quit 
> to look for new job (many years).
. ** Could do more here but this seems reasonable.
. 
. 
. * Dummies for shares of those previously employed who left vol, invol, temp job ended
. 
. gen sepvol=.
(62,137 missing values generated)

. replace sepvol=0 if ptencat~=.
(62,137 real changes made)

. replace sepvol=1 if ptencat~=. & invol==0
(15,181 real changes made)

. 
. gen sepinvol=.
(62,137 missing values generated)

. replace sepinvol=0 if ptencat~=.
(62,137 real changes made)

. replace sepinvol=1 if ptencat~=. & invol==1
(6,147 real changes made)

. 
. gen tempend=.
(62,137 missing values generated)

. replace tempend=0 if ptencat~=.
(62,137 real changes made)

. replace tempend=1 if tempend==0 & whyleft01_==3
(1,185 real changes made)

. 
. gen somecoll=.
(62,137 missing values generated)

. replace somecoll=0 if edgrp4_==1 | edgrp4_==2
(38,363 real changes made)

. replace somecoll=1 if edgrp4_==3 | edgrp4_==4
(23,770 real changes made)

. 
. /* MAIN RESULTS TABLES, by previous tenure category */    
. 
. bys year: summ tempend sepinvol sepvol conempemp jobsnum tmain tmain22_

--------------------------------------------------------------------------------------------------------
-> year = 80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |        753    .0225764    .1486473          0          1
    sepinvol |        753    .1181939    .3230521          0          1
      sepvol |        753    .3346614    .4721856          0          1
   conempemp |        753    .4833997    .5000565          0          1
     jobsnum |        717    2.476987    1.618188          1         10
-------------+---------------------------------------------------------
       tmain |        437    1.377574    .4853359          1          2
    tmain22_ |        437     1.05492    .2473804          0          2

--------------------------------------------------------------------------------------------------------
-> year = 81

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      1,536    .0227865    .1492707          0          1
    sepinvol |      1,536    .1477865    .3550038          0          1
      sepvol |      1,536    .3059896    .4609754          0          1
   conempemp |      1,536    .5039063    .5001476          0          1
     jobsnum |      1,491    3.075788    1.944953          1         14
-------------+---------------------------------------------------------
       tmain |        852    1.643192    .7203036          0          3
    tmain22_ |        852    1.211268    .4335678          0          3

--------------------------------------------------------------------------------------------------------
-> year = 82

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      2,389    .0184177    .1344846          0          1
    sepinvol |      2,389     .123064    .3285795          0          1
      sepvol |      2,389    .2892424    .4535056          0          1
   conempemp |      2,389    .5353704    .4988518          0          1
     jobsnum |      2,320    3.699569    2.333327          1         17
-------------+---------------------------------------------------------
       tmain |      1,302    2.080645    .9280546          1          4
    tmain22_ |      1,302    1.382488    .6208773          0          4

--------------------------------------------------------------------------------------------------------
-> year = 83

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      3,230    .0130031    .1133049          0          1
    sepinvol |      3,230    .1498452    .3569749          0          1
      sepvol |      3,230    .2306502    .4213142          0          1
   conempemp |      3,230    .5947368    .4910189          0          1
     jobsnum |      3,162    4.273245    2.663919          1         22
-------------+---------------------------------------------------------
       tmain |      1,775    2.524507    1.134347          0          5
    tmain22_ |      1,775    1.503662    .7866295          0          5

--------------------------------------------------------------------------------------------------------
-> year = 84

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      4,051    .0246853    .1551833          0          1
    sepinvol |      4,051    .1140459    .3179063          0          1
      sepvol |      4,051    .2599358    .4386533          0          1
   conempemp |      4,051    .5860281    .4926044          0          1
     jobsnum |      3,916    4.806946    2.939407          1         25
-------------+---------------------------------------------------------
       tmain |      2,264    3.047261    1.363942          1          6
    tmain22_ |      2,264    1.698763    .9748396          0          6

--------------------------------------------------------------------------------------------------------
-> year = 85

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      5,226    .0233448    .1510106          0          1
    sepinvol |      5,226    .0933793     .290991          0          1
      sepvol |      5,226     .243207    .4290601          0          1
   conempemp |      5,226     .521814    .4995717          0          1
     jobsnum |      4,520    5.457965    3.273814          1         26
-------------+---------------------------------------------------------
       tmain |      2,990    3.634783    1.582691          1          7
    tmain22_ |      2,990    1.886957    1.130168          1          7

--------------------------------------------------------------------------------------------------------
-> year = 86

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      5,585    .0223814    .1479337          0          1
    sepinvol |      5,585    .1113697    .3146176          0          1
      sepvol |      5,585    .2823635    .4501895          0          1
   conempemp |      5,585    .5548791    .4970237          0          1
     jobsnum |      5,333     5.96381    3.488971          1         27
-------------+---------------------------------------------------------
       tmain |      3,623    4.275186     1.82145          1          8
    tmain22_ |      3,623    2.134695    1.334074          0          8

--------------------------------------------------------------------------------------------------------
-> year = 87

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      6,414      .02058    .1419845          0          1
    sepinvol |      6,414    .1032117    .3042589          0          1
      sepvol |      6,414    .2851575    .4515246          0          1
   conempemp |      6,414    .5594013    .4964977          0          1
     jobsnum |      6,125    6.485551    3.728191          1         34
-------------+---------------------------------------------------------
       tmain |      4,284    4.898226    2.013243          1          9
    tmain22_ |      4,284    2.430906    1.529884          0          8

--------------------------------------------------------------------------------------------------------
-> year = 88

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      6,624    .0211353    .1438461          0          1
    sepinvol |      6,624    .0945048    .2925519          0          1
      sepvol |      6,624    .2865338    .4521759          0          1
   conempemp |      6,624    .5528382    .4972378          0          1
     jobsnum |      6,358    7.021548    4.006249          1         36
-------------+---------------------------------------------------------
       tmain |      4,569     5.44408    2.232833          1         10
    tmain22_ |      4,569    2.876122    1.697317          1          9

--------------------------------------------------------------------------------------------------------
-> year = 89

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      6,627    .0217293    .1458092          0          1
    sepinvol |      6,627    .0864645    .2810699          0          1
      sepvol |      6,627    .2325336    .4224792          0          1
   conempemp |      6,627    .6446356    .4786597          0          1
     jobsnum |      6,448    7.468517    4.218619          1         42
-------------+---------------------------------------------------------
       tmain |      4,559    5.847116    2.393884          1         11
    tmain22_ |      4,559    3.145207    1.803407          1         10

--------------------------------------------------------------------------------------------------------
-> year = 90

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      5,921     .016889    .1288666          0          1
    sepinvol |      5,921    .0819118    .2742535          0          1
      sepvol |      5,921    .2330687    .4228214          0          1
   conempemp |      5,921    .6324945    .4821664          0          1
     jobsnum |      5,697    8.050904    4.465835          1         38
-------------+---------------------------------------------------------
       tmain |      4,040    6.370545    2.553236          1         12
    tmain22_ |      4,040    3.361386     1.85113          1         10

--------------------------------------------------------------------------------------------------------
-> year = 91

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      5,171    .0112164    .1053221          0          1
    sepinvol |      5,171     .080642    .2723109          0          1
      sepvol |      5,171    .1612841    .3678283          0          1
   conempemp |      5,171    .5944692     .491042          0          1
     jobsnum |      4,346    8.422918    4.562535          1         37
-------------+---------------------------------------------------------
       tmain |      3,634    6.851128    2.653618          1         13
    tmain22_ |      3,634    3.543478    1.883157          1         10

--------------------------------------------------------------------------------------------------------
-> year = 92

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      3,654     .015052    .1217764          0          1
    sepinvol |      3,654    .0842912     .277862          0          1
      sepvol |      3,654    .1863711    .3894591          0          1
   conempemp |      3,654    .6967707    .4597164          0          1
     jobsnum |      3,554    8.709904    4.650459          1         34
-------------+---------------------------------------------------------
       tmain |      2,965    7.251939    2.761359          1         14
    tmain22_ |      2,965    3.657673    1.920443          1         10

--------------------------------------------------------------------------------------------------------
-> year = 93

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      2,863    .0136221    .1159362          0          1
    sepinvol |      2,863    .0831296    .2761262          0          1
      sepvol |      2,863     .179532    .3838642          0          1
   conempemp |      2,863    .7230178    .4475858          0          1
     jobsnum |      2,786     9.11486    4.802051          1         35
-------------+---------------------------------------------------------
       tmain |      2,374    7.728728    2.859198          1         15
    tmain22_ |      2,374    3.760741    1.954616          1         10

--------------------------------------------------------------------------------------------------------
-> year = 94

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     tempend |      2,093    .0152891    .1227294          0          1
    sepinvol |      2,093    .0821787    .2747024          0          1
      sepvol |      2,093    .2126135    .4092542          0          1
   conempemp |      2,093    .6789298    .4669993          0          1
     jobsnum |      2,034    9.498525    4.956302          1         34
-------------+---------------------------------------------------------
       tmain |      1,733    8.388344    2.987623          1         16
    tmain22_ |      1,733    3.991922    2.107652          1         10


. 
. tab1 ptencat     

-> tabulation of ptencat  

            ptencat |      Freq.     Percent        Cum.
--------------------+-----------------------------------
       Less than 1Y |     23,364       37.60       37.60
 1Y to less than 3Y |     20,021       32.22       69.82
 3Y to less than 5Y |      9,412       15.15       84.97
5Y to less than 10Y |      8,285       13.33       98.30
         10Y and up |      1,055        1.70      100.00
--------------------+-----------------------------------
              Total |     62,137      100.00

. bys ptencat: summ empd mainisnew invol

--------------------------------------------------------------------------------------------------------
-> ptencat = Less than 1Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     22,025    .8172985    .3864304          0          1
   mainisnew |     21,999    .4555662     .498033          0          1
       invol |     12,016    .3029294    .4595441          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 1Y to less than 3Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |     18,935    .8970689    .3038769          0          1
   mainisnew |     18,923    .2665011    .4421409          0          1
       invol |      6,242    .2723486     .445204          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 3Y to less than 5Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      8,965    .9320692    .2516412          0          1
   mainisnew |      8,964    .1648817    .3710945          0          1
       invol |      1,902    .2681388    .4431068          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 5Y to less than 10Y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |      7,903    .9550803    .2071408          0          1
   mainisnew |      7,900    .1072152    .3094062          0          1
       invol |      1,101    .2515895    .4341237          0          1

--------------------------------------------------------------------------------------------------------
-> ptencat = 10Y and up

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        empd |        996    .9769076    .1502724          0          1
   mainisnew |        996    .0431727    .2033478          0          1
       invol |         67    .2985075    .4610569          0          1


. table ptencat [pw=custwt], contents(mean empd mean mainisnew mean invol mean continuedemp mean conempe
> mp)

------------------------------------------------------------------------------------------
            ptencat |   mean(empd)  mean(main~w)   mean(invol)  mean(cont~p)  mean(cone~p)
--------------------+---------------------------------------------------------------------
       Less than 1Y |      .834753      .4466486      .2870108      .5533514      .4413383
 1Y to less than 3Y |     .9074407      .2623742      .2475275      .7376258      .6460569
 3Y to less than 5Y |     .9384807      .1646752      .2449625      .8353248      .7639155
5Y to less than 10Y |     .9558336      .1038896      .2378588      .8961104      .8304127
         10Y and up |     .9790903      .0360268      .2004585      .9639732      .9179845
------------------------------------------------------------------------------------------

. table ptencat [pw=custwt], contents(mean sepinvol mean sepvol mean tempend mean tmain)

------------------------------------------------------------------------------------
            ptencat | mean(sepinvol)    mean(sepvol)   mean(tempend)     mean(tmain)
--------------------+---------------------------------------------------------------
       Less than 1Y |       .1457029        .3619535        .0357142        6.274636
 1Y to less than 3Y |       .0761391        .2314594        .0115984        5.271031
 3Y to less than 5Y |       .0495526        .1527338        .0066069        4.361047
5Y to less than 10Y |       .0311085        .0996769        .0018765        3.393442
         10Y and up |       .0117156        .0467284               0        1.996457
------------------------------------------------------------------------------------

. 
. table ptencat [pw=custwt], contents(mean tempend mean sepinvol mean sepvol mean conempemp mean tmain)

------------------------------------------------------------------------------------------
            ptencat | mean(temp~d)  mean(sepi~l)  mean(sepvol)  mean(cone~p)   mean(tmain)
--------------------+---------------------------------------------------------------------
       Less than 1Y |     .0357142      .1457029      .3619535      .4413383      6.274636
 1Y to less than 3Y |     .0115984      .0761391      .2314594      .6460569      5.271031
 3Y to less than 5Y |     .0066069      .0495526      .1527338      .7639155      4.361047
5Y to less than 10Y |     .0018765      .0311085      .0996769      .8304127      3.393442
         10Y and up |            0      .0117156      .0467284      .9179845      1.996457
------------------------------------------------------------------------------------------

. table ptencat [pw=custwt], contents(mean tempend mean sepinvol mean sepvol mean conempemp mean tmain22
> _)

------------------------------------------------------------------------------------------
            ptencat | mean(temp~d)  mean(sepi~l)  mean(sepvol)  mean(cone~p)  mean(tm~22_)
--------------------+---------------------------------------------------------------------
       Less than 1Y |     .0357142      .1457029      .3619535      .4413383      3.423466
 1Y to less than 3Y |     .0115984      .0761391      .2314594      .6460569      2.778995
 3Y to less than 5Y |     .0066069      .0495526      .1527338      .7639155      2.159051
5Y to less than 10Y |     .0018765      .0311085      .0996769      .8304127      1.593654
         10Y and up |            0      .0117156      .0467284      .9179845      1.166557
------------------------------------------------------------------------------------------

. 
. preserve 

. 
. keep if continuous==1
(20,736 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain)

. list

     +------------------+
     | tmain   contin~s |
     |------------------|
  1. |     0   .0099965 |
  2. |     1   9.149486 |
  3. |     2    11.6675 |
  4. |     3   12.63487 |
  5. |     4   12.12268 |
     |------------------|
  6. |     5    12.3805 |
  7. |     6   11.41349 |
  8. |     7   10.12755 |
  9. |     8   8.219047 |
 10. |     9   5.276648 |
     |------------------|
 11. |    10   3.344157 |
 12. |    11   1.917298 |
 13. |    12   .9825324 |
 14. |    13   .5020004 |
 15. |    14   .2023146 |
     |------------------|
 16. |    15     .03995 |
 17. |    16   .0099756 |
     +------------------+

.  
. restore 

. preserve 

. 
. keep if continuous==1
(20,736 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        0   .0189053 |
  2. |        1   33.40354 |
  3. |        2   22.50243 |
  4. |        3   16.80817 |
  5. |        4   11.60361 |
     |---------------------|
  6. |        5   7.479892 |
  7. |        6   4.404987 |
  8. |        7   2.199206 |
  9. |        8   1.134633 |
 10. |        9   .3848823 |
     |---------------------|
 11. |       10   .0597372 |
     +---------------------+

.  
. restore 

. preserve 

. 
. keep if continuous==1
(20,736 observations deleted)

. collapse (percent) continuous [pw=custwt], by(jobsnum)

. list

     +---------------------+
     |  jobsnum   contin~s |
     |---------------------|
  1. |   1 TO 4   4.913069 |
  2. |        2   8.417348 |
  3. |        3   9.333471 |
  4. |        4   11.25473 |
  5. |   5 TO 9   10.94147 |
     |---------------------|
  6. |        6   9.921265 |
  7. |        7   9.060175 |
  8. |        8   7.739753 |
  9. |        9   6.293006 |
 10. | 10 TO 14   5.059226 |
     |---------------------|
 11. |       11   3.890359 |
 12. |       12   3.134377 |
 13. |       13   2.460837 |
 14. |       14   1.866108 |
 15. | 15 TO 19   1.307345 |
     |---------------------|
 16. |       16   1.075072 |
 17. |       17   .8406285 |
 18. |       18    .602457 |
 19. |       19   .4604852 |
 20. | 20 TO 24   .3857434 |
     |---------------------|
 21. |       21   .2414892 |
 22. |       22   .2095488 |
 23. |       23     .19753 |
 24. |       24   .1305426 |
 25. | 25 TO 29   .0942172 |
     |---------------------|
 26. |       26   .0189888 |
 27. |       27   .0360898 |
 28. |       28   .0240263 |
 29. |       29   .0234285 |
 30. |       31    .015801 |
     |---------------------|
 31. |       32   .0056841 |
 32. |       33   .0011289 |
 33. |       34   .0078876 |
 34. |       36   .0070638 |
 35. |       37   .0070638 |
     |---------------------|
 36. |        .   .0225901 |
     +---------------------+

.  
. restore 

. preserve

. keep if continuous==1 & somecoll==0
(37,565 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        0   .0317333 |
  2. |        1   39.38996 |
  3. |        2   20.94696 |
  4. |        3   14.66596 |
  5. |        4   9.752909 |
     |---------------------|
  6. |        5   6.822031 |
  7. |        6   4.264577 |
  8. |        7   2.347766 |
  9. |        8   1.257036 |
 10. |        9   .4452967 |
     |---------------------|
 11. |       10    .075765 |
     +---------------------+

.  
. restore 

. preserve

. keep if continuous==1 & somecoll==1
(45,308 observations deleted)

. collapse (percent) continuous [pw=custwt], by(tmain22_)

. list

     +---------------------+
     | tmain22_   contin~s |
     |---------------------|
  1. |        0   .0023381 |
  2. |        1   25.67215 |
  3. |        2   24.51131 |
  4. |        3    19.5748 |
  5. |        4   13.99378 |
     |---------------------|
  6. |        5   8.329513 |
  7. |        6   4.586324 |
  8. |        7   2.007343 |
  9. |        8   .9765501 |
 10. |        9   .3068577 |
     |---------------------|
 11. |       10   .0390374 |
     +---------------------+

.  
. restore 

. 
. * Assess quality of tmain, tmain22_ relative to CHRR constructed jobsnum
. 
. table ptencat [pw=custwt], contents(mean tmain mean tmain22_ mean jobsnum)

--------------------------------------------------------------------------------
            ptencat |        mean(tmain)      mean(tmain22_)       mean(jobsnum)
--------------------+-----------------------------------------------------------
       Less than 1Y |           6.274636            3.423466   8.387603759765625
 1Y to less than 3Y |           5.271031            2.778995  6.9135112762451172
 3Y to less than 5Y |           4.361047            2.159051  5.6902222633361816
5Y to less than 10Y |           3.393442            1.593654  4.5323019027709961
         10Y and up |           1.996457            1.166557  3.1243660449981689
--------------------------------------------------------------------------------

. table age [pw=custwt], contents(mean tmain mean tmain22_ mean jobsnum)

----------------------------------------------------------------------
      age |        mean(tmain)      mean(tmain22_)       mean(jobsnum)
----------+-----------------------------------------------------------
       22 |           3.245194            .9975992  4.6912035942077637
       23 |            3.73509            1.365214  5.2091245651245117
       24 |           4.267428            1.747294  5.8124351501464844
       25 |            4.73246            2.148832  6.3609414100646973
       26 |           5.113021            2.522541  6.7489604949951172
       27 |           5.413131            2.855487  7.2144570350646973
       28 |           5.784405             3.21481  7.5808086395263672
       29 |           6.062198            3.542997  7.9670662879943848
       30 |           6.094015            3.861122  8.1614656448364258
       31 |           5.958371            4.101426  8.0338211059570313
----------------------------------------------------------------------

. corr tmain tmain22_ jobsnum
(obs=41,384)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7232   1.0000
     jobsnum |   0.6635   0.5653   1.0000


. bys year: corr tmain tmain22_ jobsnum

--------------------------------------------------------------------------------------------------------
-> year = 80
(obs=437)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.2854   1.0000
     jobsnum |   0.6372   0.1683   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 81
(obs=852)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4637   1.0000
     jobsnum |   0.6274   0.2596   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 82
(obs=1,302)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5080   1.0000
     jobsnum |   0.6719   0.3235   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 83
(obs=1,775)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4776   1.0000
     jobsnum |   0.6751   0.3245   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 84
(obs=2,264)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4923   1.0000
     jobsnum |   0.6730   0.3595   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 85
(obs=2,988)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4649   1.0000
     jobsnum |   0.6489   0.3515   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 86
(obs=3,621)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4491   1.0000
     jobsnum |   0.6232   0.3752   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 87
(obs=4,282)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4621   1.0000
     jobsnum |   0.5915   0.4088   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 88
(obs=4,568)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5391   1.0000
     jobsnum |   0.5816   0.4310   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 89
(obs=4,557)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5890   1.0000
     jobsnum |   0.5812   0.4646   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 90
(obs=4,038)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.6685   1.0000
     jobsnum |   0.5715   0.4992   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 91
(obs=3,632)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7178   1.0000
     jobsnum |   0.5646   0.5385   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 92
(obs=2,964)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7671   1.0000
     jobsnum |   0.5592   0.5489   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 93
(obs=2,373)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.8008   1.0000
     jobsnum |   0.5488   0.5562   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 94
(obs=1,731)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.8370   1.0000
     jobsnum |   0.5592   0.5698   1.0000



. 
. *sort year
. *univar year 
. 
. ** Omit obs not in continuously
. table ptencat if continuous==1 [pw=custwt], contents(mean tmain mean tmain22_ mean jobsnum)

--------------------------------------------------------------------------------
            ptencat |        mean(tmain)      mean(tmain22_)       mean(jobsnum)
--------------------+-----------------------------------------------------------
       Less than 1Y |           6.274636            3.423466  8.4725770950317383
 1Y to less than 3Y |           5.271031            2.778995  6.9660940170288086
 3Y to less than 5Y |           4.361047            2.159051  5.7516775131225586
5Y to less than 10Y |           3.393442            1.593654  4.5992650985717773
         10Y and up |           1.996457            1.166557  3.1977481842041016
--------------------------------------------------------------------------------

. table age if continuous==1 [pw=custwt], contents(mean tmain mean tmain22_ mean jobsnum)

----------------------------------------------------------------------
      age |        mean(tmain)      mean(tmain22_)       mean(jobsnum)
----------+-----------------------------------------------------------
       22 |           3.245194            .9975992  4.6822881698608398
       23 |            3.73509            1.365214  5.2486891746520996
       24 |           4.267428            1.747294   5.812769889831543
       25 |            4.73246            2.148832   6.387873649597168
       26 |           5.113021            2.522541  6.7662644386291504
       27 |           5.413131            2.855487  7.1894717216491699
       28 |           5.784405             3.21481  7.5394182205200195
       29 |           6.062198            3.542997  7.9228000640869141
       30 |           6.094015            3.861122  8.1059999465942383
       31 |           5.958371            4.101426  7.9840841293334961
----------------------------------------------------------------------

. corr tmain tmain22_ jobsnum if continuous==1 
(obs=41,384)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7232   1.0000
     jobsnum |   0.6635   0.5653   1.0000


. bys year: corr tmain tmain22_ jobsnum if continuous==1 

--------------------------------------------------------------------------------------------------------
-> year = 80
(obs=437)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.2854   1.0000
     jobsnum |   0.6372   0.1683   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 81
(obs=852)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4637   1.0000
     jobsnum |   0.6274   0.2596   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 82
(obs=1,302)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5080   1.0000
     jobsnum |   0.6719   0.3235   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 83
(obs=1,775)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4776   1.0000
     jobsnum |   0.6751   0.3245   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 84
(obs=2,264)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4923   1.0000
     jobsnum |   0.6730   0.3595   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 85
(obs=2,988)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4649   1.0000
     jobsnum |   0.6489   0.3515   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 86
(obs=3,621)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4491   1.0000
     jobsnum |   0.6232   0.3752   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 87
(obs=4,282)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.4621   1.0000
     jobsnum |   0.5915   0.4088   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 88
(obs=4,568)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5391   1.0000
     jobsnum |   0.5816   0.4310   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 89
(obs=4,557)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.5890   1.0000
     jobsnum |   0.5812   0.4646   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 90
(obs=4,038)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.6685   1.0000
     jobsnum |   0.5715   0.4992   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 91
(obs=3,632)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7178   1.0000
     jobsnum |   0.5646   0.5385   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 92
(obs=2,964)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.7671   1.0000
     jobsnum |   0.5592   0.5489   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 93
(obs=2,373)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.8008   1.0000
     jobsnum |   0.5488   0.5562   1.0000


--------------------------------------------------------------------------------------------------------
-> year = 94
(obs=1,731)

             |    tmain tmain22_  jobsnum
-------------+---------------------------
       tmain |   1.0000
    tmain22_ |   0.8370   1.0000
     jobsnum |   0.5592   0.5698   1.0000



. 
. ** Drop recession years
. 
. preserve

. drop if inlist(year, 80, 81, 82, 90, 91)
(15,770 observations deleted)

. 
. table ptencat [pw=custwt], contents(mean empd mean mainisnew mean invol mean continuedemp mean conempe
> mp)

------------------------------------------------------------------------------------------
            ptencat |   mean(empd)  mean(main~w)   mean(invol)  mean(cont~p)  mean(cone~p)
--------------------+---------------------------------------------------------------------
       Less than 1Y |     .8367633      .4537508      .2865252      .5462492       .436487
 1Y to less than 3Y |     .9072242      .2680937      .2430783      .7319062      .6412855
 3Y to less than 5Y |     .9395164      .1675088      .2485004      .8324912      .7640915
5Y to less than 10Y |     .9571413       .106867       .241992       .893133      .8317901
         10Y and up |     .9855359      .0272577      .1641154      .9727423      .9373634
------------------------------------------------------------------------------------------

. table ptencat [pw=custwt], contents(mean sepinvol mean sepvol mean tempend)

--------------------------------------------------------------------
            ptencat | mean(sepinvol)    mean(sepvol)   mean(tempend)
--------------------+-----------------------------------------------
       Less than 1Y |       .1485785        .3699745        .0373823
 1Y to less than 3Y |         .07663        .2386183         .012507
 3Y to less than 5Y |       .0508255        .1537034        .0077425
5Y to less than 10Y |         .03186        .0997973        .0017605
         10Y and up |       .0078051        .0397535               0
--------------------------------------------------------------------

. restore

. 
. * Adjust for changing age composition by year
. 
. corr invol sepinvol age
(obs=21,328)

             |    invol sepinvol      age
-------------+---------------------------
       invol |   1.0000
    sepinvol |   1.0000   1.0000
         age |  -0.0152  -0.0152   1.0000


. 
. xi, pre(_A) i.age 
i.age             _Aage_22-31         (naturally coded; _Aage_22 omitted)

. keep year custwt _A* empd mainisnew invol continuedemp sepinvol sepvol tempend

. 
. foreach x in empd mainisnew invol continuedemp sepinvol sepvol tempend {
  2.         reg `x' _A*
  3.         predict `x'_adj, residuals
  4. }

      Source |       SS           df       MS      Number of obs   =    58,824
-------------+----------------------------------   F(9, 58814)     =     32.40
       Model |  30.2726297         9  3.36362552   Prob > F        =    0.0000
    Residual |  6106.22676    58,814  .103822674   R-squared       =    0.0049
-------------+----------------------------------   Adj R-squared   =    0.0048
       Total |  6136.49939    58,823  .104321428   Root MSE        =    .32222

------------------------------------------------------------------------------
        empd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |   .0184648   .0062639     2.95   0.003     .0061875     .030742
    _Aage_24 |    .040794    .006163     6.62   0.000     .0287146    .0528735
    _Aage_25 |   .0398102      .0061     6.53   0.000     .0278542    .0517662
    _Aage_26 |   .0505803   .0061041     8.29   0.000     .0386163    .0625443
    _Aage_27 |   .0551616   .0061442     8.98   0.000      .043119    .0672043
    _Aage_28 |   .0581508   .0061487     9.46   0.000     .0460993    .0702024
    _Aage_29 |   .0749053    .006157    12.17   0.000     .0628375    .0869731
    _Aage_30 |   .0713415   .0062886    11.34   0.000     .0590158    .0836672
    _Aage_31 |   .0795158   .0065586    12.12   0.000     .0666609    .0923707
       _cons |   .8324842   .0045998   180.98   0.000     .8234686    .8414998
------------------------------------------------------------------------------
(3,313 missing values generated)

      Source |       SS           df       MS      Number of obs   =    58,782
-------------+----------------------------------   F(9, 58772)     =    123.03
       Model |  226.755023         9  25.1950026   Prob > F        =    0.0000
    Residual |  12036.1336    58,772   .20479367   R-squared       =    0.0185
-------------+----------------------------------   Adj R-squared   =    0.0183
       Total |  12262.8886    58,781  .208619938   Root MSE        =    .45254

------------------------------------------------------------------------------
   mainisnew |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0240055   .0087974    -2.73   0.006    -.0412485   -.0067625
    _Aage_24 |  -.0549424   .0086551    -6.35   0.000    -.0719065   -.0379784
    _Aage_25 |  -.0839107   .0085672    -9.79   0.000    -.1007026   -.0671189
    _Aage_26 |  -.1041607    .008573   -12.15   0.000    -.1209637   -.0873576
    _Aage_27 |  -.1255375    .008629   -14.55   0.000    -.1424504   -.1086245
    _Aage_28 |  -.1421307   .0086385   -16.45   0.000    -.1590621   -.1251993
    _Aage_29 |  -.1668206   .0086517   -19.28   0.000    -.1837779   -.1498632
    _Aage_30 |  -.1781069   .0088369   -20.15   0.000    -.1954273   -.1607865
    _Aage_31 |  -.2102328   .0092158   -22.81   0.000    -.2282958   -.1921697
       _cons |   .4053393   .0064603    62.74   0.000     .3926772    .4180015
------------------------------------------------------------------------------
(3,355 missing values generated)

      Source |       SS           df       MS      Number of obs   =    21,328
-------------+----------------------------------   F(9, 21318)     =      2.07
       Model |  3.82358077         9  .424842308   Prob > F        =    0.0284
    Residual |  4371.53309    21,318  .205063002   R-squared       =    0.0009
-------------+----------------------------------   Adj R-squared   =    0.0005
       Total |  4375.35667    21,327  .205155749   Root MSE        =    .45284

------------------------------------------------------------------------------
       invol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0203138   .0128218    -1.58   0.113    -.0454455    .0048179
    _Aage_24 |  -.0242604   .0128864    -1.88   0.060    -.0495188    .0009979
    _Aage_25 |  -.0224949   .0129011    -1.74   0.081    -.0477821    .0027922
    _Aage_26 |  -.0419127   .0131342    -3.19   0.001    -.0676567   -.0161686
    _Aage_27 |  -.0424639   .0135036    -3.14   0.002    -.0689319   -.0159959
    _Aage_28 |  -.0425147   .0136699    -3.11   0.002    -.0693088   -.0157207
    _Aage_29 |   -.029503   .0140252    -2.10   0.035    -.0569934   -.0020126
    _Aage_30 |  -.0339261   .0144838    -2.34   0.019    -.0623155   -.0055368
    _Aage_31 |   -.011757   .0159773    -0.74   0.462    -.0430737    .0195597
       _cons |   .3150628   .0092629    34.01   0.000     .2969069    .3332186
------------------------------------------------------------------------------
(40,809 missing values generated)

      Source |       SS           df       MS      Number of obs   =    58,782
-------------+----------------------------------   F(9, 58772)     =    123.03
       Model |  226.755023         9  25.1950026   Prob > F        =    0.0000
    Residual |  12036.1336    58,772   .20479367   R-squared       =    0.0185
-------------+----------------------------------   Adj R-squared   =    0.0183
       Total |  12262.8886    58,781  .208619938   Root MSE        =    .45254

------------------------------------------------------------------------------
continuedemp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |   .0240055   .0087974     2.73   0.006     .0067625    .0412485
    _Aage_24 |   .0549424   .0086551     6.35   0.000     .0379784    .0719065
    _Aage_25 |   .0839107   .0085672     9.79   0.000     .0671189    .1007026
    _Aage_26 |   .1041607    .008573    12.15   0.000     .0873576    .1209637
    _Aage_27 |   .1255375    .008629    14.55   0.000     .1086245    .1424504
    _Aage_28 |   .1421307   .0086385    16.45   0.000     .1251993    .1590621
    _Aage_29 |   .1668206   .0086517    19.28   0.000     .1498632    .1837779
    _Aage_30 |   .1781069   .0088369    20.15   0.000     .1607865    .1954273
    _Aage_31 |   .2102328   .0092158    22.81   0.000     .1921697    .2282958
       _cons |   .5946607   .0064603    92.05   0.000     .5819985    .6073228
------------------------------------------------------------------------------
(3,355 missing values generated)

      Source |       SS           df       MS      Number of obs   =    62,137
-------------+----------------------------------   F(9, 62127)     =     39.45
       Model |  31.4709283         9  3.49676981   Prob > F        =    0.0000
    Residual |  5507.42747    62,127   .08864789   R-squared       =    0.0057
-------------+----------------------------------   Adj R-squared   =    0.0055
       Total |   5538.8984    62,136  .089141535   Root MSE        =    .29774

------------------------------------------------------------------------------
    sepinvol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0195867   .0056863    -3.44   0.001    -.0307319   -.0084415
    _Aage_24 |  -.0328381   .0055922    -5.87   0.000    -.0437989   -.0218773
    _Aage_25 |  -.0393872   .0055203    -7.13   0.000    -.0502071   -.0285673
    _Aage_26 |  -.0550285   .0055045   -10.00   0.000    -.0658173   -.0442397
    _Aage_27 |  -.0634276   .0055224   -11.49   0.000    -.0742516   -.0526037
    _Aage_28 |  -.0652166   .0055518   -11.75   0.000    -.0760982   -.0543351
    _Aage_29 |  -.0671939   .0055787   -12.04   0.000    -.0781282   -.0562595
    _Aage_30 |  -.0702715   .0056907   -12.35   0.000    -.0814253   -.0591177
    _Aage_31 |  -.0756591   .0059214   -12.78   0.000    -.0872651   -.0640531
       _cons |   .1484621   .0041807    35.51   0.000      .140268    .1566562
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    62,137
-------------+----------------------------------   F(9, 62127)     =     76.29
       Model |  125.403427         9  13.9337141   Prob > F        =    0.0000
    Residual |  11346.6508    62,127  .182636387   R-squared       =    0.0109
-------------+----------------------------------   Adj R-squared   =    0.0108
       Total |  11472.0543    62,136  .184628143   Root MSE        =    .42736

------------------------------------------------------------------------------
      sepvol |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |  -.0143897   .0081619    -1.76   0.078     -.030387    .0016076
    _Aage_24 |  -.0407729   .0080268    -5.08   0.000    -.0565055   -.0250403
    _Aage_25 |   -.059008   .0079237    -7.45   0.000    -.0745384   -.0434777
    _Aage_26 |  -.0741264   .0079009    -9.38   0.000    -.0896122   -.0586406
    _Aage_27 |  -.0958468   .0079266   -12.09   0.000     -.111383   -.0803106
    _Aage_28 |  -.1005636   .0079688   -12.62   0.000    -.1161825   -.0849447
    _Aage_29 |  -.1194278   .0080075   -14.91   0.000    -.1351224   -.1037331
    _Aage_30 |  -.1228196   .0081682   -15.04   0.000    -.1388293   -.1068099
    _Aage_31 |  -.1555236   .0084993   -18.30   0.000    -.1721824   -.1388649
       _cons |   .3227524   .0060007    53.79   0.000     .3109909    .3345138
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =    62,137
-------------+----------------------------------   F(9, 62127)     =      7.62
       Model |  1.28129555         9  .142366173   Prob > F        =    0.0000
    Residual |  1161.11985    62,127  .018689456   R-squared       =    0.0011
-------------+----------------------------------   Adj R-squared   =    0.0010
       Total |  1162.40115    62,136   .01870737   Root MSE        =    .13671

------------------------------------------------------------------------------
     tempend |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    _Aage_23 |   -.008458   .0026109    -3.24   0.001    -.0135754   -.0033406
    _Aage_24 |  -.0063871   .0025677    -2.49   0.013    -.0114198   -.0013543
    _Aage_25 |  -.0064104   .0025347    -2.53   0.011    -.0113784   -.0014423
    _Aage_26 |  -.0112056   .0025274    -4.43   0.000    -.0161594   -.0062518
    _Aage_27 |   -.012391   .0025357    -4.89   0.000    -.0173609   -.0074211
    _Aage_28 |  -.0148218   .0025492    -5.81   0.000    -.0198181   -.0098254
    _Aage_29 |  -.0141824   .0025615    -5.54   0.000     -.019203   -.0091618
    _Aage_30 |  -.0141041   .0026129    -5.40   0.000    -.0192255   -.0089828
    _Aage_31 |  -.0160847   .0027189    -5.92   0.000    -.0214138   -.0107557
       _cons |   .0295741   .0019196    15.41   0.000     .0258117    .0333365
------------------------------------------------------------------------------

. 
. sort year

. 
. table year [pw=custwt], contents(mean empd_adj mean mainisnew_adj mean invol_adj)

----------------------------------------------------------
     year | mean(empd_adj)  mean(mainis~j)  mean(invol_~j)
----------+-----------------------------------------------
       80 |       .0244065        .0052925       -.0577273
       81 |       .0042484       -.0241432        .0337983
       82 |      -.0016233       -.0479925       -.0336015
       83 |      -.0000168       -.1000939        .0911907
       84 |       .0275157       -.0389941        .0044014
       85 |       .0113154       -.0227757       -.0417624
       86 |       .0149448        .0115438        -.021013
       87 |       .0180801        .0262238        -.038874
       88 |       .0121104        .0561737       -.0614244
       89 |       .0170299       -.0121847       -.0340741
       90 |       .0219706        .0071953       -.0446401
       91 |      -.0006309       -.0482424         .009923
       92 |       .0097757       -.0379855        .0230378
       93 |       .0196937       -.0630026       -.0011835
       94 |       .0109474        .0068614       -.0368198
----------------------------------------------------------

. table year [pw=custwt], contents(mean sepinvol_adj mean sepvol_adj mean tempend_adj)

----------------------------------------------------------
     year | mean(sepinv~j)  mean(sepvol~j)  mean(tempen~j)
----------+-----------------------------------------------
       80 |      -.0346171        .0028748       -.0077943
       81 |       .0097541       -.0257315       -.0015508
       82 |       -.024025       -.0115924       -.0102711
       83 |       .0127991       -.0770601       -.0101228
       84 |      -.0104891       -.0309284        .0034089
       85 |      -.0218458       -.0024896        -.000684
       86 |      -.0042443        .0168526        .0005193
       87 |      -.0084687        .0296355        .0009276
       88 |      -.0138653        .0437143       -.0013639
       89 |      -.0132166        .0030392        .0019572
       90 |      -.0159089        .0057376       -.0013342
       91 |      -.0097886       -.0336144       -.0042661
       92 |      -.0028236       -.0280094       -.0021046
       93 |      -.0090361       -.0211351       -.0007018
       94 |      -.0061321         .020311       -.0011404
----------------------------------------------------------

. 
. 
. 
end of do-file

